{"input_text": "La consideración 0 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; "}
{"input_text": "La consideración 1 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 226 de la Constitución de la República del Ecuador prescribe: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; "}
{"input_text": "La consideración 2 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 227 de la Constitución de la República del Ecuador prescribe: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia coordinación participación planificación transparencia y evaluación.”; jerarquía desconcentración descentralización eficiencia calidad "}
{"input_text": "La consideración 3 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. […]”; "}
{"input_text": "La consideración 4 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos manda: “La presente Ley rige para las instituciones del sector público y privado que actualmente o en el futuro administren bases o registros públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; "}
{"input_text": "La consideración 5 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el inciso primero del artículo 4 de la Ley Orgánica del Sistema Nacional de Registros Públicos dispone: “Las instituciones del sector público y privado y las personas naturales que actualmente o en el futuro administren bases o registros de datos públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. […]”; "}
{"input_text": "La consideración 6 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Son confidenciales los datos de carácter personal. El acceso a estos datos solo será posible cuando quien los requiera se encuentre debidamente legitimado conforme a los parámetros previstos en la Ley Orgánica de Protección de Datos Personales su respectivo reglamento y demás normativa emitida por la Autoridad de Protección de Datos Personales. Al amparo de esta Ley Página 1 de 6 para acceder a la información sobre el patrimonio de las personas cualquier solicitante deberá justificar y motivar su requerimiento declarar el uso que hará del mismo y consignar sus datos básicos de identidad tales como nombres y apellidos completos número del documento de identidad o ciudadanía dirección domiciliaria y los demás datos que mediante el respectivo reglamento se determinen. Un uso distinto al declarado dará lugar a la determinación de responsabilidades sin perjuicio de las acciones legales que el titular de la información pueda ejercer. La Directora o Director Nacional de Registros Públicos definirá los demás datos que integran el sistema nacional y el tipo de reserva y accesibilidad.”; "}
{"input_text": "La consideración 7 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: “1. Presidir el Sistema Nacional de Registros Públicos cumpliendo y haciendo cumplir sus finalidades y objetivos; 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; [...] 5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca. […]”; "}
{"input_text": "La consideración 8 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el numeral 2 del artículo 21 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos establece: “Sin perjuicio de lo establecido en la Ley del Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoria la información que reposa en: […] 2. El Sistema Nacional de Registros Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registros Públicos y la entidad que presida el Sistema Nacional de Registros Públicos.”; "}
{"input_text": "La consideración 9 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “El Director Nacional de Registros Públicos previa resolución motivada podrá disponer que se incorporen al Sistema aquellos registros públicos no previstos expresamente en la Ley. La resolución de incorporación podrá expedirse una vez que se verifique lo siguiente: 1. "}
{"input_text": "La consideración 10 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que se trate de base de datos que contengan un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y 2. "}
{"input_text": "La consideración 11 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía. En su resolución el Director indicará si los datos que constan en los registros que se incorporan al Sistema son accesibles o confidenciales y les dará la protección que corresponda según dicha clasificación. Este estatus podrá ser modificado previa resolución motivada en cualquier tiempo de acuerdo a las circunstancias del momento pero siempre dentro del marco jurídico vigente.”; "}
{"input_text": "La consideración 12 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 10 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos ordena: “Son funciones del Director Nacional de Registros Públicos a más de las señaladas en la Ley y este Reglamento las siguientes: […] 4. Emitir las resoluciones técnicas operativas y administrativas necesarias para el adecuado funcionamiento del Sistema; […] 8. Ordenar la publicación de la lista de registros públicos de datos para conocimiento de los usuarios; 9. Impulsar promover proteger y difundir el ejercicio de los derechos ciudadanos especialmente en Página 2 de 6 lo referente al acceso a la información y a la protección de datos públicos de carácter personal; […] 11. Determinar mediante resolución las condiciones técnicas necesarias para la ejecución de la interoperabilidad.”; "}
{"input_text": "La consideración 13 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 15 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “La Dirección Nacional de Registros Públicos estandarizará y administrará la información de las fuentes propias y externas para lo cual todos los integrantes del sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea para proyectos y servicios de información.”; "}
{"input_text": "La consideración 14 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 con el cual se decretó la Implementación del Gobierno Electrónico en la Función Ejecutiva expresa: “La implementación del gobierno electrónico en la Función Ejecutiva consiste en el uso de las tecnologías de la información y comunicación por parte de las entidades para transformar las relaciones con los ciudadanos entre entidades de gobierno y empresas privadas a fin de mejorar la calidad de los servicios gubernamentales a los ciudadanos promover la interacción con las empresas privadas fortalecer la participación ciudadana a través del acceso a la información y servicios gubernamentales eficientes y eficaces y coadyuvar con la transparencia participación y colaboración ciudadana.”; "}
{"input_text": "La consideración 15 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 señala: “Obligaciones de las entidades de la Función Ejecutiva.- A las instituciones de la Función Ejecutiva dentro del ámbito de este Decreto Ejecutivo les corresponderá: a. Colaborar en la generación de los instrumentos que sean necesarios para la aplicación de presente Decreto así como para su cabal cumplimiento; y b. Utilizar los medios electrónicos que determine el Ministerio de Telecomunicaciones y de la Sociedad de la Información para la aplicación efectiva de las políticas de gobierno electrónico en la gestión pública.”; "}
{"input_text": "La consideración 16 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que mediante Resolución Nro. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que regula la clasificación de los datos que integren el Sistema Nacional de Registros Públicos”.; "}
{"input_text": "La consideración 17 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que el artículo 3 de la Resolución Nro. 035-NG-DINARDAP-2016 determina que: “Para efectos de la presente Norma la información que integra el SINARDAP y la que integra las bases de datos públicos se deberá clasificar en: a) Información accesible; b) Información confidencial.”; "}
{"input_text": "La consideración 18 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que a través de Resolución Nro. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registros Públicos” cuyo artículo 7 dispone: “(…) Una vez que el ente registral poseedor de la fuente fuente externa o fuente propia remita el Formulario de Registro del Ente Registral y la Matriz de Datos Públicos la Dirección de Gestión y Registro solicitará a la Dirección de Protección de la Información la elaboración de la clasificación de la información en base (sic) a la “Norma que regula la clasificación de los datos e información que integra el Sistema Nacional de Registros Públicos.” […]”; Página 3 de 6 "}
{"input_text": "La consideración 19 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que a través de Resolución Nro. 044-NG-DINARDAP-2016 de 22 de septiembre de 2016 contentivo de la “Norma Técnica de Interoperabilidad del Sistema Nacional de Registro de Datos Públicos” en el artículo 5 se establece para la integración: “[…] de los entes registrales fuentes propias y fuentes externas considerados proveedores de información de registro de datos públicos se deben considerar los siguientes componentes: Conectividad Mecanismo de Integración Seguridad.”; "}
{"input_text": "La consideración 20 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que mediante oficio Nro. INEC-INEC-2022-0654-O de 16 de septiembre de 2022 suscrito por el Mgs. Roberto Castillo Director Ejecutivo del Instituto Nacional de Estadística y Censos que en su parte pertinente solicita: “En respuesta al Oficio Nro. DINARDP-CGRS-2022-0456-OF mediante el cual la DINARP solicitó la integración al Sistema Nacional de Registros Públicos de los campos requeridos por la Dirección General de Registro Civil Identificación y Cedulación (DIGERCIC) para proseguir con las actividades direccionadas a garantizar la interoperabilidad de sistemas de información integración y consumo de datos con las instituciones fuente y consumidoras (…)”; "}
{"input_text": "La consideración 21 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que mediante informe Nro. DPI-CLASIFICACION-2022-018 de 01 de diciembre de 2022 suscrito por la Dirección de Protección de la Información que contiene el “Informe de Clasificación de Datos” en el cual en su parte pertinente concluye: “(…) Por las características propias de los datos a integrar por parte del INEC se los categoriza como datos accesibles sin justificación jurídica puesto que se tratan de datos que se encuentran sujetos al principio de publicidad cuya acceso a instituciones públicas no provoca un menoscabo de derechos individuales y su entrega permite a las entidades estatales definidas en el artículo 225 de la Constitución de la República del Ecuador que puedan interoperar y brindad un servicio público enmarcado en los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación que rigen la Administración Pública. Los servidores públicos en el desempeño de sus actividades diarias deben guardar el secreto de los datos bajo su tratamiento cuya difusión es prohibida legalmente por lo que deben mantener la debida discreción sobre aquella información a la que tengan acceso debido a su cargo no pudiendo hacer uso de la misma en beneficio propio o de terceros. (…)”; "}
{"input_text": "La consideración 22 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que mediante memorandos Nro. DINARP-DGR-2023-007-M de 09 de enero de 2023 y DINARP-DGR-2023-0021-M de 30 de enero de 2023 suscritos por la Dirección de Gestión y Registro parafraseando el contenido de los mismos informa: Conforme a lo establecido en el Art. 4 del Reglamento de la Ley del Sistema Nacional de Registros de Datos Públicos y la normativa enunciada por el Instituto Nacional de Estadísticas y Censos misma que hace referencia a información relacionada a personas naturales y es administrada por una entidad del sector público; me permito señalar el cumplimiento de la normativa referente a la incorporación de los entes registrales al Sistema Nacional de Registros Públicos.” "}
{"input_text": "La consideración 23 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "Que mediante Acuerdo Ministerial Nro. MINTEL-MINTEL-2021-0003 de 22 de junio del 2021 la doctora Vianna Maino Isaías Ministra de Telecomunicaciones y de la Sociedad de la Información resuelve: “(...) Designar a la abogada Angie Karina Jijón Mancheno como Directora Nacional de Registros Públicos quién ejercerá las competencias y atribuciones previstas en la Le y Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable (...)”; Página 4 de 6 En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación"}
{"input_text": "La resolución 0 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "ARTICULO1.- Incorporar al “Instituto Nacional de Estadística y Censos” (INEC) al Sistema Nacional de Registros Públicos por ser poseedor y administrador de información pública perteneciente a personas naturales. "}
{"input_text": "La resolución 1 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "ARTICULO2.- Integrar los datos otorgados por el “Instituto Nacional de Estadística y Censos” (INEC) al Sistema Nacional de Registros Públicos conforme al siguiente detalle: Nro. NOMBRE IDENTIFICADOR DEL CAMPO DESCRIPCIÓN DEL CAMPO CLASIFICACIÓN Accesible sin justificación jurídica Accesible con justificación jurídica 1 Código de Respuesta 2 Descripción de Respuesta Código de respuesta que se crea y asigna a nivel de código fuente posterior a la consulta de la existencia de un formulario de defunciones generales. Descripción del Código de respuesta que se crea y asigna a nivel de código fuente posterior a la consulta de la existencia de un formulario de defunciones generales. X X Nota: La información contenida en el cuadro precedente ha sido obtenida de manera textual de la “Matriz de Datos Públicos” remitida por la entidad requirente. "}
{"input_text": "La resolución 2 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "ARTICULO3.- El Instituto Nacional de Estadística y Censos (INEC) otorgará la información que versa en el artículo 2 en la forma periodicidad medio soporte y bajo las seguridades prescritas por la Dirección Nacional de Registros Públicos. "}
{"input_text": "La resolución 3 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "ARTICULO4.- El Instituto Nacional de Estadística y Censos (INEC) es responsable sobre la veracidad autenticidad actualización administración conservación integridad protección y control de sus registros y bases de datos a su cargo."}
{"input_text": "La disposición 0 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 0- Encárguese de la ejecución cumplimiento y seguimiento de la presente resolución a la Coordinación de Gestión Registro y Seguimiento y la Coordinación de Infraestructura y Seguridad Informática de la Dirección Nacional de Registros Públicos. Página 5 de 6 "}
{"input_text": "La disposición 1 del documento de resolución 001-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 1- Encárguese a la Dirección de Comunicación Social la difusión y publicación de la presente resolución en la página web institucional así como la publicación del presente listado de registros públicos constante en la página web institucional. Dado en la ciudad de Quito esta resolución entra en vigencia en la fecha que consta registrada en la firma electrónica. Quito a los 3 del mes de febrero de 2023. Abg. Angie Karina Jijón Mancheno DIRECTORA NACIONAL DE REGISTROS PÚBLICOS Página 6 de 6"}
{"input_text": "La consideración 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; "}
{"input_text": "La consideración 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 226 de la Constitución de la República del Ecuador prescribe: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; "}
{"input_text": "La consideración 2 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 227 de la Constitución de la República del Ecuador prescribe: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia coordinación participación planificación transparencia y evaluación.”; jerarquía desconcentración descentralización eficiencia calidad "}
{"input_text": "La consideración 3 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. […]”; "}
{"input_text": "La consideración 4 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos manda: “La presente Ley rige para las instituciones del sector público y privado que actualmente o en el futuro administren bases o registros públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; "}
{"input_text": "La consideración 5 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el inciso primero del artículo 4 de la Ley Orgánica del Sistema Nacional de Registros Públicos dispone: “Las instituciones del sector público y privado y las personas naturales que actualmente o en el futuro administren bases o registros de datos públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. […]”; "}
{"input_text": "La consideración 6 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Son confidenciales los datos de carácter personal. El acceso a estos datos solo será posible cuando quien los requiera se encuentre debidamente legitimado conforme a los parámetros previstos en la Ley Orgánica de Protección de Datos Personales su respectivo reglamento y demás normativa emitida por la Autoridad de Protección de Datos Personales. Al amparo de esta Ley Página 1 de 6 para acceder a la información sobre el patrimonio de las personas cualquier solicitante deberá justificar y motivar su requerimiento declarar el uso que hará del mismo y consignar sus datos básicos de identidad tales como nombres y apellidos completos número del documento de identidad o ciudadanía dirección domiciliaria y los demás datos que mediante el respectivo reglamento se determinen. Un uso distinto al declarado dará lugar a la determinación de responsabilidades sin perjuicio de las acciones legales que el titular de la información pueda ejercer. La Directora o Director Nacional de Registros Públicos definirá los demás datos que integran el sistema nacional y el tipo de reserva y accesibilidad.”; "}
{"input_text": "La consideración 7 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: “1. Presidir el Sistema Nacional de Registros Públicos cumpliendo y haciendo cumplir sus finalidades y objetivos; 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; [...] 5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca. […]”; "}
{"input_text": "La consideración 8 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el numeral 2 del artículo 21 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos establece: “Sin perjuicio de lo establecido en la Ley del Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoria la información que reposa en: […] 2. El Sistema Nacional de Registros Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registros Públicos y la entidad que presida el Sistema Nacional de Registros Públicos.”; "}
{"input_text": "La consideración 9 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “El Director Nacional de Registros Públicos previa resolución motivada podrá disponer que se incorporen al Sistema aquellos registros públicos no previstos expresamente en la Ley. La resolución de incorporación podrá expedirse una vez que se verifique lo siguiente: 1. "}
{"input_text": "La consideración 10 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que se trate de base de datos que contengan un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y 2. "}
{"input_text": "La consideración 11 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía. En su resolución el Director indicará si los datos que constan en los registros que se incorporan al Sistema son accesibles o confidenciales y les dará la protección que corresponda según dicha clasificación. Este estatus podrá ser modificado previa resolución motivada en cualquier tiempo de acuerdo a las circunstancias del momento pero siempre dentro del marco jurídico vigente.”; "}
{"input_text": "La consideración 12 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 10 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos ordena: “Son funciones del Director Nacional de Registros Públicos a más de las señaladas en la Ley y este Reglamento las siguientes: […] 4. Emitir las resoluciones técnicas operativas y administrativas necesarias para el adecuado funcionamiento del Sistema; […] 8. Ordenar la publicación de la lista de registros públicos de datos para conocimiento de los usuarios; 9. Impulsar promover proteger y difundir el ejercicio de los derechos ciudadanos especialmente en Página 2 de 6 lo referente al acceso a la información y a la protección de datos públicos de carácter personal; […] 11. Determinar mediante resolución las condiciones técnicas necesarias para la ejecución de la interoperabilidad.”; "}
{"input_text": "La consideración 13 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 15 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “La Dirección Nacional de Registros Públicos estandarizará y administrará la información de las fuentes propias y externas para lo cual todos los integrantes del sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea para proyectos y servicios de información.”; "}
{"input_text": "La consideración 14 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 con el cual se decretó la Implementación del Gobierno Electrónico en la Función Ejecutiva expresa: “La implementación del gobierno electrónico en la Función Ejecutiva consiste en el uso de las tecnologías de la información y comunicación por parte de las entidades para transformar las relaciones con los ciudadanos entre entidades de gobierno y empresas privadas a fin de mejorar la calidad de los servicios gubernamentales a los ciudadanos promover la interacción con las empresas privadas fortalecer la participación ciudadana a través del acceso a la información y servicios gubernamentales eficientes y eficaces y coadyuvar con la transparencia participación y colaboración ciudadana.”; "}
{"input_text": "La consideración 15 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 señala: “Obligaciones de las entidades de la Función Ejecutiva.- A las instituciones de la Función Ejecutiva dentro del ámbito de este Decreto Ejecutivo les corresponderá: a. Colaborar en la generación de los instrumentos que sean necesarios para la aplicación de presente Decreto así como para su cabal cumplimiento; y b. Utilizar los medios electrónicos que determine el Ministerio de Telecomunicaciones y de la Sociedad de la Información para la aplicación efectiva de las políticas de gobierno electrónico en la gestión pública.”; "}
{"input_text": "La consideración 16 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que mediante Resolución Nro. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que regula la clasificación de los datos que integren el Sistema Nacional de Registros Públicos”.; "}
{"input_text": "La consideración 17 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que el artículo 3 de la Resolución Nro. 035-NG-DINARDAP-2016 determina que: “Para efectos de la presente Norma la información que integra el SINARDAP y la que integra las bases de datos públicos se deberá clasificar en: a) Información accesible; b) Información confidencial.”; "}
{"input_text": "La consideración 18 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que a través de Resolución Nro. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registros Públicos” cuyo artículo 7 dispone: “(…) Una vez que el ente registral poseedor de la fuente fuente externa o fuente propia remita el Formulario de Registro del Ente Registral y la Matriz de Datos Públicos la Dirección de Gestión y Registro solicitará a la Dirección de Protección de la Información la elaboración de la clasificación de la información en base (sic) a la “Norma que regula la clasificación de los datos e información que integra el Sistema Nacional de Registros Públicos.” […]”; Página 3 de 6 "}
{"input_text": "La consideración 19 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que a través de Resolución Nro. 044-NG-DINARDAP-2016 de 22 de septiembre de 2016 contentivo de la “Norma Técnica de Interoperabilidad del Sistema Nacional de Registro de Datos Públicos” en el artículo 5 se establece para la integración: “[…] de los entes registrales fuentes propias y fuentes externas considerados proveedores de información de registro de datos públicos se deben considerar los siguientes componentes: Conectividad Mecanismo de Integración Seguridad.”; mediante informe Nro. DPI-CLASIFICACION-2022-020 de 08 de diciembre de 2022 suscrito por la Dirección de Protección de la Información contentivo del “Informe de Clasificación de Datos” que en su parte pertinente concluye: “(…) Por las características de los datos detallados en el numeral 4.1 del presente informe se los cataloga como confidenciales por lo que para su acceso se requerirá la debida legitimación puesto que en caso de ser utilizados inadecuadamente sin que cumplan con la finalidad específica se atenta contra la dignidad e integridad de las personas naturales así como a los derechos y libertades fundamentales consagrados en la Constitución e instrumentos internacionales. En virtud de ello para solicitar el acceso a estos campos se requiere reunir las condiciones de legitimación señalar la correspondiente justificación jurídica y determinar una finalidad clara de su uso bajo el amparo de las disposiciones de la Ley Orgánica de Protección de Datos Personales. (…)”; "}
{"input_text": "La consideración 20 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que mediante memorandos Nros. DINARP-DGR-2023-0017-M de 23 de enero de 2023 y DINARP-DGR-2023-0020-M de 30 de enero de 2023 suscritos por la Dirección de Gestión y Registro parafraseando el contenido de los mismos informa: Conforme a lo establecido en el Art. 4 del Reglamento de la Ley del Sistema Nacional de Registros de Datos Públicos el Ministerio de Defensa Nacional mantiene una base relacionada a personas naturales y es administrada por una entidad del sector público; por lo cual me permito señalar el cumplimiento de la normativa referente a la incorporación de los entes registrales al Sistema Nacional de Registros Públicos. "}
{"input_text": "La consideración 21 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "Que mediante Acuerdo Ministerial Nro. MINTEL-MINTEL-2021-0003 de 22 de junio del 2021 la doctora Vianna Maino Isaías Ministra de Telecomunicaciones y de la Sociedad de la Información resuelve: “(...) Designar a la abogada Angie Karina Jijón Mancheno como Directora Nacional de Registros Públicos quién ejercerá las competencias y atribuciones previstas en la Le y Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable (...)”; En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación"}
{"input_text": "La resolución 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "ARTICULO1.- Incorporar al “Ministerio de Defensa Nacional” como parte del Sistema Nacional de Registros Públicos por ser una institución que posee y administra información pública perteneciente a personas naturales. "}
{"input_text": "La resolución 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "ARTICULO2.- Integrar los datos otorgados por el “Ministerio de Defensa Nacional” al Sistema Nacional de Registros Públicos conforme al siguiente detalle: Página 4 de 6 Nro. NOMBRE IDENTIFICADOR DEL CAMPO DESCRIPCIÓN DEL CAMPO 1. id_personal identificador: se refiere a la clave primaria de la base de datos que sería como campo único. cédula_personal cédula de identidad nombres_personal nombres y apellidos 2. 3. CLASIFICACIÓN Accesible sin justificación jurídica Accesible con justificación jurídica x x x Nota: La información contenida en el cuadro precedente ha sido obtenida de manera textual de la “Matriz de Datos Públicos” remitida por la entidad requirente. "}
{"input_text": "La resolución 2 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "ARTICULO3.- El Ministerio de Defensa otorgará la información que versa en el artículo 2 en la forma periodicidad medio soporte y bajo las seguridades prescritas por la Dirección Nacional de Registros Públicos. "}
{"input_text": "La resolución 3 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "ARTICULO4.- El Ministerio de Defensa es responsable sobre la veracidad autenticidad actualización administración conservación integridad protección y control de sus registros y bases de datos a su cargo."}
{"input_text": "La disposición 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 0- Encárguese de la ejecución cumplimiento y seguimiento de la presente resolución a la Coordinación de Gestión Registro y Seguimiento y la Coordinación de Infraestructura y Seguridad Informática de la Dirección Nacional de Registros Públicos. "}
{"input_text": "La disposición 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 1 - Encárguese a la Dirección de Comunicación Social la difusión y publicación de la presente resolución en la página web institucional así como la publicación del presente listado de registros públicos constante en la página web institucional. Dado en la ciudad de Quito esta resolución entra en vigencia en la fecha que consta registrada en la firma electrónica. Quito a los 03 del mes de febrero de 2023. Abg. Angie Karina Jijón Mancheno DIRECTORA NACIONAL DE REGISTROS PÚBLICOS Página 5 de 6 Página 6 de 6"}
{"input_text": "La consideración 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 18 de la Constitución de la República del Ecuador determina: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; el numeral 19 del artículo 66 de la Constitución de la República del Ecuador prescribe: “El derecho a la protección de datos de carácter personal que incluye el acceso y la decisión sobre información y datos de este carácter así como su correspondiente protección. La recolección archivo procesamiento distribución o difusión de estos datos o información requerirán la autorización del titular o el mandato de la ley.”; el artículo 226 de la Constitución de la República del Ecuador prevé: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; el artículo 227 de la Constitución de la República del Ecuador señala: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.”; el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos crea y regula el Sistema Nacional de Registros Públicos para lo cual determina: \"La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. El objeto de la ley es: garantizar la seguridad jurídica organizar regular sistematizar e Página 1 de 18 "}
{"input_text": "La consideración 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que interconectar la información así como: la eficacia y eficiencia de su manejo su publicidad transparencia acceso e implementación de nuevas tecnologías.\"; el artículo 13 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: \"Son registros públicos: el Registro Civil de la Propiedad Mercantil Societario Vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios y los que en la actualidad o en el futuro determine la Dirección Nacional de Registros Públicos en el marco de lo dispuesto por la Constitución de la República y las leyes vigentes. Los registros son dependencias públicas desconcentrados con autonomía registral y administrativa en los términos de la presente ley y sujetos al control auditoría y vigilancia de la Dirección Nacional de Registros Públicos (...)\"; el artículo 14 de la Ley Orgánica del Sistema Nacional de Registros Públicos señala: \"Los registros públicos y demás oficinas que manejen información relacionada con el objeto de esta Ley administrarán sus bases de datos en coordinación con la Dirección Nacional de Registros Públicos. Sus atribuciones responsabilidades y funciones serán determinadas por la ley pertinente a cada registro y por el Reglamento a la presente ley.\"; el artículo 22 de la Ley Orgánica del Sistema Nacional de Registros Públicos indica: \"La Dirección Nacional de Registros Públicos se encargará de organizar un sistema de interconexión cruzado entre los registros público y privado que en la actualidad o en el futuro administren bases de datos públicos de acuerdo a lo establecido en esta Ley y en su Reglamento.”; el artículo 26 de la Ley Orgánica del Sistema Nacional de Registros Públicos estipula: “Toda base informática de datos debe constar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impida la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; los numerales 2 4 y 14 del artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos señalan entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: \"2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; (...) 4. Promover dictar y ejecutar a través de los diferentes registros las políticas públicas a las que se refiere esta ley así como las normas generales para el seguimiento y control de las mismas; (…) 14. Controlar y supervisar que las entidades pertenecientes al Sistema Nacional de Registros Públicos incorporen mecanismos de protección de datos personales así como dar cumplimiento a las disposiciones establecidas en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa que la Autoridad de Protección de Datos Personales dicte para el efecto:\"; Página 2 de 18 "}
{"input_text": "La consideración 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 19 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos establece: \"La entidad rectora de la simplificación de trámites tendrá a su cargo la administración del registro único de trámites administrativos el cual deberá integrarse entre otros al Sistema Nacional de Registros Públicos. La información que conste en el registro será generada por las entidades reguladas por esta Ley y consolidada en una base de datos nacional que incorpore en forma ordenada y periódica la información sobre los diferentes trámites administrativos incluida la base normativa que sustenta el trámite los requisitos que se deben cumplir el tiempo aproximado que toma la gestión del trámite el lugar en el que se lo debe realizar y cualquier otra información que sea dispuesta por la entidad rectora de la simplificación de trámites. Esta información deberá ser la misma que conste en la página web institucional de las entidades reguladas por esta Ley. (…)”; "}
{"input_text": "La consideración 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el numeral 2 del artículo 21 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos preceptúa: \"Sin perjuicio de lo establecido en la Ley del Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoriamente la información que reposa en: (...) 2. El Sistema Nacional de Registros Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registros Públicos y la entidad que presida el Sistema Nacional de Registros Públicos.\"; "}
{"input_text": "La consideración 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 de la Ley Orgánica De Protección de Datos Personales establece: “El objeto y finalidad de la presente ley es garantizar el ejercicio del derecho a la protección de datos personales que incluye el acceso y decisión sobre información y datos de este carácter así como su correspondiente protección. Para dicho efecto regula prevé y desarrolla principios derechos obligaciones y mecanismos de tutela.”; el artículo 40 de la Ley Orgánica de Protección de Datos Personales prevé: “Para el análisis de riesgos amenazas y vulnerabilidades el responsable y el encargado del tratamiento de los datos personales deberán utilizar una metodología que considere entre otras: 1) Las particularidades del tratamiento; 2) Las particularidades de las partes involucradas; y 3) Las categorías y el volumen de datos personales objeto de tratamiento.”; "}
{"input_text": "La consideración 5 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 2 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos respecto al Sistema Nacional de Registros Públicos indica: \"Está conformado por las instituciones públicas y privadas determinadas en la Ley Orgánica del Sistema Nacional de Registros Públicos y las que en el futuro Página 3 de 18 determine mediante resolución el Director Nacional de Registros Públicos en ejercicio de sus competencias.\"; "}
{"input_text": "La consideración 6 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 9 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos en cuanto a la Regulación y Control establece: \"Sin perjuicio de las competencias que ejercen los entes de control definidos en la Constitución de la República la Dirección Nacional de Registros Públicos es el órgano de regulación control auditoría y vigilancia de todos los integrantes del Sistema Nacional de Registros Públicos en torno a la interoperabilidad de datos. La regulación control auditoría y vigilancia comprenden todas las acciones necesarias para garantizar la disponibilidad del servicio. Las decisiones administrativas internas de cada ente registral corresponden exclusivamente a sus autoridades pero la Dirección Nacional de Registro Públicos arbitrará las medidas que sean del caso cuando perjudiquen la disponibilidad de los servicios.\"; "}
{"input_text": "La consideración 7 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 13 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos prevé: \"La Dirección Nacional de Registros Públicos de conformidad con la ley expedirá las normas técnicas que contengan los estándares mecanismos y herramientas para precautelar la seguridad custodia y conservación de la información accesible y confidencial. La integridad y protección de los registros de datos públicos es responsabilidad de las instituciones del sector público y privado a través de sus representantes legales y las personas naturales que directamente los administren.\"; "}
{"input_text": "La consideración 8 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que mediante Resolución No. 009-NG-DINARDAP-2021 de 14 de mayo del 2021 emitida por la Dirección Nacional de Registros Públicos se expidió: “La Norma que Regula el Tratamiento de Datos Personales en el Sistema Nacional de Registro de Datos Públicos.”; "}
{"input_text": "La consideración 9 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 de la Resolución No. 009-NG-DINARDAP-2021 resuelve: “Establecer criterios al tratamiento de datos personales en el Sistema Nacional de Registro de Datos Públicos.”; el artículo 8 de la Resolución No. 009-NG-DINARDAP-2021 estipula: “El tratamiento de datos personales se considerara adecuado cuando se materialicen los principios y derechos previstos en la presente Resolución a lo largo del ciclo de vida del dato para ello al menos deberán concurrir las siguientes medidas: a) Gestión del riesgo y evaluación de impacto; b) Política (sic) de protección de datos personales. c) Acuerdo de confidencialidad.”; "}
{"input_text": "La consideración 10 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el artículo 15 de la Resolución No. 009-NG-DINARDAP-2021 establece: “Los responsables y encargados de tratamiento son responsables sobre la integridad disponibilidad y confidencialidad de la información así como del cumplimiento de los principios y derechos contenidos en la presente resolución que son parte Página 4 de 18 del contenido esencial del derecho a la protección datos personales y en consecuencia deben ser capaces de demostrar su efectiva aplicación. Adicionalmente los responsables y encargados de tratamiento podrán implementar medidas adicionales apropiadas de cualquier naturaleza orientadas a promover el ejercicio del derecho a la protección de datos personales que no limiten la aplicación de la presente resolución y la efectivización de derechos individuales y libertades fundamentales.”; "}
{"input_text": "La consideración 11 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que mediante memorando Nro. DINARP-CISI-2023-0033-M de 02 de marzo de 2023 suscrito por el Coordinador de Infraestructura y Seguridad Informática remite informe técnico respecto a la elaboración de informes de excepcionalidad para la entrega de datos e información a las entidades que integran el Sistema Nacional de Registros Públicos fuera de las plataformas de interoperabilidad. "}
{"input_text": "La consideración 12 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que mediante memorando Nro. DINARP-DGR-2023-00-M de 24 de febrero de 2023 la Dirección de Gestión y Registro envía informe respecto a la necesidad técnica de establecer un procedimiento de entrega directa y excepcional de datos o información entre las entidades que conforman el sistema nacional de registros públicos que requieran alta frecuencia de consumo y/o descarga de grandes volúmenes de información que no son posibles mediante la consulta de datos “uno a uno” actualmente disponible como único método de la plataforma de interoperabilidad de DINARP. "}
{"input_text": "La consideración 13 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que mediante memorando Nro. DINARP-CGRS-2023-0153-M de 08 de mayo de 2023 la Coordinación de Gestión Registro y Seguimiento realiza un alcance al informe remitido por la Dirección de Gestión y Registro en el que concluye: “La aplicación de la Resolución No.006-NG-DINARDAP-2019 permite que las instituciones consumidoras de información realicen procesos institucionales que requieran alta frecuencia de consumo y/o descarga de grandes volúmenes de información que no son posibles mediante la consulta de datos “uno a uno” actualmente disponible como único método de la plataforma de interoperabilidad de DINARP; y que las limitaciones de la plataforma de interoperabilidad y la falta de especialistas en analítica de datos impide el almacenamiento de grandes volúmenes de información o bases completas de datos y el desarrollo de productos de analítica de datos que son de competencia de la DINARP y que son de contínua justificación por parte de las consumidoras para solicitar la excepcionalidad de consumo”; por lo cual recomienda “"}
{"input_text": "La consideración 14 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que la Coordinación de Normativa y Protección de la Información reforme la resolución 006 conforme las recomendaciones indicadas en el informe de la Coordinación de Infraestructura y Seguridad Informática a fin de que se realice mejoras en el procedimiento y actualización de los criterios de excepcionalidad; y que se considere el tiempo de autorización sea de 1 año.”; Página 5 de 18 "}
{"input_text": "La consideración 15 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que mediante memorando No. DINARP-CISI-2023-0073-M de 10 de mayo de 2023 suscrito por el Coordinador de Infraestructura y Seguridad Informática remite alcance al memorando No. DINARP-CISI-2023-0033-M cuyo informe técnico actualizado recomienda: “Se recomienda autorizar entregas directas siempre que concurran dos o más de los siguientes criterios: 1. Alta frecuencia de actualización de datos por parte de la Entidad Fuente de la información: Es el proceso de actualización que realizan las entidades fuentes al generar recopilar o respaldar y poner en disponibilidad los datos para el respectivo consumo; y está determinada por la capacidad máxima de transaccionalidad que el bus de datos de la DINARP puede soportar; 2. Eficiencia tecnológica demostrable: se refiere a las tecnologías que usan emisor y receptor superiores a las tecnologías con las que cuenta la DINARP para el intercambio de datos; 3. Analítica de Datos: Es el proceso de descubrir interpretar y transmitir patrones importantes presentes en grandes volúmenes de datos. Provenientes de una entidad fuente para la generación de manera sencilla que nos permita ver estadísticas y datos importantes así como para establecer tendencias y tomar decisiones más informadas que ayuden a las instituciones o empresas a mejorar las ventas reducir los costos.; y 4. Obsolescencia de los recursos tecnológicos del sistema de interoperabilidad que impidan la implementación de servicios web en el Sistema Nacional de Registros Públicos. Se recomienda incorporar para la toma de decisiones de excepcionalidad la generación de un informe tecnológico en el cual se validen los siguientes puntos: 1. "}
{"input_text": "La consideración 16 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que las razones expuestas en las especificaciones técnicas estén acordes a los criterios de excepción; 2. El cumplimiento de los protocolos de seguridad; 3. La frecuencia de actualización; 4. El tiempo solicitado; 5. Tiempo de conservación; 6. Método de consumo; y 7. "}
{"input_text": "La consideración 17 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que el análisis de riesgo y evaluación de impacto cumplan con las especificaciones técnicas.”; y "}
{"input_text": "La consideración 18 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "Que con Acuerdo Ministerial Nro. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 el Ab. Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información Subrogante resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional a partir del 7 de abril de 2023 quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable(…)”. En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registro Públicos y su Reglamento de aplicación."}
{"input_text": "La resolución 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULOESTABLECER EL PROCEDIMIENTO DE ENTREGA DIRECTA Y EXCEPCIONAL DE DATOS O INFORMACIÓN ENTRE LAS ENTIDADES QUE CONFORMAN EL SISTEMA NACIONAL DE REGISTROS PÚBLICOS Página 6 de 18 CAPÍTULO I GENERALES "}
{"input_text": "La resolución 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO1. Objeto.- Establecer el procedimiento de entrega directa y excepcional de datos e información que por supuestos técnicos debidamente justificadas observarán las instituciones públicas o privadas cuando intercambien datos o información. "}
{"input_text": "La resolución 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO2. Ámbito de aplicación.- La presente resolución será de obligatorio cumplimiento y aplicación para las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos y que requieren de manera excepcional el intercambio directo de datos e información. "}
{"input_text": "La resolución 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO3. Glosario de términos.- Para efectos de aplicación de la presente norma los términos señalados a continuación tendrán los siguientes significados: ACID: Es el conjunto de propiedades que garantizan que las transacciones de una base de datos se procesan de manera fiable sus siglas respondan a los conceptos de atomicidad consistencia aislamiento y durabilidad. Alta frecuencia de actualización: Es el proceso de actualización que realizan las entidades fuentes al generar recopilar o respaldar y poner en disponibilidad los datos para el respectivo consumo; y está determinada por la capacidad máxima de transaccionalidad que el bus de datos de la DINARP puede soportar. Analítica de datos: Es el proceso de descubrir interpretar y transmitir patrones importantes presentes en grandes volúmenes de datos. Provenientes de una entidad fuente para la generación de manera sencilla que nos permita ver estadísticas y datos importantes así como para establecer tendencias y tomar decisiones más informadas que ayuden a las instituciones o empresas a mejorar las ventas reducir los costos Base(s) de dato(s): Conjunto estructurado de datos cualquiera que fuera la forma modalidad de creación almacenamiento organización tipo de soporte tratamiento procesamiento localización o acceso centralizado descentralizado o repartido de forma funcional o geográfica. Campo(s) de dato(s): Categoría o nomenclatura de la unidad que recopila datos o información sea esta de carácter accesible o confidencial que forma parte de un conjunto de datos o base de datos proveídos por las fuentes de información que integran el Sistema Nacional de Registros Públicos. Catálogo de campos de datos: Listado de campos de datos o información constante en bases de datos declarados como Registros Públicos de las entidades que forman parte del Sistema Nacional de Registros Públicos. Página 7 de 18 Cifrado de datos: El cifrado de datos como método para transformarlos y mantenerlos en secreto se deberá implementar únicamente para el intercambio de información a través de entregas directas y excepcionales de naturaleza de enlaces punto a punto protocolos SFTP el uso de dispositivos externos o extraíbles entre otros similares. Datos: Características variables atributos descripciones o representaciones simbólicas cuantitativas o cualitativas. Dato personal: Dato que identifica o hace identificable a una persona natural directa o indirectamente. Eficiencia tecnológica demostrable: Se refiere a las tecnologías que usan emisor y receptor superiores a las tecnologías con las que cuenta la Dirección Nacional de Registros Públicos para el intercambio de datos. Encargado del tratamiento de datos personales: Persona natural o jurídica pública o privada autoridad pública u otro organismo que solo o conjuntamente con otros trate datos personales a nombre y por cuenta de un responsable de tratamiento de datos personales. Entregas directas: Las entregas directas de datos e información obedecen a circunstancias excepcionales de orden técnico que dificultan el consumo de información a través de la plataforma de interoperabilidad de la Dirección Nacional de Registros Públicos. Se considera como tipos de entregas directas entre otras: los enlaces que permiten las conexiones punto a punto las vistas de bases de datos protocolos SFTP informática en la nube sitios que contienen reportes o acceso a réplica de bases de datos y servidores de frontera que almacenan bases de datos que permite la entrega o consumo de información y datos. ESB: “Bus de servicios empresariales” es un modelo arquitectónico de software mediante el cual un componente realiza integraciones entre aplicaciones. Fuentes de información: Son todas las entidades que provean acceso a vistas materializadas y/o servicios web a bases de datos que forman parte y se encuentran integradas al catálogo de interoperabilidad como Registros Públicos que en la actualidad o en el futuro formen parte del Sistema Nacional de Registros Públicos. Fuse ESB: Plataforma de integración de código abierto distribuida que proporciona una metodología infraestructura y herramientas estandarizadas para integrar servicios microservicios y componentes de aplicación. Página 8 de 18 Grandes volúmenes de datos: Determinado por la capacidad máxima del número de transacciones soportadas dentro de infraestructura del bus de datos de interoperabilidad. la Información: Conjunto de datos. Institución consumidora: Son las instituciones que acceden a los datos e información mediante mecanismos tecnológicos de consumo controlado y auditado. Legitimación de acceso: Constituye la justificación jurídica que evidencia el cumplimiento de las condiciones para que el tratamiento de datos personales sea lícito. Método de consumo: Mecanismos tecnológicos que se utilizan para el intercambio de información entre entidades. Obsolescencia de recursos tecnológicos: Caída en desuso de algunos productos motivada por la falta de funcionalidad en comparación con las nuevas tecnologías incluidas en el mercado. Punto a punto: Entrega y consumo directo de datos e información entre dos instituciones. Responsables del tratamiento de datos personales: Persona natural o jurídica pública o privada autoridad pública u otro organismo que solo o conjuntamente con otros decide sobre la finalidad y el tratamiento de datos personales. REST: La transferencia de Estado Representacional (Representational State Transfer) o REST es un estilo de arquitectura de software para sistemas hipermedia distribuidos como World Wide Web. SFTP (Secure File Transfer Protocol-Protocolo Seguro de Transferencia de Archivos): Es un mecanismo tecnológico que emplea un protocolo de trasferencia de archivos mediante el uso de credenciales de accesos como usuario y contraseña usando una encriptación generada por algoritmos para mover la información de forma segura a su servidor manteniendo los archivos ilegibles durante el proceso además la autenticación evita el acceso no autorizado a los archivos durante la operación. SOAP: Originalmente las siglas de Simple Object Access Protocol es un protocolo estándar que define cómo dos objetos en diferentes procesos pueden comunicarse por medio de intercambio de datos XML. "}
{"input_text": "La resolución 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO4. Temporalidad de la autorización.- La entrega directa de datos e información por supuestos de excepcionalidad se realizará por el plazo máximo de un (1) año el cual Página 9 de 18 estará condicionado a la mejora de los canales u otros componentes tecnológicos por parte del ente registral y la Dirección Nacional de Registros Públicos. La Dirección Nacional de Registros Públicos autorizará y fijará el tiempo de acuerdo a los resultados constantes en el análisis técnico y tecnológico. La autorización de consumo directo podrá ser renovada por una sola vez por igual tiempo cuando la entidad consumidora previa justificación técnica y tecnológica demuestre avances y mejoras ejecutadas en todos los procedimientos para interconectarse a través del Sistema Nacional de Registros Públicos; y cuando no sea posible o requiera de mayor tiempo para el desarrollo de los componentes tecnológicos hasta su culminación. Las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos que soliciten la entrega directa de datos e información por cualquiera de los supuestos de excepcionalidad señalados en la presente resolución deberán demostrar de manera indubitada la imposibilidad de acceder al Sistema Nacional de Registros Públicos a través del procedimiento general para “Acceso a los Datos o Información que Integra el Sistema Nacional de Registros Públicos” para lo cual deberán contar con el informe de la Coordinación de Infraestructura y Seguridad de la Información el que deberá establecer los criterios técnicos y tecnológicos que lo imposibilitan. "}
{"input_text": "La resolución 5 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO5. Responsabilidad.- Las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones fuente responderán por la veracidad autenticidad custodia y debida conservación de los registros. La responsabilidad sobre la veracidad y autenticidad de la información proporcionada por los administrados en la gestión de trámites administrativos es de su exclusiva responsabilidad. Es obligación del responsable o encargado del tratamiento de datos implementar en el ámbito de sus competencias todas las medidas tecnológicas organizacionales y jurídicas para la protección de las bases de datos que custodian acatando las disposiciones de la Ley Orgánica de Protección de Datos Personales el Esquema Gubernamental de Seguridad de la Información de ser el caso estándares internacionales ISO 27000 ISO 29000 o cualquier otra medida en aplicación al principio de responsabilidad proactiva. Artículo 6. De la obligación de incorporación.- Los consumos autorizados y regulados de acuerdo a la presente resolución conllevan la obligatoriedad a la entidad fuente de cumplir el procedimiento de incorporación de los datos o información en el Sistema Nacional de Registros Públicos para que todas las bases de datos interoperen entre sí. Página 10 de 18 "}
{"input_text": "La resolución 6 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO7. De la finalidad del uso del dato.- Las finalidades de uso del tratamiento del dato deberán ser determinadas explícitas y legítimas en consecuencia no podrán tratarse los datos con fines distintos para los cuales fueron recopilados. "}
{"input_text": "La resolución 7 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO8. De la evaluación del impacto.- El responsable del tratamiento de datos realizará la valoración referente al impacto que involucra un tratamiento relevante de datos personales para gestionar los posibles riesgos a los derechos y libertades de su titular; y de manera obligatoria en los casos determinados en la Ley Orgánica de Protección de Datos Personales así como en aquellos datos en los que la Autoridad de Protección de Datos Personales lo requiera. "}
{"input_text": "La resolución 8 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO9. Protocolos de intercambio directo de datos.- La entidad fuente y la entidad consumidora deberán cumplir de forma concurrente con los siguientes protocolos: a) Seguridad de la información.- Las instituciones de la Administración Pública Central justificarán la implementación o actualización del Esquema Gubernamental de Seguridad de la Información (EGSI). En la solicitud se adjuntará la declaración y documentación de respaldo de la implementación de las medidas de seguridad tecnológicas a adoptarse y la documentación de respaldo así como para mitigar los riesgos identificados o aquellos que podrían afectar los activos de datos e información en los ámbitos técnico y organizacional durante el procedimiento de intercambio y tratamiento de datos. Las demás entidades públicas y privadas obligatoriamente tendrán que generar o contar con políticas de seguridad de la información institucional mantener evidenciables de la trazabilidad de la información que se consume y la suscripción de acuerdos de confidencialidad. b) Protección de datos personales.- La entidad consumidora tendrá implementadas todas las medidas técnicas y organizativas que establece la Ley Orgánica de Protección de Datos Personales su Reglamento de aplicación y demás normativa que para el efecto emita la Autoridad de Protección de Datos Personales. En la solicitud se detallará y describirá: las finalidades del tratamiento de datos la legitimación de acceso el tiempo que requiere el acceso y el tiempo de conservación de los datos los efectos funcionales y jurídicos del tratamiento de la información y las medidas de seguridad de datos personales implementadas en la institución de conformidad con la Ley Orgánica de Protección de Datos Personales y las que establezca por resolución la Dirección Nacional de Registros Públicos. La política de protección de datos personales que se relacione con el tratamiento estará a disposición de forma accesible y permanente para que el titular del dato lo conozca. Los responsables y encargados del tratamiento de datos personales deberán implementar todos los mecanismos de protección que permitan evidenciar el cumplimiento de los Página 11 de 18 principios derechos y obligaciones que contempla la Ley Orgánica de Protección de Datos Personales así como acogerse a estándares de mejores prácticas esquemas de autorregulación códigos de certificación sellos de certificación y cualquier otro mecanismo que sea necesario para los fines del tratamiento de datos personales la naturaleza de los datos a tratar y la mitigación de cualquier riesgo. c) Seguridad informática.- En cuanto al alcance y definición de la misma se deberá cumplir con los preceptos tecnológicos que garanticen la disponibilidad confidencialidad e integridad de la información digital. Además aparejar una carta compromiso respecto al cumplimiento de las medidas de seguridad tecnológica a adoptarse conforme al o los mecanismos que se empleará para el intercambio de datos e información considerando los siguientes aspectos: 1. Aseguramiento del canal de trasmisión mediante el empleo de redes privadas virtuales o en su efecto hacer uso del enlace de datos de la red nacional gubernamental; 2. Autenticación mediante el empleo de usuarios y contraseñas para acceder a la información; 3. Compresión de datos como método para transformarlos y reducir su tamaño; 4. Cifrado de datos como método para transformarlos y mantenerlos en secreto; y; 5. Anonimización. La verificación y cumplimiento de los protocolos estará a cargo de la Dirección de Seguridad Informática o quién haga sus veces. La verificación y cumplimiento de los protocolos constantes en el literal a) y c) estarán a cargo de la Coordinación de Infraestructura y Seguridad Informática a través de la Dirección de Seguridad Informática o quién haga sus veces. La Dirección de Protección de la Información en los controles verificará el cumplimiento de lo dispuesto en el literal b). "}
{"input_text": "La resolución 9 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO10. Análisis de riesgo y evaluación de impacto.- Los responsables y encargados del tratamiento de datos personales de la entidad fuente y entidad consumidora analizarán y evaluarán el riesgo y evaluación de impacto cuando se trate de datos personales y describirán las medidas herramientas mecanismos y configuraciones técnicos tecnológicos y jurídicos que se deberán implementar a lo largo del ciclo de vida de los datos. Para la elaboración del informe de riesgo y evaluación de impacto se estará a lo prescrito en la Ley Orgánica de Protección de Datos Personales su Reglamento de aplicación y demás normativa que para el efecto: emita la Autoridad de Protección de Datos Personales y la Dirección Nacional de Registros Públicos. CAPÍTULO II DE LAS ENTREGAS DIRECTAS POR EXCEPCIÓN Página 12 de 18 "}
{"input_text": "La resolución 10 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO11. Supuestos de excepción.- Se podrá autorizar entrega directa siempre que concurran dos o más de los siguientes supuestos: 1. Alta frecuencia de actualización; 2. Eficiencia tecnológica demostrable; 3. Analítica de datos como finalidad o generación de información estadística; 4. Obsolescencia de recursos tecnológicos demostrada en las entidades fuente consumidora o de la Dirección Nacional de Registros Públicos; y 5. En caso de presentarse una declaratoria de estado excepción decretado por el Presidente o Presidenta de la República las instituciones señaladas en dicho documento podrán presentar la necesidad de acreditar otro supuesto de excepcionalidad; sin embargo se concederá la entrega directa únicamente por el tiempo que dure la declaratoria de estado de excepción. la solicitud sin CAPÍTULO III PROCEDIMIENTO PARA ENTREGAS DIRECTAS "}
{"input_text": "La resolución 11 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO12. Solicitud de consumo.- La máxima autoridad de la entidad consumidora o su delegado por encontrarse inmerso en alguno de los supuestos de excepción previstos en el artículo 11 de la presente resolución solicitará a la máxima autoridad de la Dirección Nacional de Registros Públicos que le confiera la autorización para realizar el consumo directo de datos e información para lo cual acompañará y justificará lo siguiente: 1. Identificación de la entidad fuente; 2. La finalidad del tratamiento del dato; 3. Datos a los que desea acceder con la descripción y la categoría del dato; 4. Legitimación de acceso que contiene la motivación jurídica para el tratamiento de datos; conforme lo previsto en la Ley Orgánica de Protección de Datos Personales; 5. Justificación técnica y tecnológica que dificulte consumir datos a través de la plataforma de interoperabilidad de la Dirección Nacional de Registros Públicos; 6. Informe de cumplimiento de los protocolos de seguridad acorde a la presente resolución; 7. Temporalidad solicitada; 8. Tiempo de conservación de los datos y mecanismo para destrucción anonimización etc; 9. Estructura de la base de consulta; 10. Acta de trabajo entre entidad consumidora y entidad fuente para determinar los supuestos de excepcionalidad que justifican la entrega directa la que contendrá los acuerdos para llevar a cabo el consumo de información así como el tiempo acordado el cual no podrá superar el plazo de un año; y Página 13 de 18 11. El acuerdo de uso y confidencialidad por parte de aquellos servidores públicos involucrados en la entrega y tratamiento de información. "}
{"input_text": "La resolución 12 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO13. Calificación de la solicitud.- La Coordinación de Gestión Registro y Seguimiento dentro del término de tres (3) días verificará el cumplimiento de los requisitos establecidos en los artículos 11 y 12 de la presente resolución. En caso de verificarse el incumplimiento de alguno de los requisitos la Coordinación de Gestión Registro y Seguimiento notificará a la entidad consumidora las razones por las cuales no se admite a trámite y concederá el término de cinco (5) días para que lo complete aclare o adjunte la información requerida de no hacerlo o persistir la inexactitud en el cumplimiento de lo solicitado se considerará como no presentada se ordenará el archivo de la solicitud y la devolución de los documentos adjuntos a ella sin necesidad de dejar copias. De permanecer la necesidad de acceder a los datos e información a través de la modalidad de entrega directa por la persistencia de los supuestos de excepción la entidad solicitante podrá presentar nuevamente la solicitud conforme a los requisitos señalados en el artículo 12 de la presente resolución. Admitida la solicitud por la Coordinación de Gestión Registro y Seguimiento remitirá el trámite inicialmente a la Coordinación de Infraestructura y Seguridad Informática para que emita el informe correspondiente con su pronunciamiento favorable se enviará el trámite a la Coordinación de Normativa y Protección de la Información para que elabore su informe. Las mentadas unidades administrativas de acuerdo a sus atribuciones y competencias dentro de los términos que establece la presente resolución analizarán evaluarán y verificarán el cumplimiento técnico tecnológico seguridades y viabilidad jurídica respectivamente. Informes que serán vinculantes en la aprobación o en el rechazo de la solicitud de autorización de entrega directa de datos e información. "}
{"input_text": "La resolución 13 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO14. Informe tecnológico.- La Coordinación de Infraestructura y Seguridad Informática dentro del término de cuatro (4) días analizará verificará y contrastará lo siguiente: 1. Que las razones expuestas en la especificación técnica y tecnológica estén acordes a los supuestos de excepcionalidad; 2. El cumplimiento de los protocolos de seguridad; 3. La frecuencia de actualización; 4. El tiempo solicitado; 5. Tiempo de conservación; 6. Método de consumo; y 7. Que el análisis de riesgo y evaluación de impacto cumplan con las especificaciones técnicas. Página 14 de 18 "}
{"input_text": "La resolución 14 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO15. Informe de Protección de la información.- La Coordinación de Normativa y Protección de la Información a través de la Dirección de Protección de la Información en un término no mayor a cuatro (4) días revisará analizará e informará que los datos e información solicitada a través de la modalidad de entrega directa y excepcional es procedente de acuerdo a lo dispuesto por la Ley Orgánica de Protección de Datos Personales y normas conexas. "}
{"input_text": "La resolución 15 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO16. Gestión de objeto de la solicitud.- La Coordinación de Gestión Registro y Seguimiento acogerá las conclusiones y recomendaciones de las unidades administrativas a quiénes solicitó su pronunciamiento; y en el término máximo de tres (3) días elaborará el informe final en el que además recomendará el tiempo que se podrá autorizar al solicitante respecto de la entrega directa de datos e información entre la entidad consumidora y entidad fuente. Éste informe será puesto en conocimiento de la máxima autoridad de la Dirección Nacional de Registros Públicos para su aprobación y suscripción y su posterior notificación a la entidad solicitante. La máxima autoridad de la Dirección Nacional de Registros Públicos resolverá y autorizará a la entidad fuente y entidad consumidora iniciar el intercambio de información de forma directa una vez que se haya verificado el cumplimiento de los supuestos de excepcionalidad aspectos la información acorde a lo estipulado en la presente resolución y normativa conexa. técnicos seguridades protección de "}
{"input_text": "La resolución 16 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO17. Renovación de la autorización.- La entidad pública o privada que cuente con una autorización de entrega directa y excepcional de datos o información podrá solicitar la renovación de la autorización por una sola vez para lo cual deberá presentar una solicitud que deberá contener el avance por etapas en los procedimientos tecnológicos a incorporarse para interoperar de acuerdo con los plazos fijados y las variables o condiciones propias para cada institución. "}
{"input_text": "La resolución 17 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "ARTICULO18. Control.- La Dirección de Control y Evaluación en articulación con el equipo de trabajo señalado en las resoluciones que emite la Dirección Nacional de Registros Públicos efectuarán el control auditoría y vigilancia del cumplimiento de la presente resolución. El intercambio de información a través de la modalidad de entrega directa por excepción estará sujeta a los procesos de control por parte de la Dirección Nacional de Registros Públicos quién verificará las condiciones el tiempo autorizado y el cumplimiento de lo establecido en la presente resolución. En los controles además verificará el cumplimiento de los lineamientos para el tratamiento y protección de datos personales que establece la Ley Orgánica de Protección de Datos Personales y normativa conexa. Sí el informe de control determina alguno de los siguientes hallazgos: mal uso del dato la falta de protección a los datos incumplimiento de alguna de las disposiciones de la Página 15 de 18 presente resolución desaparezcan los supuestos de excepcionalidad que motivaron la autorización o no se evidenciaren los avances o mejoras técnicas o tecnológicas en el tiempo concedido en la autorización será causal suficiente para ordenar motivadamente la suspensión de la autorización de entrega directa de datos. Será responsabilidad de la entidad consumidora la afectación en la prestación de los servicios públicos que son de su competencia. La Dirección Nacional de Registros Públicos notificará de la suspensión de entrega directa a la entidad que provee la información quién tendrá la obligación de suspender desde la fecha de recepción de la notificación caso contrario serán responsables y se sujetarán a las sanciones previstas en la ley así como serán solidariamente responsables en el tratamiento y protección de datos. DISPOSICIONES GENERALES PRIMERA.- Disponer a la Coordinación de Infraestructura y Seguridad Informática Coordinación de Gestión Registro y Seguimiento; y Coordinación de Normativa y Protección de la Información la ejecución y cumplimiento de la presente resolución. SEGUNDA. - La presente resolución no es aplicable para transferencias internacionales de datos personales. TERCERA.- El análisis del riesgo y la evaluación de impacto estará sujeto a los lineamientos y parámetros que para el efecto emita la Autoridad de Protección de Datos Personales una vez que dicho organismo entre en funcionamiento sin embargo hasta su posesión se ejecutarán considerando las definiciones establecidas en las normas ISO 27000 y 29000; así como las estipuladas en el EGSI y demás normas que establezca la Dirección Nacional de Registros Públicos. CUARTA.- Disponer a la Dirección de Comunicación Social la difusión publicación de la presente Resolución en la página web institucional y notificación a la Dirección de Asesoría Jurídica para el registro correspondiente. QUINTA.- La institución consumidora tiene la obligación de suscribir el acuerdo de uso y confidencialidad por parte de aquellas personas que estarán involucradas en el acceso al tratamiento de datos e información."}
{"input_text": "La disposición 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 0- En el plazo máximo de seis (6) meses contados desde la entrada en vigencia de esta resolución la Coordinación de Gestión Registro y Seguimiento; y la Dirección de Protección de la Información realizarán el control y evaluación a las entidades consumidoras de datos de forma directa por excepción autorizadas con anterioridad a la Página 16 de 18 vigencia de la presente resolución; y emitirán un informe respecto de los hallazgos encontrados así como las recomendaciones que serán puestas en conocimiento de la máxima autoridad. Para el efecto en el término máximo de treinta (30) días contados desde la suscripción de la presente resolución deberá presentar un cronograma a la máxima autoridad para su aprobación. "}
{"input_text": "La disposición 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 1- En el término de quince (15) días contados desde la entrada en vigencia de esta resolución la Dirección de Planificación elaborará el procedimiento y su flujo respectivo acorde a las actividades descritas en la presente resolución para la autorización de entrega directa de datos e información por excepción. "}
{"input_text": "La disposición 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 2- En el término de tres (3) días contados desde la entrada en vigencia de esta resolución la Coordinación de Gestión Registro y Seguimiento elaborará un formato único de autorización de entrega directa de datos o información. Una vez culminado el término la Dirección de Comunicación lo incorporará en el apartado que contiene la página web institucional para libre acceso de los usuarios. DISPOSICIÓN DEROGATORIA Ú"}
{"input_text": "La disposición 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 3- Deróguese la Resolución Nro. 006-NG-DINARDAP-2019 de 28 de octubre de 2019 contentiva de la Norma que Regula el Consumo Masivo y Entregas Directas Excepcionales de Datos e Información de las Entidades que Conforman el "}
{"input_text": "La disposición 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 4 La presente resolución entrará en vigencia a partir de la fecha de su suscripción sin perjuicio de su publicación en el Registro Oficial. Dado en la ciudad de Quito a los 12 días del mes de mayo de 2023. Abg. Daniel Augusto Arboleda Villacreses DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Página 17 de 18 Aprobado: Revisado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Ab. Sofía Vázquez Izurieta / Directora de Normativa Elaborado: Ab. / Jean Jairo Cifuentes / Analista Página 18 de 18"}
{"input_text": "La consideración 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; "}
{"input_text": "La consideración 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el numeral 11 del artículo 66 de la Constitución de la República del Ecuador establece: “(…) En ningún caso se podrá exigir o utilizar sin autorización del titular o de sus legítimos representantes la información personal o de terceros sobre sus creencias religiosas filiación o pensamiento político; ni sobre datos referentes a su salud vida sexual salvo por necesidades de atención médica.”; el numeral 19 del artículo 66 de la Constitución de la República del Ecuador manifiesta: “El derecho a la protección de datos de carácter personal que incluye el acceso y la decisión sobre información y datos de este carácter así como su correspondiente protección. La recolección archivo procesamiento distribución o difusión de estos datos o información requerirán la autorización el titular o el mandato de la ley.”; el artículo 226 de la Constitución de la República del Ecuador prescribe: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; el artículo 227 de la Constitución de la República del Ecuador prescribe: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.”; "}
{"input_text": "La consideración 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el numeral 2 del artículo 21 de la Ley para la Optimización y Eficiencia de Trámites Administrativos señala “Sin perjuicio de lo establecido en la Ley del Página 1 de 16 "}
{"input_text": "La consideración 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoriamente la información que reposa en: (…) 2. El Sistema Nacional de Registro de Datos Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registro de Datos Públicos y la entidad que presida el Sistema Nacional de Registro de Datos Públicos” el artículo 1 de la Ley Orgánica De Protección de Datos Personales establece: “El objeto y finalidad de la presente ley es garantizar el ejercicio del derecho a la protección de datos personales que incluye el acceso y decisión sobre información y datos de este carácter así como su correspondiente protección. Para dicho efecto regula prevé y desarrolla principios derechos obligaciones y mecanismos de tutela; el artículo 7 de la Ley Orgánica De Protección de Datos Personales manda: “El tratamiento será legítimo y lícito si se cumple con alguna de las siguientes condiciones: 1) Por consentimiento del titular para el tratamiento de sus datos personales para una o varias finalidades especificas; 2) "}
{"input_text": "La consideración 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que sea realizado por el responsable del tratamiento en cumplimiento de una obligación legal; 3) "}
{"input_text": "La consideración 5 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que sea realizado por el responsable del tratamiento per orden judicial debiendo observarse los principios de la presente ley; 4) "}
{"input_text": "La consideración 6 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el tratamiento de datos personales se sustente en el cumplimiento de una misión realizada en interés público o en el ejercicio de poderes públicos conferidos al responsable derivados de una competencia atribuida por una norma con rango de ley sujeto al cumplimiento de los estándares internacionales de derechos humanos aplicables a la materia al cumplimiento de los principios de esta ley y a los criterios de legalidad proporcionalidad y necesidad; 5) Para la ejecución de medidas precontractuales a petición del titular o para el cumplimiento de obligaciones contractuales perseguidas por el responsable del tratamiento de datos personales encargado del tratamiento de datos personales o por un tercero legalmente habilitado; 6) Para proteger intereses vitales del interesado o de otra persona natural como su vida salud o integridad; 7) Para tratamiento de datos personales que consten en bases de datos de acceso público; u 8) Para satisfacer un interés legítimo del responsable de tratamiento o de tercero siempre que no prevalezca el interés o derechos fundamentales de los titulares al amparo de lo dispuesto en esta norma.”; "}
{"input_text": "La consideración 7 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 11 de la Ley Orgánica De Protección de Datos Personales prescribe: “Los datos personales cuyo tratamiento se encuentre regulado en normativa especializada en materia de ejercicio de la libertad de expresión sectores regulados por normativa específica gestión de riesgos desastres naturales seguridad nacional y defensa del Estado; y los datos personales que deban proporcionarse a autoridades administrativas o judiciales en virtud de solicitudes y órdenes amparadas en competencias atribuidas en la normativa vigente estarán sujetos a los principios establecidos en sus propias normas y los principios Página 2 de 16 "}
{"input_text": "La consideración 8 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que establecidos en esta Ley en los casos que corresponda y sea de aplicación favorable. En todo caso deberá darse cumplimiento a los estándares internacionales en la materia de derechos humanos y a los principios de esta ley y como mínimo a los criterios de legalidad proporcionalidad y necesidad.”; el artículo 25 de la Ley Orgánica De Protección de Datos Personales prescribe: “Se considerarán categorías especiales de datos personales los siguientes: a) Datos sensibles; b) Datos de niñas niños y adolescentes: c) Datos de salud; y d) Datos de personas con discapacidad y de sus sustitutos relativos a la discapacidad.”; el artículo 26 de la Ley Orgánica De Protección de Datos Personales ordena: “Queda prohibido el tratamiento de datos personales sensibles salvo que concurra alguna de las siguientes circunstancias: a) El titular haya dado su consentimiento explícito para el tratamiento de sus datos personales especificándose claramente sus fines. b) El tratamiento es necesario para el cumplimiento de obligaciones y el ejercicio de derechos específicos del responsable del tratamiento o del titular en el ámbito del Derecho laboral y de la seguridad y protección social. c) El tratamiento es necesario para proteger intereses vitales del titular o de otra persona natural en el supuesto de que el titular no esté capacitado física o jurídicamente para dar su consentimiento. d) El tratamiento se refiere a datos personales que el titular ha hecho manifiestamente públicos. e) El tratamiento se lo realiza por orden de autoridad judicial. f) El tratamiento es necesario con fines de archivo en interés público fines de investigación científica o histórica o fines estadísticos que debe ser proporcional al objetivo perseguido respetar en lo esencial el derecho a la protección de datos y establecer medidas adecuadas y específicas para proteger los intereses y derechos fundamentales del titular. g) Cuando el tratamiento de los datos de salud se sujete a las disposiciones contenidas en la presente ley.”; el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. […]”; el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos expone: “La presente Ley rige para las instituciones del sector público y privado que actualmente o en el futuro administren bases o registros públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; el inciso primero del artículo 4 de la Ley Orgánica del Sistema Nacional de Registros Públicos dispone: “Las instituciones del sector público y privado y las personas naturales que actualmente o en el futuro administren bases o registros de datos públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. […]”; "}
{"input_text": "La consideración 9 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Son confidenciales los datos de carácter personal. El acceso a estos Página 3 de 16 datos solo será posible cuando quien los requiera se encuentre debidamente legitimado conforme a los parámetros previstos en la Ley Orgánica de Protección de Datos Personales su respectivo reglamento y demás normativa emitida por la Autoridad de Protección de Datos Personales. Al amparo de esta Ley para acceder a la información sobre el patrimonio de las personas cualquier solicitante deberá justificar y motivar su requerimiento declarar el uso que hará del mismo y consignar sus datos básicos de identidad tales como nombres y apellidos completos número del documento de identidad o ciudadanía dirección domiciliaria y los demás datos que mediante el respectivo reglamento se determinen. Un uso distinto al declarado dará lugar a la determinación de responsabilidades sin perjuicio de las acciones legales que el titular de la información pueda ejercer. La Directora o Director Nacional de Registros Públicos definirá los demás datos que integran el sistema nacional y el tipo de reserva y accesibilidad.”; el artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: “1. Presidir el Sistema Nacional de Registros Públicos cumpliendo y haciendo cumplir sus finalidades y objetivos; 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; [...] 5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca. […] 14. Controlar y supervisar que las entidades pertenecientes al Sistema Nacional de Registros Públicos incorporen mecanismos de protección de datos personales así como dar cumplimiento a las disposiciones establecidas en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa que la Autoridad de Protección de Datos Personales dicte para el efecto. […]”; "}
{"input_text": "La consideración 10 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 2 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos respecto al Sistema Nacional de Registros Públicos indica: \"Está conformado por las instituciones públicas y privadas determinadas en la Ley Orgánica del Sistema Nacional de Registros Públicos y las que en el futuro determine mediante resolución el Director Nacional de Registros Públicos en ejercicio de sus competencias\"; "}
{"input_text": "La consideración 11 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “El Director Nacional de Registros Públicos previa resolución motivada podrá disponer que se incorporen al Sistema aquellos registros públicos no previstos expresamente en la Ley. La resolución de incorporación podrá expedirse una vez que se verifique lo siguiente: 1. "}
{"input_text": "La consideración 12 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que se trate de base de datos que contengan un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y 2. "}
{"input_text": "La consideración 13 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía. En su resolución el Director indicará si los datos que constan en los registros que se incorporan al Página 4 de 16 Sistema son accesibles o confidenciales y les dará la protección que corresponda según dicha clasificación. Este estatus podrá ser modificado previa resolución motivada en cualquier tiempo de acuerdo a las circunstancias del momento pero siempre dentro del marco jurídico vigente”; "}
{"input_text": "La consideración 14 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 9 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos en cuanto a la Regulación y Control establece: \"Sin perjuicio de las competencias que ejercen los entes de control definidos en la Constitución de la República la Dirección Nacional de Registros de Públicos es el órgano de regulación control auditoría y vigilancia de todos los integrantes del Sistema Nacional de Registros Públicos en torno a la interoperabilidad de datos. La regulación control auditoría y vigilancia comprenden todas las acciones necesarias para garantizar la disponibilidad del servicio. Las decisiones administrativas internas de cada ente registral corresponden exclusivamente a sus autoridades pero la Dirección Nacional de Registros Públicos arbitrará las medidas que sean del caso cuando perjudiquen la disponibilidad de los servicios\"; "}
{"input_text": "La consideración 15 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 10 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos ordena: “Son funciones del Director Nacional de Registros Públicos a más de las señaladas en la Ley y este Reglamento las siguientes: […] 4. Emitir las resoluciones técnicas operativas y administrativas necesarias para el adecuado funcionamiento del Sistema; […] 8. Ordenar la publicación de la lista de registros públicos de datos para conocimiento de los usuarios; […]”; "}
{"input_text": "La consideración 16 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 13 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos prevé: \"De la seguridad de la información. - La Dirección Nacional de Registros Públicos de conformidad con la ley expedirá las normas técnicas que contengan los estándares mecanismos y herramientas para precautelar la seguridad custodia y conservación de la información accesible y confidencial. La integridad y protección de los registros de datos públicos es responsabilidad de las instituciones del sector público y privado a través de sus representantes legales y las personas naturales que directamente los administren\"; "}
{"input_text": "La consideración 17 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 26 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos estipula: “Toda base informática de datos debe constar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impida la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; "}
{"input_text": "La consideración 18 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 1 del Decreto Ejecutivo No. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 con el cual se decretó la Implementación del Gobierno Electrónico en la Función Ejecutiva expresa: “La implementación del gobierno electrónico en la Función Ejecutiva consiste en el uso de las tecnologías de la información y comunicación por parte de las entidades para transformar las relaciones con los ciudadanos entre entidades de gobierno y empresas privadas a fin de mejorar la calidad de los servicios Página 5 de 16 gubernamentales a los ciudadanos promover la interacción con las empresas privadas fortalecer la participación ciudadana a través del acceso a la información y servicios gubernamentales eficientes y eficaces y coadyuvar con la transparencia participación y colaboración ciudadana.”; "}
{"input_text": "La consideración 19 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que el artículo 4 del Decreto Ejecutivo No. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 señala: “Obligaciones de las entidades de la Función Ejecutiva.- A las instituciones de la Función Ejecutiva dentro del ámbito de este Decreto Ejecutivo les corresponderá: a. Colaborar en la generación de los instrumentos que sean necesarios para la aplicación de presente Decreto así como para su cabal cumplimiento; y b. Utilizar los medios electrónicos que determine el Ministerio de Telecomunicaciones y de la Sociedad de la Información para la aplicación efectiva de las políticas de gobierno electrónico en la gestión pública.”; "}
{"input_text": "La consideración 20 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que mediante Resolución No. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que regula la clasificación de los datos que integren el Sistema Nacional de Registros Públicos”.; "}
{"input_text": "La consideración 21 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que a través de Resolución No. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la norma que “Establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registro de Datos Públicos”. incluir requisitos "}
{"input_text": "La consideración 22 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que mediante Memorando No. DINARP-CNPI-2023-0031-M de 24 de marzo de 2023 se ha solicitado que en el ámbito de sus competencias emitan informes considerando: 1) Justificación técnica y operativa de viabilidad respecto de la necesidad de la reforma de las mentadas resoluciones conforme las reuniones mantenidas y los comentarios que se incluyen en el documento adjunto. 2) lineamientos definiciones Análisis y determinación de términos etc. 3) La actualización de un procedimiento adecuado a las fases establecidas en el proyecto de resolución acompañarlo con su respectivo flujo esto se deberá realizar en colaboración con el área de Planificación en coordinación con la Dirección de Gestión y Registro y Coordinación de Infraestructura y Seguridad Informática y Dirección de Protección de la Información para adecuar los tiempos de respuesta y las actividades entregables de cada área; 4) Definir el objetivo justificación alcance contenido y glosario de términos. 5) Se adjunta un proyecto de reforma el cual se solicita trabajar en control de cambios a fin de conocer sus comentarios y sugerencias con respecto al contenido de los textos. 6) Revisar en los comentarios que anteceden en el documento de proyecto a fin de que las áreas puedan retroalimentar de acuerdo a sus atribuciones y competencias. "}
{"input_text": "La consideración 23 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que a través de Memorando No. DINARP-CISI-2023-0079-M de 22 de mayo de 2023 la Coordinación de Infraestructura y Seguridad Informática remite informe de viabilidad técnica y operativa para proyecto de reforma de Resolución Nro. 035-ng-dinardap-2016 y Nro. 039-ng-dinardap-2016 en el cual concluye “(…)Se revisaron los Anexos 1 2 y 3 adjuntos a la resolución Nro. 039-NG-Página 6 de 16 "}
{"input_text": "La consideración 24 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que DINARDAP-2016 y se determina que el Anexo 1 no requiere cambio alguno desde el ámbito tecnológico; el Anexo 2 no es de competencia de esta Coordinación y el Anexo 3 debe ser actualizado acorde al nuevo flujo de responsables y actividades a realizar dentro del procedimiento”. a través de Memorando No. DINARP-DPI-2023-0112-M de 31 de mayo de 2023 la Dirección de Protección de la Información remite informe para reforma y/o derogatoria de normativa relacionada a la protección de la información en el cual concluye “La Dirección Nacional de Registros Públicos de conformidad con lo establecido en los numerales 1 2 4 y 14 del artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos es competente para emitir mediante resolución la normativa que regule la clasificación de los datos de los registros públicos que integran el Sistema Nacional de Registros Públicos esto en concordancia con lo que establece el artículo de la norma ibidem respecto a la accesibilidad y confidencialidad que a su vez deben contemplar los parámetros que se encuentran previstos en la Ley Orgánica de Protección de Datos Personales y en atención también al tipo de reserva que establezca la normativa especializada para ciertas bases de datos. \\uf0b7 Lo descrito por la Resolución 035-NG-DINARDAP-2016 vigente establece una clasificación de los datos que requieren ser ajustados a los parámetros establecidos en la reforma del artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos y las disposiciones de la Ley Orgánica de Protección de Datos Personales. \\uf0b7 La Resolución 035-NG-DINARDAP-2016 no contempla a las categorías especiales de datos personales por lo que la misma debe ajustarse a los parámetros establecidos por la LOPDP para su tratamiento. \\uf0b7 La Resolución 039-NG-DINARDAP-2016 la cual en su artículo 7 contempla un procedimiento para integrar la información previo la elaboración de un informe de clasificación por parte de esta Dirección debería ser unificada con la Resolución 035- NG-DINARDAP-2016 por cuanto las mismas no son diferentes sino complementa. \\uf0b7 Es necesario considerar que la norma de clasificación no restringe el acceso a los datos categorizados como confidenciales a las entidades consumidoras sino que tiene como finalidad regular las condiciones y circunstancias de legitimación que se debe cumplir para tratar los datos personales que integran el SINARP lo cual debería constar en la norma integral que considere los dos procesos y cuyo proyecto fue puesto en conocimiento de esta Dirección.” "}
{"input_text": "La consideración 25 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que por medio de Memorando No. DINARP-CGRS-2023-0259-M de 31 de mayo de 2023 la Coordinación de Gestión Registro y Seguimiento remite informe funcional donde concluye y recomienda “De la revisión de la norma vigente se verifica la necesidad de establecer un procedimiento ordenado claro y con definiciones precisas de actividades y tiempos de ejecución. \\uf0b7 Se recomienda revisar los capítulos y numeración de artículos conforme al orden lógico establecido. \\uf0b7 Con el antecedente de que existe un informe emitido por la Coordinación de Infraestructura y Seguridad Informática mediante el cual se indica que por motivos de seguridad no se recomienda la publicación del catálogo Página 7 de 16 en página web se recomienda se realice su publicación en el portal que establezca la DINARP”. "}
{"input_text": "La consideración 26 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "Que con Acuerdo Ministerial No. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 Ab. Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información Subrogante resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional a partir del 7 de abril de 2023 quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable(…)”. En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación."}
{"input_text": "La resolución 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULOESTABLECER EL PROCEDIMIENTO DE INCORPORACIÓN DE FUENTES Y ENTES REGISTRALES Y LA CLASIFICACIÓN DE DATOS QUE CONFORMAN EL SISTEMA NACIONAL DE REGISTROS PÚBLICOS CAPÍTULO I NORMAS RECTORAS "}
{"input_text": "La resolución 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO1.- Objeto.- Establecer el procedimiento de incorporación de fuentes e instituciones públicas o privadas que actualmente o en el futuro administren registros públicos el tipo de reserva y la determinación de accesibilidad a los datos que incorporan el Sistema Nacional de Registros Públicos. "}
{"input_text": "La resolución 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO2.- Ámbito de aplicación.- La presente resolución será de obligatorio cumplimiento y aplicación para las entidades públicas o privadas que actualmente o en el futuro administren registros públicos; y las que se incorporen al Sistema Nacional de Registros Públicos. "}
{"input_text": "La resolución 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO3.- Glosario de términos.- Para efectos de aplicación de la presente norma los términos señalados a continuación tendrán las siguientes definiciones: Catálogo único. - Documento mediante el cual se detallan los campos que a la fecha integran el Sistema Nacional de Registros Públicos mismo que es administrado por la Dirección Nacional de Registros Públicos con base a la normativa legal vigente. Datos accesibles: Son los datos que no tienen el carácter de confidencial conforme al ordenamiento jurídico. Datos confidenciales: Son confidenciales los datos personales. Página 8 de 16 Ente registral.- Toda institución pública o privada a cargo de la información que forma parte del Sistema Nacional de Registro Públicos de acuerdo a lo establecido en la Ley. Fuente.- Es el conjunto ordenado de información dispuesto en una tabla o base de datos integrado al Sistema Nacional de Registros Públicos por el ente registral. Fuentes externas.- Es el conjunto de información proveniente de las instituciones que la Dirección Nacional de Registros Públicos determine que deben formar parte del Sistema Nacional de Registros Públicos. Fuentes propias.- Es el conjunto de información proveniente de los Registros: Civil de la Propiedad Mercantil Societario vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios Servicio de Rentas Internas Instituto Ecuatoriano de Seguridad Social Dirección Nacional de Migración Policía Nacional Comisión de Tránsito del Guayas Ministerio de Trabajo Municipios Función Judicial. Herramienta informática: Instrumento digital utilizado para manejar información con el uso de computadoras tales como el procesador de texto la base de datos las hojas de redes de cálculo el correo electrónico buscadores programas de diseño telecomunicaciones. la Legitimación de acceso.- Constituye cumplimiento de las condiciones para que el tratamiento de datos personales sea lícito. jurídica que evidencia el justificación Persona interesada o requirente.- Persona natural institución pública o privada que solicita la incorporación de un registro público al Sistema Nacional de Registro Público. Pre producción.- Permite la planificación análisis y definición de los aspectos clave de un proyecto tecnológico antes de su paso a producción. Es un proceso fundamental para verificar las funciones en la herramienta informática a fin de que cumpla con el propósito de concepción y minimice los riesgos y problemas durante su etapa de liberación. Producción.- Es el proceso por el cual las herramientas desarrolladas son transferidas al ambiente de producción con el propósito de ser utilizado por el usuario final. Registro público.- Información o registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones generadas del sector público o privado. SINARP: Sistema Nacional de Registros Públicos. CAPÍTULO II CLASIFICACIÓN DE LA INFORMACIÓN Página 9 de 16 "}
{"input_text": "La resolución 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO4.- Clasificación de la información.- La máxima autoridad de la Dirección Nacional de Registros Públicos definirá los datos que constan en las fuentes de los entes registrales como accesibles o confidenciales con base en el informe de clasificación que emita la Dirección de Protección de la Información su accesibilidad se determinará acorde a lo previsto en la Ley Orgánica del Sistema Nacional de Registros Públicos Ley Orgánica de Protección de Datos Personales y demás normativa relacionada. "}
{"input_text": "La resolución 5 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO5.- Accesibilidad a datos confidenciales.- Los datos de los registros públicos que integran el SINARP categorizados como confidenciales serán accesibles para las personas naturales o jurídicas de derecho público o privado previa legitimación de acceso conforme la normativa legal vigente. "}
{"input_text": "La resolución 6 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO6.- Responsabilidades.- Las instituciones del sector público o privado que actualmente o en el futuro administren registros públicos son responsables de la integridad protección y control de los registros públicos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. La responsabilidad sobre la veracidad y autenticidad de los datos registrados es exclusiva de la o el declarante cuando esta o este provee toda la información. Los entes registrales tomarán las medidas necesarias para garantizar la conservación custodia seguridad de los registros públicos su actualización rectificación o supresión. La Dirección Nacional de Registros Públicos a través de las áreas correspondientes controlará y supervisará que los entes registrales implementen mecanismos de protección de datos personales así como el cumplimiento a las disposiciones en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa conexa. "}
{"input_text": "La resolución 7 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO7.- Obligaciones.- Toda persona natural o jurídica de derecho público o privado que de cualquier forma llegaren a tratar la información proporcionada a través del Sistema Nacional de Registros Públicos contenida o resultante de los procesos derivados de su competencia o actividad quedan obligados a guardar confidencialidad o la debida reserva sobre la misma de conformidad con los principios establecidos en la Ley Orgánica del Sistema Nacional de Registros Públicos su reglamento de aplicación en la Ley Orgánica de Protección de Datos Personales y demás normativa aplicable para el efecto. CAPÍTULO III FASE DE EVALUACIÓN "}
{"input_text": "La resolución 8 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO8.- Formas de incorporación- El procedimiento de incorporación puede iniciarse de oficio o a solicitud de la persona interesada. A solicitud de la persona interesada de la forma y con los requisitos previstos en esta resolución. Página 10 de 16 De oficio a petición de la máxima autoridad de la Dirección Nacional de Registros Públicos bien por iniciativa propia o a petición razonada de otras personas naturales y/o instituciones públicas o privadas. "}
{"input_text": "La resolución 9 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO9.- Del requerimiento de incorporación.- La máxima autoridad de la Dirección Nacional de Registros Públicos a fin de verificar que se trate de una base de datos que contenga un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía solicitará la incorporación de la entidad pública o privada a la fuente externa; para el efecto solicitará que en el término de tres (3) días remita la siguiente información: 1. Formulario de incorporación 2. Correos electrónicos y números telefónicos de contactos técnicos 3. Matriz de datos 4. Diccionario de datos 5. Manual técnico 6. Batería de pruebas 7. 8. Credenciales de acceso (que deberán ser remitidas al Oficial de Seguridad de la Servicio web o base de datos (vista materializada) Información de DINARP (OSI). "}
{"input_text": "La resolución 10 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO10.- De la evaluación previa.- Recibida la documentación en el término de dos (2) días la Dirección de Gestión y Registro evaluará y verificará el cumplimiento de los requisitos establecidos en el artículo 9 de la presente resolución. En caso de incumplimiento de uno de los requisitos la Dirección de Gestión y Registro solicitará a la entidad que la complete. "}
{"input_text": "La resolución 11 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO11.- Validaciones de conectividad.- Cumplidos los requisitos la Dirección de Gestión y Registro solicitará a la Coordinación de Infraestructura y Seguridad Informática para que a través de sus Direcciones realice las validaciones de conectividad. La Dirección de Seguridad Informática conjuntamente con la institución pública o privada que administra el registro público dentro del término máximo de tres (3) días establecerá el mecanismo de conectividad o la vía de consumo de la información pudiendo ser VPN IPSec enlace de datos comunicación por la Red Nacional Gubernamental o consumo por internet. Una vez definido el mecanismo se solicitará a la Página 11 de 16 institución que en el término de dos (2) días defina el mecanismo seguro y oportuno para la entrega de las credenciales de acceso. La Dirección de Tecnología y Desarrollo en el término de tres (3) días gestionará y coordinará con la institución pública o privada que administra el registro público o su delegado la verificación del recurso de información que éste entrega a través de la vía de consumo previamente determinada para proceder a incorporarla al Sistema Nacional de Registros Públicos. En caso de no cumplir con las validaciones correspondientes la Coordinación de Infraestructura y Seguridad Informática procederá a notificar a la institución para que lo subsane. "}
{"input_text": "La resolución 12 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO12.- Del caso de negocio.- La Coordinación de Infraestructura y Seguridad Informática remitirá la validación de conectividad a la Dirección de Gestión y Registro para que en el término de tres (3) días con base en la incorporación del recurso de información actualice el inventario de campos y elabore el caso de negocio para la incorporación el cual deberá contar con firmas de responsabilidad del técnico Director de Gestión y Registro; y la Coordinación de Gestión Registro y Seguimiento. CAPÍTULO IV FASE DE INCORPORACIÓN TÉCNICA "}
{"input_text": "La resolución 13 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO13.- Inicio de la incorporación técnica. - La Dirección de Gestión y Registro remitirá el caso de negocio a la Coordinación de Infraestructura y Seguridad Informática quien deberá iniciar la incorporación técnica de la institución pública o privada que administra la base o registro público de conformidad con el caso de negocio. "}
{"input_text": "La resolución 14 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO14.- Monitoreo y Producción.- La Dirección de Tecnología y Desarrollo previo al paso de producción incorporará el mecanismo de monitoreo a la institución pública o privada que administra el registro público con base a los parámetros establecidos para este fin que es el mecanismo de monitoreo que desarrolló la Dirección de Tecnología y Desarrollo hacia la institución: servicios web y base de datos. La Dirección de Tecnología y Desarrollo solicitará a la Dirección de Gestión y Registro que previo al paso a preproducción realice incorporación correspondientes utilizando un paquete integral de consumo. En caso de que las pruebas en preproducción sean exitosas y validada la incorporación generará el “Documento de Aceptación” con el cual solicitará que la Dirección de Tecnología y Desarrollo implemente la incorporación en el paso de producción. las pruebas de En caso de que las pruebas no sean exitosas la Dirección de Gestión y Registro solicitará a la Dirección de Tecnología y Desarrollo la revisión y correctivos del caso hasta que sea viable el paso a producción. Página 12 de 16 Concluido el paso a producción la Dirección de Tecnología y Desarrollo notificará tal particular a la Dirección de Gestión y Registro. V FASE DE CLASIFICACIÓN E INCORPORACIÓN "}
{"input_text": "La resolución 15 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO15.- Clasificación de la información.- Una vez concluida la fase de incorporación técnica la Dirección de Gestión y Registro solicitará a la Dirección de Protección de la Información en el término de tres (3) días clasifique los datos o información que se incorporará al Sistema Nacional de Registros Públicos y la recomendación de protección que corresponda según dicha clasificación de conformidad con lo previsto en la normativa vigente. La Dirección de Protección de la información emitirá un informe con la clasificación de la información conforme lo establecido en la Constitución de la República del Ecuador Ley Orgánica de Protección de Datos Personales instrumentos internacionales y demás normativa que fuere aplicable mismo que deberá estar suscrito por su titular; y deberá ser remitido a la Dirección de Gestión y Registro para el trámite correspondiente. Sin embargo la clasificación de la información podrá ser modificada en cualquier momento previo informe motivado de acuerdo al ordenamiento jurídico vigente. "}
{"input_text": "La resolución 16 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO16.- Resolución de incorporación.- La Dirección de Gestión y Registro solicitará a la Dirección de Normativa que en el término de tres (3) días elabore el proyecto de resolución de incorporación de la entidad pública o privada que administra el registro público al Sistema Nacional de Registros Públicos la clasificación de la información y protección que se le otorgará de conformidad con el informe que elaboró la Dirección de Protección de la Información. El proyecto de resolución se pondrá en conocimiento de la máxima autoridad de la Dirección Nacional de Registros Públicos para su aprobación y suscripción. La Coordinación Gestión Registro y Seguimiento notificará a la institución con la resolución de incorporación como ente registral suscrita por la máxima autoridad de la Dirección Nacional de Registros Público. En caso de que se trate de la incorporación de nuevas fuentes y campos de información de instituciones públicas o privadas que forman parte del Sistema Nacional de Registro Públicos no se deberá cumplir con lo dispuesto en el presente artículo. Sin embargo la Coordinación Gestión Registro y Seguimiento notificará la incorporación de los campos o información y el informe de clasificación emitido por la Dirección de Protección de la Información. CAPÍTULO VI Página 13 de 16 DEL CATÁLOGO ÚNICO "}
{"input_text": "La resolución 17 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "ARTICULO17.- Actualización del catálogo. – La Dirección de Gestión y Registro deberá mantener actualizado el catálogo único y deberá estar publicado en los portales con lo que la Dirección Nacional de Registros Públicos cuente. DISPOSICIONES GENERALES PRIMERA.- Disponer a la Coordinación de Gestión Registro y Seguimiento Coordinación de Infraestructura y Seguridad Informática Coordinación de Normativa y Protección de la Información Dirección de Tecnología y Desarrollo Dirección de Seguridad Informática Dirección de Protección de la Información y Dirección de Normativa de la Dirección Nacional de Registros Públicos la ejecución y cumplimiento de la presente resolución. SEGUNDA.- En caso de supresión escisión o fusión el ente registral en el término de cinco (5) días informará a la Dirección Nacional de Registros Públicos qué entidad administrará sus registros públicos con la finalidad de gestionar los procedimientos para incorporar la nueva institución y mantener los datos o información en el Sistema Nacional de Registros Públicos. TERCERA.- Los responsables y encargados del tratamiento de datos personales en el marco de sus obligaciones establecidas en la Ley de la materia deberán implementar en el ámbito de sus competencias todas las medidas tecnológicas organizacionales y jurídicas para la protección de los registros públicos que custodian así como aquellas que se encuentran incorporadas al Sistema Nacional de Registros Públicos acatando las disposiciones de la Ley Orgánica de Protección de Datos Personales el Esquema Gubernamental de Seguridad de la Información de ser el caso o estándares internacionales ISO 27000 ISO 29000 o cualquier otra medida en aplicación al principio de responsabilidad proactiva. CUARTA.- Los entes registrales no podrán de forma unilateral dejar de compartir su información por el SINARP. En caso de realizarse el ente registral será responsable de todos los daños y perjuicios que provoque la suspensión. QUINTA.- Disponer a la Dirección de Comunicación Social la difusión y publicación de la presente resolución en la página web institucional. DISPOSICIONES TRANSITORIAS PRIMERA.- En el plazo de tres (3) meses contados a partir de la suscripción de la presente resolución la Dirección de Gestión y Registro revisará y actualizará el catalogo único con su descripción y el valor de respuesta de cada uno hecho lo cual remitirá el informe correspondiente a la Dirección de Protección de la Información para que en el Página 14 de 16 plazo de dos (2) meses revisen la clasificación de la información incorporada en el Sistema Nacional de Registros Públicos. De considerar pertinente la Dirección de Protección de la Información reclasificará la información de conformidad a la Constitución Ley Orgánica de Protección de Datos Ley del Sistema Nacional de Registros Públicos y su reglamento de aplicación para lo cual generará el informe con su recomendación ante la máxima autoridad de la Dirección Nacional de Registros Públicos. El catálogo único deberá ser revisado y actualizado de forma permanente de acuerdo al informe de clasificación que emita la Dirección de Protección de la Información. En caso de requerir una prórroga adicional para el cumplimiento de la presente disposición se deberá generar un informe debidamente motivado explicando las razones por las cuales se requiere una ampliación del término concedido mismo que podrá ser aprobado o rechazado por la máxima autoridad de la Dirección Nacional de Registros Públicos. SEGUNDA.- En el término de hasta tres (3) días contados a partir de la suscripción de la presente resolución la Dirección de Comunicación publicará el catalogo único en los portales con los que cuente Dirección Nacional de Registros Públicos. TERCERA.- En el plazo de tres (3) meses contados a partir de la suscripción de la presente resolución la Coordinación de Gestión Registro y Seguimiento deberá elaborar un informe respecto a las instituciones públicas y privadas que administren registros públicos que no estén incorporadas al Sistema Nacional de Registros Públicos recomendando su incorporación el cual será puesto en consideración de la máxima autoridad de la Dirección Nacional de Registros Públicos para su autorización. CUARTA: En el término de quince (15) días contados a partir de la suscripción de la presente resolución la Dirección de Planificación y a la Dirección de Gestión y Registro elaborará el instructivo y el flujo respectivo acorde a las actividades descritas en la presente resolución."}
{"input_text": "La disposición 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 0 Deróguese la Resolución No. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016. que contiene la norma que “Regula la clasificación de los datos que integran el Sistema Nacional de Registro de Datos Públicos”. "}
{"input_text": "La disposición 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 1 Deróguese la Resolución No. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 que contiene la norma que “Establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registro de Datos Públicos”. "}
{"input_text": "La disposición 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 2 Deróguese la Resolución No. 043-NG-DINARDAP-2016 de 22 de septiembre de 2016 que contiene el instructivo de “Clasificación de la Información de la Página 15 de 16 Dirección Nacional de Registro de Datos Públicos Registro de Datos Crediticios y Registros Mercantiles”. "}
{"input_text": "La disposición 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 3 Deróguese la Resolución No. 018-NG-DINARDAP-2013 de 25 de abril de 2013 que contiene la norma que: “Regula la asequibilidad a los datos personales de los registros públicos”. "}
{"input_text": "La disposición 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 4 Deróguese la Resolución No. 026-NG-DINARDAP-2015 de 28 de agosto de 2015 que contiene la norma que “Reforma a la norma que regula la asequibilidad a los datos personales de los registros públicos.” La presente resolución entrará en vigencia a partir de la fecha de su suscripción sin perjuicio de su publicación en el Registro Oficial. Dado en la ciudad de Quito a los 02 del mes de junio de 2023. Daniel Augusto Arboleda Villacreces DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Aprobado: Revisado: Elaborado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Ab. Sofía Vázquez / Directora de Normativa Ab. / Jean Jairo Cifuentes / Analista Página 16 de 16"}
{"input_text": "La consideración 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; el artículo 227 de la Constitución de la República del Ecuador al referirse a los principios que rigen a la administración pública dispone: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.\"; el artículo 2 de la Ley Orgánica de Transparencia y Acceso a la Información Pública determina que” La presente Ley tiene por finalidad proteger respetar promover y garantizar que la información pública sea accesible oportuna completa y fidedigna para el ejercicio de los derechos ciudadanos contemplados en la Constitución de la República del Ecuador y la ley.”; en el Tercer Suplemento del Registro Oficial No. 245 de 7 de febrero de 2023 se promulgó la Ley Orgánica para la Transformación Digital y Audiovisual la que en su parte pertinente en los artículos 83 84 85 y 86 reforma la Ley de Registro; el artículo 83 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro manifiesta: “Agréguese a continuación del literal g) del artículo 11 el siguiente: h) Desarrollar e implementar los sistemas informáticos que permitan la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el Registro para lo cual deberá tomar en cuenta las características y condiciones que para dicha finalidad Página 1 de 16 emita la Dirección Nacional de Registros Públicos (DINARP) como ente rector de la actividad registral. El sistema informático permitirá y promoverá la interconexión progresiva entre los distintos registros de la propiedad del país que permita el acceso y consulta de los ciudadanos desde distintas jurisdicciones a una base de datos integrada y se acompañará con un plan progresivo de digitalización para los cantones que no cuenten con los registros certificados inventarios negocios jurídicos y demás actos o constancias digitalizadas. Serán los Gobiernos Autónomos Descentralizados Municipales quienes deberán asignar los fondos necesarios para llevar a cabo este proceso en aquellos registros que no tengan autonomía financiera y administrativa.”; "}
{"input_text": "La consideración 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 84 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro prevé “Sustitúyase el literal c) del artículo 11 el siguiente artículo: (…) Los libros a cargo del Registrador podrán llevarse de forma electrónica y automatizada siempre que garanticen la seguridad jurídica publicidad y la legalidad de los derechos constituidos en los actos contratos y negocios jurídicos de las personas. Las bases de datos y los sistemas informáticos implementados estarán sujetos al control y auditoría del ente rector de la actividad registral. Los registros digitales que se generen como consecuencia de la transformación a la que se refiere este literal así como todos los registros digitales que existan al momento o que se generen en el futuro deberán contar con todas las medidas de ciberseguridad necesarias para garantizar la seguridad de la información que reposa en ellos así como su confidencialidad integridad y disponibilidad incluyendo las garantías de protección de datos personales (…).”; "}
{"input_text": "La consideración 2 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 85 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro dispone: “Agréguese en el artículo 18 el siguiente texto: “El Libro Repertorio podrá llevarse de forma electrónica en aquellos Registros que implemente un proceso de digitalización y automatización de los trámites registrales a su cargo. Para lo cual el proceso electrónico de registro en este Libro debe llevarse con sujeción al presente artículo.””; "}
{"input_text": "La consideración 3 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 86 de Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro señala “Agréguese a continuación del artículo 24 en el TÍTULO V el siguiente artículo innumerado: “Art. (…).- Los registros de las inscripciones y el libro de índice general podrán llevarse de forma electrónica para lo cual se tomarán en consideración y serán adaptados todos los procedimientos contemplados en la presente Ley para los registros físicos de los documentos.””; "}
{"input_text": "La consideración 4 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos prescribe: “La presente Ley rige para las instituciones del sector público y privado Página 2 de 16 "}
{"input_text": "La consideración 5 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que que actualmente o en el futuro administren bases o registros de datos públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; el artículo 22 de la Ley Orgánica del Sistema Nacional de Registros Públicos indica: \"La Dirección Nacional de Registros Públicos se encargará de organizar un sistema de interconexión cruzado entre los registros público y privado que en la actualidad o en el futuro administren bases de datos públicos de acuerdo con lo establecido en esta Ley y en su Reglamento.”; el artículo 23 de la Ley Orgánica del Sistema Nacional de Registros Públicos expone: “El sistema informático tiene como objetivo la tecnificación y modernización de los registros empleando tecnologías de información bases de datos y lenguajes informáticos estandarizados protocolos de intercambio de datos seguros que permitan un manejo de la información adecuado que reciba capture archive codifique proteja intercambie reproduzca verifique certifique o procese de manera tecnológica la información de los datos registrados (…)”; el artículo 25 de la Ley ibídem determina: “Para efectos de la sistematización e interconexión del registro de datos y sin perjuicio de la obligación de mantener la información en soporte físico como determinan las diferentes normas de registro los distintos registros deberán transferir la información a formato digitalizado. La Dirección Nacional de Registros Públicos definirá el sistema informático para el manejo y administración de registros y bases de datos el cual regirá en todos los registros del país.”; el artículo 26 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Toda base informática de datos debe contar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impidan la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; el artículo 28 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: \"Créase el Sistema Nacional de Registros Públicos con la finalidad de proteger los derechos constituidos los que se constituyan modifiquen extingan y publiciten por efectos de la inscripción de los hechos actos y/o contratos determinados por la presente Ley y las leyes y normas de registros; y con el objeto de coordinar el intercambio de información de los registros de datos públicos. En caso de que entidades privadas posean información que por su naturaleza sea pública serán incorporadas a este sistema […].\"; "}
{"input_text": "La consideración 6 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 29 de Ley Orgánica del Sistema Nacional de Registros Públicos señala “El Sistema Nacional de Registros Públicos estará conformado por los registros: Página 3 de 16 civil de la propiedad mercantil societario datos de conectividad electrónica vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios y todos los registros de datos de las instituciones públicas y privadas que mantuvieren y administren por disposición legal información registral de carácter público. Será presidido por la Directora o Director Nacional de Registros Públicos con las facultades que se determinan en la presente Ley y su respectivo reglamento.”; "}
{"input_text": "La consideración 7 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 31 de Ley Orgánica del Sistema Nacional de Registros Públicos puntualiza entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: \"[…] 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; […]5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca”; la Disposición Transitoria Sexta de la norma ut supra señala “En el plazo máximo de 3 años contados a partir de la fecha de entrada en vigencia de la presente ley todo registro de la propiedad societario mercantil o civil que hasta la fecha mantenga su información y registros de manera física deberá ser transformado a formato digital con las características y condiciones definidas por el Director Nacional para lo cual se asignarán los fondos pertinentes y se proveerán los programas informáticos necesarios. Esta omisión será sancionada con la destitución del correspondiente funcionario por la Directora o Director Nacional de Registros Públicos.”; "}
{"input_text": "La consideración 8 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que el artículo 15 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La Dirección Nacional de Registro de Datos Públicos estandarizará y administrará la información de las fuentes propias y externas para lo cual todos los integrantes del sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea para proyectos y servicios de información”; "}
{"input_text": "La consideración 9 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que mediante Resolución No. 020-NG-DINARDAP-2013 de 04 de junio de 2013 la Dirección Nacional de Registros Públicos expidió la “Norma de Digitalización de Documentos”. "}
{"input_text": "La consideración 10 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que a través de Memorando Nro. DINARP-CNPI-2023-0081-M de 1 de junio de 2023 la Coordinación de Normativa y Protección de la Información envió el proyecto de resolución a la Coordinación de Infraestructura y Seguridad Informática a fin de que remitan sus observaciones en el ámbito técnico y tecnológico; Página 4 de 16 "}
{"input_text": "La consideración 11 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que mediante Memorando Nro. DINARP-CISI-2023-0097-M de 20 junio de 2023 la Coordinación de Infraestructura y Seguridad Informática remite informe técnico en el que concluye y recomienda: “Se concluye que las condiciones técnicas descritas sean los requisitos mínimos que deberán ser contemplados por los Registros para que puedan contar con un proceso de digitalización eficiente y eficaz. ·En cuanto a seguridad de la información se deberá contemplar los requisitos mínimos contemplados en el apartado «Condiciones Adicionales» para que no exista inconvenientes. ·Se recomienda a los Registros evaluar mediante un check list las condiciones que se proponen para el efecto ver Anexo I. ·A la máxima autoridad acoger estos lineamientos de manera que sean aplicados a los Registros a través del instrumento que corresponda. ·Como punto de partida para el acceso a la información desde diferentes jurisdicciones se deberá analizar la implementación de un sistema visualizador el mismo que debe manejar parámetros de búsqueda homologados entre las diferentes instituciones registrales que a su vez permitan obtener tanto la metadata como posteriormente el documento digitalizado.”; "}
{"input_text": "La consideración 12 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "Que a través de Memorando Nro. DINARP-CNPI-2023-0100-M de 20 de junio de 2023 la Coordinación de Normativa y Protección concluye y recomienda: “Finalmente pongo en su conocimiento el proyecto de resolución de la mentada resolución para su revisión y posterior suscripción en virtud de las recomendaciones de los informes adjuntos y del análisis de esta unidad por lo que recomiendo su aprobación”; a través de los resultados obtenidos por medio del formulario remitido durante la plenaria dos del evento “Foro Nacional de Registros - Primera edición” realizado los días 20 y 21 de julio de 2023 se determinó el tiempo prudente para la transformación digital de los registros y la priorización al momento de digitalizar. en ejercicio de las facultades dispuestas en la Ley de Transformación Digital y Audiovisual es necesario establecer las características y condiciones que deben cumplir los sistemas informáticos que permitan la transformación a formato digital de todos los registros; y con Acuerdo Ministerial Nro. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 el doctor Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable (…).”. Página 5 de 16 En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación."}
{"input_text": "La resolución 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULOEMITIR LOS LINEAMIENTOS PARA LA IMPLEMENTACIÓN DE LOS SISTEMAS INFORMÁTICOS PARA LA TRANSFORMACIÓN DIGITAL DE LOS REGISTROS CAPÍTULO I GENERALIDADES "}
{"input_text": "La resolución 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO1. Objeto. – La presente norma tiene por objeto dar a conocer las condiciones técnicas y tecnológicas que deben cumplir los sistemas que permitan la digitalización de los archivos físicos y todos los registros certificados inventarios y demás actos o constancias físicas que se generen en los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles. "}
{"input_text": "La resolución 2 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO2.- Ámbito de aplicación. - La presente norma será de cumplimiento obligatorio para los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles. "}
{"input_text": "La resolución 3 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO3.- Glosario de Términos. – Para efectos de aplicación de la presente resolución se establecen las siguientes definiciones: Acervo registral: Se considera a los libros índices sus imágenes documentos físicos o electrónicos extractos o contenidos capturados o digitalizados sus respaldos folios y base de datos. Automatización: Es el proceso de uso de tecnología para realizar tareas con muy poca intervención humana. Análisis de Riesgos: Es una herramienta de prevención con la que puedes pronosticar las amenazas con potencial de afectar el desempeño de algún proceso (cambio escalada proyecto o incursión). Anonimización: Es una técnica de tratamiento de datos que elimina o modifica los datos personales identificables para obtener datos anónimos que no se pueden asociar con ninguna persona. Ciberseguridad: Preservación de la confidencialidad integridad y disponibilidad de la información en el ciberespacio. Página 6 de 16 Ciberespacio: Entorno complejo que resulta de la interacción de las personas software y servicios a través de internet por medio de dispositivos tecnológicos y redes conectados al mismo que no existe en forma física alguna. Cifrado: Es la base principal de la seguridad de datos es la forma más sencilla e importante para garantizar que la información de un sistema de computadora no pueda robarla ni leerla alguien que desee utilizarla con fines maliciosos. Digitalización: Proceso para transformar objetos analógicos y físicos en digitales Documento electrónico: Es aquel cuyo contenido ha sido producido en soporte electrónico Escanear: Acción que implica la trasformación de un escrito o formato digital Hardware: Conjunto de los componentes que integran la parte material tecnológica para la gestión de los procesos de digitalización e indexación. Inventario: Lista ordenada de bienes y demás cosas valorables que pertenecen a una persona empresa o institución. Indexación: Es el proceso de incorporar información estructurada al documento digitalizado proveyendo a la base de datos la información adicional que permite clasificar y encontrar la documentación de manera precisa. Integridad: Propiedad de proteger la precisión y completitud de la información. OCR: Es el proceso por el cual se convierte una imagen de texto en un formato que puedan leer las máquinas. Plataforma Tecnológica: Son los diferentes programas y componentes de Hardware y de Software que serán parte del sistema informático de digitalización. Repositorio: Espacio centralizado donde se almacena analiza mantiene y difunde información digital. Sistema informático: Conjunto de elementos físicos y lógicos capaz de almacenar y procesar información. Servidor de Archivo (NAS): Consiste en un dispositivo de almacenamiento de alta capacidad conectado a una red que permite a los usuarios y clientes autorizados almacenar y recuperar datos en una ubicación centralizada. Software: Conjunto de programas instrucciones y reglas informáticas para ejecutar ciertas tareas en una computadora. Página 7 de 16 CAPÍTULO II PROCEDIMIENTO Y APLICACIÓN "}
{"input_text": "La resolución 4 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO4.- Aplicación de los lineamientos. – Para la aplicación de los lineamientos que orientan la eficiente y eficaz implementación de un sistema de digitalización la Dirección Nacional de Registros Públicos a través de la Coordinación de Infraestructura y Seguridad Informática establecerá las condiciones técnicas y tecnológicas así como los aspectos mínimos a implementar en dicho sistema. "}
{"input_text": "La resolución 5 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO5.- Del inventario. – Cada Registro de la Propiedad Registro Mercantil y Registro de la Propiedad con funciones y facultades de Registros Mercantiles previo al proceso de digitalización deberá organizar clasificar expurgar foliar e inventariar la documentación física que consta en el registro; e identificará que documentos se van a digitalizar a través de un inventario de información registral compuesta por libros partidas de inscripción o documentos encuadernados y archivos digitales el mismo que contendrá lo siguiente: 1. Identificar el volumen de los documentos a digitalizar clasificados por tipo de documento. 2. Identificar el tipo de archivo de cada documento (empastados anillados grapados etc.). 3. Identificar el tipo de formato de escritura del documento (manual máquina de escribir computador etc.) 4. Identificar las marginaciones en los documentos. 5. Identificar el estado de los documentos en el caso de que estos se encuentren en malas condiciones se determinará si se puede proceder con la restauración previa al proceso de digitalización. "}
{"input_text": "La resolución 6 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO6.- Del sistema informático. – En el marco del proceso de digitalización e indexación de las imágenes del acervo registral los términos y metodología específica deberá contener las medidas de seguridad necesarias para poner en marcha este procedimiento bajo el sistema de escaneo masivo de acuerdo a los siguientes aspectos mínimos: 1. Deberá contener un gestor documental o repositorio de archivos servidores de bases de datos con sus respectivas políticas de respaldos. Página 8 de 16 2. Deberá contener mínimo los siguientes módulos: escaneo indexación trazabilidad (del documento durante su vida en la línea de producción para indexación) visualización archivo pasivo roles parametrizaciones) auditoría (verificación de la calidad). (permisos de usuarios administración del sistema 3. La plataforma tecnológica del sistema de digitalización deberá contener un servidor de archivos (NAS) base de datos del proceso de indexación y de visualización y archivo pasivo con altas capacidades de almacenamiento. Se deberá considerar la disponibilidad de procesamiento y memoria para la creación de servidores virtuales o físicos donde se desplieguen los sistemas que forman parte de la plataforma tecnológica de digitalización. 4. Contará con escáneres de alta velocidad para diferentes tipos de tamaño de documento para digitalizar documentos con tamaño mayor a A3 o para libros que no puedan ser separados deberá incorporar escáneres especiales. 5. El sistema deberá ser capaz reconocer los diferentes tipos de escritura para acelerar el proceso de indexación de los documentos mediante métodos actuales de OCR (Reconocimiento Óptico de Caracteres) o inteligencia artificial. 6. El sistema deberá permitir procesos manuales de indexación en el caso de que el reconocimiento de caracteres y símbolos se vuelva complejo. El sistema informático deberá tener un ciclo de vida sostenible desde el punto de vista medioambiental y social. CAPÍTULO III PROGRAMAS Y COMPONENTES DEL SISTEMA INFORMÁTICO "}
{"input_text": "La resolución 7 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO7.-Características de software hardware y comunicaciones. – Para llevar a cabo el proceso de digitalización es necesario que la plataforma tecnológica tenga en cuenta los siguientes programas y componentes: 1. Software: herramienta tecnológica que permita la captura de documentos para convertir archivos físicos en expedientes digitales y que contenga instrumentos adecuados para la búsqueda localización y recuperación de los documentos electrónicos de archivo. 2. Hardware: servidores informáticos para el almacenamiento y administración de imágenes y su información con fines de custodia y preservación los registros a cargo de la gestión del sistema establecerán la capacidad que se requiere considerando el volumen documental anual de escaneo estructura de redundancia para garantizar la continuidad Página 9 de 16 de las operaciones y la replicación de la información en casos de incidentes o catástrofes en el servicio primario. 2.1 Escáneres: se tendrá que considerar los prototipos de escáner con diferentes características y formatos que se adapten a cada necesidad de bajo mediano y alto volumen documental cuya aplicación dependerá de la cantidad de imágenes que se digitalicen así como la velocidad u operatividad de digitalización e indexación. 2.2 Hardware de administración digital: para los fines de digitalización e indexación de la información los registros deberán tomar en cuenta que en el caso de los documentos en papel se precisa de escáneres que permiten la captura de los documentos y transformación a formato digital enviando la información en estructura de imágenes a un ordenador o sistema para su procesamiento y administración. 3. Comunicación: es el conjunto de tecnologías que permiten el acceso la producción procesamiento el tratamiento almacenamiento la transmisión y comunicación de información presentada en diferentes códigos (ya sea texto sonido imagen entre otros). 3.1. Conexiones de red: garantizará la capacidad de establecer una comunicación o crear un vínculo entre diferentes dispositivos. 3.2. Conexiones de internet: es necesario proveer y contar con la adecuada conexión de internet de alta velocidad para facilitar el acceso remoto a los documentos digitalizados. "}
{"input_text": "La resolución 8 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO8.- Calidad de la imagen. – Para la adecuada consecución de la calidad de imagen se recomienda configurar los escáneres a fin de que por defecto la digitalización e indexación de documentos se realice con las siguientes especificaciones básicas: 1. Color: La digitalización deberá realizarse preferentemente en blanco y negro en el caso que la imagen del documento original a color no fuera legible. 2. Resolución: La resolución deberá estar configurada en 300 ppp/dpi (puntos por pulgada/dot per inch). Si la calidad de visualización del documento resultante lo permite podrá utilizarse una resolución menor 200 o 150 ppp permitiendo un menor tamaño del mismo. 3. Formatos: JPG PNG TIFF y PDF. 4. Tamaño de página: se considerará automático para casos de documentación variada así como para casos específicos el uso de formato A4 opción 210 x 297 mm. Página 10 de 16 5. Reconocimiento de orientación texto: automática a fin de que el driver detecte dicha orientación. 6. Eliminación de desviación: a fin de que el software de digitalización enderece de manera automática las imágenes que se mueven en el proceso de escaneo. 7. Nitidez: con la activación de eliminación de bordes puntos agujeros perforados o rayas "}
{"input_text": "La resolución 9 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO9.- Comprensión de documentos. - Se deberá utilizar el formato JPG PNG TIFF y PDF al ser los más expedidos en el intercambio de información el mismo que permitirá la preservación y fácil recuperación del archivo digitalizado como resultado final del documento deberá garantizarse que sea legible y se almacenará firmado electrónicamente para que no se pueda alterar en el futuro. CAPÍTULO IV SEGURIDAD INFORMÁTICA "}
{"input_text": "La resolución 10 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO10.- Seguridad informática. - Los registros digitales que se generen como consecuencia de la transformación así como todos los registros digitales que existan al momento o que se generen en el futuro deberán contar con todas las medidas de ciberseguridad que permitan la preservación de la confidencialidad integridad y disponibilidad de la información que para el efecto emita el ente rector de la transformación digital. "}
{"input_text": "La resolución 11 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "ARTICULO11.- Plan de respaldo y recuperación de datos. – Cada registro deberá establecer un plan de respaldo el mismo que permitirá mantener la integridad de los documentos digitalizados en caso de pérdida daño o eliminación. Además implementará medidas de recuperación de datos para poder restaurar los archivos digitales en caso de fallas o desastres. DISPOSICIONES GENERALES PRIMERA. - Disponer a la Coordinación de Infraestructura y Seguridad Informática y la Coordinación de Gestión Registro y Seguimiento a través de sus direcciones la ejecución y cumplimiento de la presente resolución. SEGUNDA. - Los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán implementar los sistemas informáticos que permitan la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el registro tomando en cuenta los lineamientos establecidos en la presente resolución. Página 11 de 16 TERCERA. - Disponer a la Dirección de Comunicación la difusión publicación de la presente resolución en la página institucional. DISPOSICIONES TRANSITORIAS PRIMERA. - En el término de cuarenta y cinco (45) días contados a partir de la publicación de la presente resolución en el Registro Oficial la Coordinación de Gestión Registro y Seguimiento deberá remitir un informe respecto del proceso de digitalización en los distintos registros a nivel nacional llevado a cabo desde el año 2013 en el cual entró en vigencia la Resolución Nro. 020-NG-DINARDAP-2013. SEGUNDA. - En el término de treinta (30) días contados a partir de la publicación de la presente resolución en el Registro Oficial los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán notificar a la Coordinación de Gestión Registro y Seguimiento el sistema informático de digitalización que tienen implementado y si cumple con los lineamientos establecidos en la presente resolución. Si cumple deberá en el mismo oficio remitir el plan progresivo de digitalización que no podrán exceder los dieciocho (18) meses contados a partir de la publicación de la presente resolución en el Registro Oficial. Para el efecto los registros priorizarán los últimos veinticinco años de su archivo. Si no cumple los registros deberán reacondicionar o reciclar su sistema informático. Si no es posible reutilizar o reciclar deberá darle un uso responsable coadyuvando a la economía circular. TERCERA. - En el plazo de dieciocho (18) meses contados a partir de la publicación de la presente resolución en el Registro Oficial los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles que no cuenten con un sistema informático de digitalización deberán implementar el sistema informático que permita la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el registro que cumpla con los lineamientos de la presente norma. CUARTA. - En el término de treinta (30) días contados a partir de la implementación del sistema informático los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán remitir a la Coordinación de Gestión Registro y Seguimiento el plan progresivo de digitalización el mismo que no podrá exceder los dieciocho (18) meses contados a partir de su Página 12 de 16 implementación. Para el efecto los registros priorizarán los últimos veinticinco años de su archivo."}
{"input_text": "La disposición 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 0 Deróguese la Resolución Nro. 019-NG-DINARDAP-2013 de 9 de mayo de 2013 que contiene la norma que “Crea el Sistema Nacional de Registro de la Propiedad”. "}
{"input_text": "La disposición 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output_text": "DISPOSICION 1 Deróguese toda norma que se encuentre en contraposición a la presente resolución. Dado en la ciudad de Quito a los 31 días del mes de julio de 2023. Abg. Daniel Augusto Arboleda Villacreses DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Aprobado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Revisado: Ab. Sofía Vázquez / Directora de Normativa Elaborado: Ab. / Carolina Morales / Asistente Página 13 de 16 ANEXO I ITEM CUMPLE NO CUMPLE INVENTARIO OBSERVACIONES Identifica el volumen de los documentos a digitalizar clasificados por tipo de documento. Identifica los tipos de encuadernación para cada tipo de documento (empastados anillados grapados etc.) Identifica el tipo de formato de escritura del documento Identifica las marginaciones que se pueden incluir en cada uno de los tipos de documentos Identifica el estado de los documentos SISTEMA La institución cuenta con un sistema de digitalización El sistema de digitalización tiene al menos los siguientes módulos: \\uf0b7 Escaneo \\uf0b7 Indexación \\uf0b7 Trazabilidad (del su línea de para la documento durante vida en producción indexación) \\uf0b7 Visualización \\uf0b7 Ubicación de los documentos en el archivo pasivo \\uf0b7 Administración sistema (permisos del de Página 14 de 16 usuarios parametrización sistema) roles del \\uf0b7 Auditoría (verificación de la calidad) La solución de digitalización dentro de su arquitectura cuenta con: \\uf0b7 Un servidor dedicado a archivos los almacenar digitalizados \\uf0b7 Una base de datos para el proceso de indexación \\uf0b7 Una base de datos para el sistema de visualización y archivo pasivo \\uf0b7 A nivel de infraestructura tecnológica se cuenta con la suficiente capacidad de almacenamiento disponibilidad de procesamiento y memoria para de servidores virtuales para el los desplieguen sistemas que componen la solución de digitalización creación de la Cuenta con escáneres de alta velocidad para los diferentes tamaños de documentos; y de ser el caso escáneres especiales para digitalizar documentos con tamaño mayor a A3 o para libros que no puedan ser separados de su encuadernado Cuenta con métodos automáticos o inteligencia artificial de reconocer los diferentes tipos de escritura que aceleren el proceso de indexación de los documentos Página 15 de 16 Permite procesos manuales de indexación en el caso de que el reconocimiento de caracteres y símbolos sea complejo Utiliza estándares que garanticen que el documento sea legible y que ocupe el menor espacio posible en disco Página 16 de 16"}
