{"input": "La consideración 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; "}
{"input": "La consideración 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el numeral 11 del artículo 66 de la Constitución de la República del Ecuador establece: “(…) En ningún caso se podrá exigir o utilizar sin autorización del titular o de sus legítimos representantes la información personal o de terceros sobre sus creencias religiosas filiación o pensamiento político; ni sobre datos referentes a su salud vida sexual salvo por necesidades de atención médica.”; el numeral 19 del artículo 66 de la Constitución de la República del Ecuador manifiesta: “El derecho a la protección de datos de carácter personal que incluye el acceso y la decisión sobre información y datos de este carácter así como su correspondiente protección. La recolección archivo procesamiento distribución o difusión de estos datos o información requerirán la autorización el titular o el mandato de la ley.”; el artículo 226 de la Constitución de la República del Ecuador prescribe: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; el artículo 227 de la Constitución de la República del Ecuador prescribe: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.”; "}
{"input": "La consideración 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el numeral 2 del artículo 21 de la Ley para la Optimización y Eficiencia de Trámites Administrativos señala “Sin perjuicio de lo establecido en la Ley del Página 1 de 16 "}
{"input": "La consideración 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoriamente la información que reposa en: (…) 2. El Sistema Nacional de Registro de Datos Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registro de Datos Públicos y la entidad que presida el Sistema Nacional de Registro de Datos Públicos” el artículo 1 de la Ley Orgánica De Protección de Datos Personales establece: “El objeto y finalidad de la presente ley es garantizar el ejercicio del derecho a la protección de datos personales que incluye el acceso y decisión sobre información y datos de este carácter así como su correspondiente protección. Para dicho efecto regula prevé y desarrolla principios derechos obligaciones y mecanismos de tutela; el artículo 7 de la Ley Orgánica De Protección de Datos Personales manda: “El tratamiento será legítimo y lícito si se cumple con alguna de las siguientes condiciones: 1) Por consentimiento del titular para el tratamiento de sus datos personales para una o varias finalidades especificas; 2) "}
{"input": "La consideración 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que sea realizado por el responsable del tratamiento en cumplimiento de una obligación legal; 3) "}
{"input": "La consideración 5 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que sea realizado por el responsable del tratamiento per orden judicial debiendo observarse los principios de la presente ley; 4) "}
{"input": "La consideración 6 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el tratamiento de datos personales se sustente en el cumplimiento de una misión realizada en interés público o en el ejercicio de poderes públicos conferidos al responsable derivados de una competencia atribuida por una norma con rango de ley sujeto al cumplimiento de los estándares internacionales de derechos humanos aplicables a la materia al cumplimiento de los principios de esta ley y a los criterios de legalidad proporcionalidad y necesidad; 5) Para la ejecución de medidas precontractuales a petición del titular o para el cumplimiento de obligaciones contractuales perseguidas por el responsable del tratamiento de datos personales encargado del tratamiento de datos personales o por un tercero legalmente habilitado; 6) Para proteger intereses vitales del interesado o de otra persona natural como su vida salud o integridad; 7) Para tratamiento de datos personales que consten en bases de datos de acceso público; u 8) Para satisfacer un interés legítimo del responsable de tratamiento o de tercero siempre que no prevalezca el interés o derechos fundamentales de los titulares al amparo de lo dispuesto en esta norma.”; "}
{"input": "La consideración 7 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 11 de la Ley Orgánica De Protección de Datos Personales prescribe: “Los datos personales cuyo tratamiento se encuentre regulado en normativa especializada en materia de ejercicio de la libertad de expresión sectores regulados por normativa específica gestión de riesgos desastres naturales seguridad nacional y defensa del Estado; y los datos personales que deban proporcionarse a autoridades administrativas o judiciales en virtud de solicitudes y órdenes amparadas en competencias atribuidas en la normativa vigente estarán sujetos a los principios establecidos en sus propias normas y los principios Página 2 de 16 "}
{"input": "La consideración 8 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que establecidos en esta Ley en los casos que corresponda y sea de aplicación favorable. En todo caso deberá darse cumplimiento a los estándares internacionales en la materia de derechos humanos y a los principios de esta ley y como mínimo a los criterios de legalidad proporcionalidad y necesidad.”; el artículo 25 de la Ley Orgánica De Protección de Datos Personales prescribe: “Se considerarán categorías especiales de datos personales los siguientes: a) Datos sensibles; b) Datos de niñas niños y adolescentes: c) Datos de salud; y d) Datos de personas con discapacidad y de sus sustitutos relativos a la discapacidad.”; el artículo 26 de la Ley Orgánica De Protección de Datos Personales ordena: “Queda prohibido el tratamiento de datos personales sensibles salvo que concurra alguna de las siguientes circunstancias: a) El titular haya dado su consentimiento explícito para el tratamiento de sus datos personales especificándose claramente sus fines. b) El tratamiento es necesario para el cumplimiento de obligaciones y el ejercicio de derechos específicos del responsable del tratamiento o del titular en el ámbito del Derecho laboral y de la seguridad y protección social. c) El tratamiento es necesario para proteger intereses vitales del titular o de otra persona natural en el supuesto de que el titular no esté capacitado física o jurídicamente para dar su consentimiento. d) El tratamiento se refiere a datos personales que el titular ha hecho manifiestamente públicos. e) El tratamiento se lo realiza por orden de autoridad judicial. f) El tratamiento es necesario con fines de archivo en interés público fines de investigación científica o histórica o fines estadísticos que debe ser proporcional al objetivo perseguido respetar en lo esencial el derecho a la protección de datos y establecer medidas adecuadas y específicas para proteger los intereses y derechos fundamentales del titular. g) Cuando el tratamiento de los datos de salud se sujete a las disposiciones contenidas en la presente ley.”; el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. […]”; el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos expone: “La presente Ley rige para las instituciones del sector público y privado que actualmente o en el futuro administren bases o registros públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; el inciso primero del artículo 4 de la Ley Orgánica del Sistema Nacional de Registros Públicos dispone: “Las instituciones del sector público y privado y las personas naturales que actualmente o en el futuro administren bases o registros de datos públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. […]”; "}
{"input": "La consideración 9 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Son confidenciales los datos de carácter personal. El acceso a estos Página 3 de 16 datos solo será posible cuando quien los requiera se encuentre debidamente legitimado conforme a los parámetros previstos en la Ley Orgánica de Protección de Datos Personales su respectivo reglamento y demás normativa emitida por la Autoridad de Protección de Datos Personales. Al amparo de esta Ley para acceder a la información sobre el patrimonio de las personas cualquier solicitante deberá justificar y motivar su requerimiento declarar el uso que hará del mismo y consignar sus datos básicos de identidad tales como nombres y apellidos completos número del documento de identidad o ciudadanía dirección domiciliaria y los demás datos que mediante el respectivo reglamento se determinen. Un uso distinto al declarado dará lugar a la determinación de responsabilidades sin perjuicio de las acciones legales que el titular de la información pueda ejercer. La Directora o Director Nacional de Registros Públicos definirá los demás datos que integran el sistema nacional y el tipo de reserva y accesibilidad.”; el artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: “1. Presidir el Sistema Nacional de Registros Públicos cumpliendo y haciendo cumplir sus finalidades y objetivos; 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; [...] 5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca. […] 14. Controlar y supervisar que las entidades pertenecientes al Sistema Nacional de Registros Públicos incorporen mecanismos de protección de datos personales así como dar cumplimiento a las disposiciones establecidas en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa que la Autoridad de Protección de Datos Personales dicte para el efecto. […]”; "}
{"input": "La consideración 10 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 2 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos respecto al Sistema Nacional de Registros Públicos indica: \"Está conformado por las instituciones públicas y privadas determinadas en la Ley Orgánica del Sistema Nacional de Registros Públicos y las que en el futuro determine mediante resolución el Director Nacional de Registros Públicos en ejercicio de sus competencias\"; "}
{"input": "La consideración 11 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 4 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “El Director Nacional de Registros Públicos previa resolución motivada podrá disponer que se incorporen al Sistema aquellos registros públicos no previstos expresamente en la Ley. La resolución de incorporación podrá expedirse una vez que se verifique lo siguiente: 1. "}
{"input": "La consideración 12 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que se trate de base de datos que contengan un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y 2. "}
{"input": "La consideración 13 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía. En su resolución el Director indicará si los datos que constan en los registros que se incorporan al Página 4 de 16 Sistema son accesibles o confidenciales y les dará la protección que corresponda según dicha clasificación. Este estatus podrá ser modificado previa resolución motivada en cualquier tiempo de acuerdo a las circunstancias del momento pero siempre dentro del marco jurídico vigente”; "}
{"input": "La consideración 14 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 9 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos en cuanto a la Regulación y Control establece: \"Sin perjuicio de las competencias que ejercen los entes de control definidos en la Constitución de la República la Dirección Nacional de Registros de Públicos es el órgano de regulación control auditoría y vigilancia de todos los integrantes del Sistema Nacional de Registros Públicos en torno a la interoperabilidad de datos. La regulación control auditoría y vigilancia comprenden todas las acciones necesarias para garantizar la disponibilidad del servicio. Las decisiones administrativas internas de cada ente registral corresponden exclusivamente a sus autoridades pero la Dirección Nacional de Registros Públicos arbitrará las medidas que sean del caso cuando perjudiquen la disponibilidad de los servicios\"; "}
{"input": "La consideración 15 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 10 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos ordena: “Son funciones del Director Nacional de Registros Públicos a más de las señaladas en la Ley y este Reglamento las siguientes: […] 4. Emitir las resoluciones técnicas operativas y administrativas necesarias para el adecuado funcionamiento del Sistema; […] 8. Ordenar la publicación de la lista de registros públicos de datos para conocimiento de los usuarios; […]”; "}
{"input": "La consideración 16 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 13 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos prevé: \"De la seguridad de la información. - La Dirección Nacional de Registros Públicos de conformidad con la ley expedirá las normas técnicas que contengan los estándares mecanismos y herramientas para precautelar la seguridad custodia y conservación de la información accesible y confidencial. La integridad y protección de los registros de datos públicos es responsabilidad de las instituciones del sector público y privado a través de sus representantes legales y las personas naturales que directamente los administren\"; "}
{"input": "La consideración 17 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 26 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos estipula: “Toda base informática de datos debe constar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impida la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; "}
{"input": "La consideración 18 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 1 del Decreto Ejecutivo No. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 con el cual se decretó la Implementación del Gobierno Electrónico en la Función Ejecutiva expresa: “La implementación del gobierno electrónico en la Función Ejecutiva consiste en el uso de las tecnologías de la información y comunicación por parte de las entidades para transformar las relaciones con los ciudadanos entre entidades de gobierno y empresas privadas a fin de mejorar la calidad de los servicios Página 5 de 16 gubernamentales a los ciudadanos promover la interacción con las empresas privadas fortalecer la participación ciudadana a través del acceso a la información y servicios gubernamentales eficientes y eficaces y coadyuvar con la transparencia participación y colaboración ciudadana.”; "}
{"input": "La consideración 19 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que el artículo 4 del Decreto Ejecutivo No. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 señala: “Obligaciones de las entidades de la Función Ejecutiva.- A las instituciones de la Función Ejecutiva dentro del ámbito de este Decreto Ejecutivo les corresponderá: a. Colaborar en la generación de los instrumentos que sean necesarios para la aplicación de presente Decreto así como para su cabal cumplimiento; y b. Utilizar los medios electrónicos que determine el Ministerio de Telecomunicaciones y de la Sociedad de la Información para la aplicación efectiva de las políticas de gobierno electrónico en la gestión pública.”; "}
{"input": "La consideración 20 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que mediante Resolución No. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que regula la clasificación de los datos que integren el Sistema Nacional de Registros Públicos”.; "}
{"input": "La consideración 21 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que a través de Resolución No. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la norma que “Establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registro de Datos Públicos”. incluir requisitos "}
{"input": "La consideración 22 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que mediante Memorando No. DINARP-CNPI-2023-0031-M de 24 de marzo de 2023 se ha solicitado que en el ámbito de sus competencias emitan informes considerando: 1) Justificación técnica y operativa de viabilidad respecto de la necesidad de la reforma de las mentadas resoluciones conforme las reuniones mantenidas y los comentarios que se incluyen en el documento adjunto. 2) lineamientos definiciones Análisis y determinación de términos etc. 3) La actualización de un procedimiento adecuado a las fases establecidas en el proyecto de resolución acompañarlo con su respectivo flujo esto se deberá realizar en colaboración con el área de Planificación en coordinación con la Dirección de Gestión y Registro y Coordinación de Infraestructura y Seguridad Informática y Dirección de Protección de la Información para adecuar los tiempos de respuesta y las actividades entregables de cada área; 4) Definir el objetivo justificación alcance contenido y glosario de términos. 5) Se adjunta un proyecto de reforma el cual se solicita trabajar en control de cambios a fin de conocer sus comentarios y sugerencias con respecto al contenido de los textos. 6) Revisar en los comentarios que anteceden en el documento de proyecto a fin de que las áreas puedan retroalimentar de acuerdo a sus atribuciones y competencias. "}
{"input": "La consideración 23 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que a través de Memorando No. DINARP-CISI-2023-0079-M de 22 de mayo de 2023 la Coordinación de Infraestructura y Seguridad Informática remite informe de viabilidad técnica y operativa para proyecto de reforma de Resolución Nro. 035-ng-dinardap-2016 y Nro. 039-ng-dinardap-2016 en el cual concluye “(…)Se revisaron los Anexos 1 2 y 3 adjuntos a la resolución Nro. 039-NG-Página 6 de 16 "}
{"input": "La consideración 24 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que DINARDAP-2016 y se determina que el Anexo 1 no requiere cambio alguno desde el ámbito tecnológico; el Anexo 2 no es de competencia de esta Coordinación y el Anexo 3 debe ser actualizado acorde al nuevo flujo de responsables y actividades a realizar dentro del procedimiento”. a través de Memorando No. DINARP-DPI-2023-0112-M de 31 de mayo de 2023 la Dirección de Protección de la Información remite informe para reforma y/o derogatoria de normativa relacionada a la protección de la información en el cual concluye “La Dirección Nacional de Registros Públicos de conformidad con lo establecido en los numerales 1 2 4 y 14 del artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos es competente para emitir mediante resolución la normativa que regule la clasificación de los datos de los registros públicos que integran el Sistema Nacional de Registros Públicos esto en concordancia con lo que establece el artículo de la norma ibidem respecto a la accesibilidad y confidencialidad que a su vez deben contemplar los parámetros que se encuentran previstos en la Ley Orgánica de Protección de Datos Personales y en atención también al tipo de reserva que establezca la normativa especializada para ciertas bases de datos. \\uf0b7 Lo descrito por la Resolución 035-NG-DINARDAP-2016 vigente establece una clasificación de los datos que requieren ser ajustados a los parámetros establecidos en la reforma del artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos y las disposiciones de la Ley Orgánica de Protección de Datos Personales. \\uf0b7 La Resolución 035-NG-DINARDAP-2016 no contempla a las categorías especiales de datos personales por lo que la misma debe ajustarse a los parámetros establecidos por la LOPDP para su tratamiento. \\uf0b7 La Resolución 039-NG-DINARDAP-2016 la cual en su artículo 7 contempla un procedimiento para integrar la información previo la elaboración de un informe de clasificación por parte de esta Dirección debería ser unificada con la Resolución 035- NG-DINARDAP-2016 por cuanto las mismas no son diferentes sino complementa. \\uf0b7 Es necesario considerar que la norma de clasificación no restringe el acceso a los datos categorizados como confidenciales a las entidades consumidoras sino que tiene como finalidad regular las condiciones y circunstancias de legitimación que se debe cumplir para tratar los datos personales que integran el SINARP lo cual debería constar en la norma integral que considere los dos procesos y cuyo proyecto fue puesto en conocimiento de esta Dirección.” "}
{"input": "La consideración 25 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que por medio de Memorando No. DINARP-CGRS-2023-0259-M de 31 de mayo de 2023 la Coordinación de Gestión Registro y Seguimiento remite informe funcional donde concluye y recomienda “De la revisión de la norma vigente se verifica la necesidad de establecer un procedimiento ordenado claro y con definiciones precisas de actividades y tiempos de ejecución. \\uf0b7 Se recomienda revisar los capítulos y numeración de artículos conforme al orden lógico establecido. \\uf0b7 Con el antecedente de que existe un informe emitido por la Coordinación de Infraestructura y Seguridad Informática mediante el cual se indica que por motivos de seguridad no se recomienda la publicación del catálogo Página 7 de 16 en página web se recomienda se realice su publicación en el portal que establezca la DINARP”. "}
{"input": "La consideración 26 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "Que con Acuerdo Ministerial No. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 Ab. Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información Subrogante resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional a partir del 7 de abril de 2023 quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable(…)”. En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación."}
{"input": "La resolución 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULOESTABLECER EL PROCEDIMIENTO DE INCORPORACIÓN DE FUENTES Y ENTES REGISTRALES Y LA CLASIFICACIÓN DE DATOS QUE CONFORMAN EL SISTEMA NACIONAL DE REGISTROS PÚBLICOS CAPÍTULO I NORMAS RECTORAS "}
{"input": "La resolución 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO1.- Objeto.- Establecer el procedimiento de incorporación de fuentes e instituciones públicas o privadas que actualmente o en el futuro administren registros públicos el tipo de reserva y la determinación de accesibilidad a los datos que incorporan el Sistema Nacional de Registros Públicos. "}
{"input": "La resolución 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO2.- Ámbito de aplicación.- La presente resolución será de obligatorio cumplimiento y aplicación para las entidades públicas o privadas que actualmente o en el futuro administren registros públicos; y las que se incorporen al Sistema Nacional de Registros Públicos. "}
{"input": "La resolución 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO3.- Glosario de términos.- Para efectos de aplicación de la presente norma los términos señalados a continuación tendrán las siguientes definiciones: Catálogo único. - Documento mediante el cual se detallan los campos que a la fecha integran el Sistema Nacional de Registros Públicos mismo que es administrado por la Dirección Nacional de Registros Públicos con base a la normativa legal vigente. Datos accesibles: Son los datos que no tienen el carácter de confidencial conforme al ordenamiento jurídico. Datos confidenciales: Son confidenciales los datos personales. Página 8 de 16 Ente registral.- Toda institución pública o privada a cargo de la información que forma parte del Sistema Nacional de Registro Públicos de acuerdo a lo establecido en la Ley. Fuente.- Es el conjunto ordenado de información dispuesto en una tabla o base de datos integrado al Sistema Nacional de Registros Públicos por el ente registral. Fuentes externas.- Es el conjunto de información proveniente de las instituciones que la Dirección Nacional de Registros Públicos determine que deben formar parte del Sistema Nacional de Registros Públicos. Fuentes propias.- Es el conjunto de información proveniente de los Registros: Civil de la Propiedad Mercantil Societario vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios Servicio de Rentas Internas Instituto Ecuatoriano de Seguridad Social Dirección Nacional de Migración Policía Nacional Comisión de Tránsito del Guayas Ministerio de Trabajo Municipios Función Judicial. Herramienta informática: Instrumento digital utilizado para manejar información con el uso de computadoras tales como el procesador de texto la base de datos las hojas de redes de cálculo el correo electrónico buscadores programas de diseño telecomunicaciones. la Legitimación de acceso.- Constituye cumplimiento de las condiciones para que el tratamiento de datos personales sea lícito. jurídica que evidencia el justificación Persona interesada o requirente.- Persona natural institución pública o privada que solicita la incorporación de un registro público al Sistema Nacional de Registro Público. Pre producción.- Permite la planificación análisis y definición de los aspectos clave de un proyecto tecnológico antes de su paso a producción. Es un proceso fundamental para verificar las funciones en la herramienta informática a fin de que cumpla con el propósito de concepción y minimice los riesgos y problemas durante su etapa de liberación. Producción.- Es el proceso por el cual las herramientas desarrolladas son transferidas al ambiente de producción con el propósito de ser utilizado por el usuario final. Registro público.- Información o registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones generadas del sector público o privado. SINARP: Sistema Nacional de Registros Públicos. CAPÍTULO II CLASIFICACIÓN DE LA INFORMACIÓN Página 9 de 16 "}
{"input": "La resolución 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO4.- Clasificación de la información.- La máxima autoridad de la Dirección Nacional de Registros Públicos definirá los datos que constan en las fuentes de los entes registrales como accesibles o confidenciales con base en el informe de clasificación que emita la Dirección de Protección de la Información su accesibilidad se determinará acorde a lo previsto en la Ley Orgánica del Sistema Nacional de Registros Públicos Ley Orgánica de Protección de Datos Personales y demás normativa relacionada. "}
{"input": "La resolución 5 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO5.- Accesibilidad a datos confidenciales.- Los datos de los registros públicos que integran el SINARP categorizados como confidenciales serán accesibles para las personas naturales o jurídicas de derecho público o privado previa legitimación de acceso conforme la normativa legal vigente. "}
{"input": "La resolución 6 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO6.- Responsabilidades.- Las instituciones del sector público o privado que actualmente o en el futuro administren registros públicos son responsables de la integridad protección y control de los registros públicos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. La responsabilidad sobre la veracidad y autenticidad de los datos registrados es exclusiva de la o el declarante cuando esta o este provee toda la información. Los entes registrales tomarán las medidas necesarias para garantizar la conservación custodia seguridad de los registros públicos su actualización rectificación o supresión. La Dirección Nacional de Registros Públicos a través de las áreas correspondientes controlará y supervisará que los entes registrales implementen mecanismos de protección de datos personales así como el cumplimiento a las disposiciones en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa conexa. "}
{"input": "La resolución 7 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO7.- Obligaciones.- Toda persona natural o jurídica de derecho público o privado que de cualquier forma llegaren a tratar la información proporcionada a través del Sistema Nacional de Registros Públicos contenida o resultante de los procesos derivados de su competencia o actividad quedan obligados a guardar confidencialidad o la debida reserva sobre la misma de conformidad con los principios establecidos en la Ley Orgánica del Sistema Nacional de Registros Públicos su reglamento de aplicación en la Ley Orgánica de Protección de Datos Personales y demás normativa aplicable para el efecto. CAPÍTULO III FASE DE EVALUACIÓN "}
{"input": "La resolución 8 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO8.- Formas de incorporación- El procedimiento de incorporación puede iniciarse de oficio o a solicitud de la persona interesada. A solicitud de la persona interesada de la forma y con los requisitos previstos en esta resolución. Página 10 de 16 De oficio a petición de la máxima autoridad de la Dirección Nacional de Registros Públicos bien por iniciativa propia o a petición razonada de otras personas naturales y/o instituciones públicas o privadas. "}
{"input": "La resolución 9 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO9.- Del requerimiento de incorporación.- La máxima autoridad de la Dirección Nacional de Registros Públicos a fin de verificar que se trate de una base de datos que contenga un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía solicitará la incorporación de la entidad pública o privada a la fuente externa; para el efecto solicitará que en el término de tres (3) días remita la siguiente información: 1. Formulario de incorporación 2. Correos electrónicos y números telefónicos de contactos técnicos 3. Matriz de datos 4. Diccionario de datos 5. Manual técnico 6. Batería de pruebas 7. 8. Credenciales de acceso (que deberán ser remitidas al Oficial de Seguridad de la Servicio web o base de datos (vista materializada) Información de DINARP (OSI). "}
{"input": "La resolución 10 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO10.- De la evaluación previa.- Recibida la documentación en el término de dos (2) días la Dirección de Gestión y Registro evaluará y verificará el cumplimiento de los requisitos establecidos en el artículo 9 de la presente resolución. En caso de incumplimiento de uno de los requisitos la Dirección de Gestión y Registro solicitará a la entidad que la complete. "}
{"input": "La resolución 11 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO11.- Validaciones de conectividad.- Cumplidos los requisitos la Dirección de Gestión y Registro solicitará a la Coordinación de Infraestructura y Seguridad Informática para que a través de sus Direcciones realice las validaciones de conectividad. La Dirección de Seguridad Informática conjuntamente con la institución pública o privada que administra el registro público dentro del término máximo de tres (3) días establecerá el mecanismo de conectividad o la vía de consumo de la información pudiendo ser VPN IPSec enlace de datos comunicación por la Red Nacional Gubernamental o consumo por internet. Una vez definido el mecanismo se solicitará a la Página 11 de 16 institución que en el término de dos (2) días defina el mecanismo seguro y oportuno para la entrega de las credenciales de acceso. La Dirección de Tecnología y Desarrollo en el término de tres (3) días gestionará y coordinará con la institución pública o privada que administra el registro público o su delegado la verificación del recurso de información que éste entrega a través de la vía de consumo previamente determinada para proceder a incorporarla al Sistema Nacional de Registros Públicos. En caso de no cumplir con las validaciones correspondientes la Coordinación de Infraestructura y Seguridad Informática procederá a notificar a la institución para que lo subsane. "}
{"input": "La resolución 12 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO12.- Del caso de negocio.- La Coordinación de Infraestructura y Seguridad Informática remitirá la validación de conectividad a la Dirección de Gestión y Registro para que en el término de tres (3) días con base en la incorporación del recurso de información actualice el inventario de campos y elabore el caso de negocio para la incorporación el cual deberá contar con firmas de responsabilidad del técnico Director de Gestión y Registro; y la Coordinación de Gestión Registro y Seguimiento. CAPÍTULO IV FASE DE INCORPORACIÓN TÉCNICA "}
{"input": "La resolución 13 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO13.- Inicio de la incorporación técnica. - La Dirección de Gestión y Registro remitirá el caso de negocio a la Coordinación de Infraestructura y Seguridad Informática quien deberá iniciar la incorporación técnica de la institución pública o privada que administra la base o registro público de conformidad con el caso de negocio. "}
{"input": "La resolución 14 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO14.- Monitoreo y Producción.- La Dirección de Tecnología y Desarrollo previo al paso de producción incorporará el mecanismo de monitoreo a la institución pública o privada que administra el registro público con base a los parámetros establecidos para este fin que es el mecanismo de monitoreo que desarrolló la Dirección de Tecnología y Desarrollo hacia la institución: servicios web y base de datos. La Dirección de Tecnología y Desarrollo solicitará a la Dirección de Gestión y Registro que previo al paso a preproducción realice incorporación correspondientes utilizando un paquete integral de consumo. En caso de que las pruebas en preproducción sean exitosas y validada la incorporación generará el “Documento de Aceptación” con el cual solicitará que la Dirección de Tecnología y Desarrollo implemente la incorporación en el paso de producción. las pruebas de En caso de que las pruebas no sean exitosas la Dirección de Gestión y Registro solicitará a la Dirección de Tecnología y Desarrollo la revisión y correctivos del caso hasta que sea viable el paso a producción. Página 12 de 16 Concluido el paso a producción la Dirección de Tecnología y Desarrollo notificará tal particular a la Dirección de Gestión y Registro. V FASE DE CLASIFICACIÓN E INCORPORACIÓN "}
{"input": "La resolución 15 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO15.- Clasificación de la información.- Una vez concluida la fase de incorporación técnica la Dirección de Gestión y Registro solicitará a la Dirección de Protección de la Información en el término de tres (3) días clasifique los datos o información que se incorporará al Sistema Nacional de Registros Públicos y la recomendación de protección que corresponda según dicha clasificación de conformidad con lo previsto en la normativa vigente. La Dirección de Protección de la información emitirá un informe con la clasificación de la información conforme lo establecido en la Constitución de la República del Ecuador Ley Orgánica de Protección de Datos Personales instrumentos internacionales y demás normativa que fuere aplicable mismo que deberá estar suscrito por su titular; y deberá ser remitido a la Dirección de Gestión y Registro para el trámite correspondiente. Sin embargo la clasificación de la información podrá ser modificada en cualquier momento previo informe motivado de acuerdo al ordenamiento jurídico vigente. "}
{"input": "La resolución 16 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO16.- Resolución de incorporación.- La Dirección de Gestión y Registro solicitará a la Dirección de Normativa que en el término de tres (3) días elabore el proyecto de resolución de incorporación de la entidad pública o privada que administra el registro público al Sistema Nacional de Registros Públicos la clasificación de la información y protección que se le otorgará de conformidad con el informe que elaboró la Dirección de Protección de la Información. El proyecto de resolución se pondrá en conocimiento de la máxima autoridad de la Dirección Nacional de Registros Públicos para su aprobación y suscripción. La Coordinación Gestión Registro y Seguimiento notificará a la institución con la resolución de incorporación como ente registral suscrita por la máxima autoridad de la Dirección Nacional de Registros Público. En caso de que se trate de la incorporación de nuevas fuentes y campos de información de instituciones públicas o privadas que forman parte del Sistema Nacional de Registro Públicos no se deberá cumplir con lo dispuesto en el presente artículo. Sin embargo la Coordinación Gestión Registro y Seguimiento notificará la incorporación de los campos o información y el informe de clasificación emitido por la Dirección de Protección de la Información. CAPÍTULO VI Página 13 de 16 DEL CATÁLOGO ÚNICO "}
{"input": "La resolución 17 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "ARTICULO17.- Actualización del catálogo. – La Dirección de Gestión y Registro deberá mantener actualizado el catálogo único y deberá estar publicado en los portales con lo que la Dirección Nacional de Registros Públicos cuente. DISPOSICIONES GENERALES PRIMERA.- Disponer a la Coordinación de Gestión Registro y Seguimiento Coordinación de Infraestructura y Seguridad Informática Coordinación de Normativa y Protección de la Información Dirección de Tecnología y Desarrollo Dirección de Seguridad Informática Dirección de Protección de la Información y Dirección de Normativa de la Dirección Nacional de Registros Públicos la ejecución y cumplimiento de la presente resolución. SEGUNDA.- En caso de supresión escisión o fusión el ente registral en el término de cinco (5) días informará a la Dirección Nacional de Registros Públicos qué entidad administrará sus registros públicos con la finalidad de gestionar los procedimientos para incorporar la nueva institución y mantener los datos o información en el Sistema Nacional de Registros Públicos. TERCERA.- Los responsables y encargados del tratamiento de datos personales en el marco de sus obligaciones establecidas en la Ley de la materia deberán implementar en el ámbito de sus competencias todas las medidas tecnológicas organizacionales y jurídicas para la protección de los registros públicos que custodian así como aquellas que se encuentran incorporadas al Sistema Nacional de Registros Públicos acatando las disposiciones de la Ley Orgánica de Protección de Datos Personales el Esquema Gubernamental de Seguridad de la Información de ser el caso o estándares internacionales ISO 27000 ISO 29000 o cualquier otra medida en aplicación al principio de responsabilidad proactiva. CUARTA.- Los entes registrales no podrán de forma unilateral dejar de compartir su información por el SINARP. En caso de realizarse el ente registral será responsable de todos los daños y perjuicios que provoque la suspensión. QUINTA.- Disponer a la Dirección de Comunicación Social la difusión y publicación de la presente resolución en la página web institucional. DISPOSICIONES TRANSITORIAS PRIMERA.- En el plazo de tres (3) meses contados a partir de la suscripción de la presente resolución la Dirección de Gestión y Registro revisará y actualizará el catalogo único con su descripción y el valor de respuesta de cada uno hecho lo cual remitirá el informe correspondiente a la Dirección de Protección de la Información para que en el Página 14 de 16 plazo de dos (2) meses revisen la clasificación de la información incorporada en el Sistema Nacional de Registros Públicos. De considerar pertinente la Dirección de Protección de la Información reclasificará la información de conformidad a la Constitución Ley Orgánica de Protección de Datos Ley del Sistema Nacional de Registros Públicos y su reglamento de aplicación para lo cual generará el informe con su recomendación ante la máxima autoridad de la Dirección Nacional de Registros Públicos. El catálogo único deberá ser revisado y actualizado de forma permanente de acuerdo al informe de clasificación que emita la Dirección de Protección de la Información. En caso de requerir una prórroga adicional para el cumplimiento de la presente disposición se deberá generar un informe debidamente motivado explicando las razones por las cuales se requiere una ampliación del término concedido mismo que podrá ser aprobado o rechazado por la máxima autoridad de la Dirección Nacional de Registros Públicos. SEGUNDA.- En el término de hasta tres (3) días contados a partir de la suscripción de la presente resolución la Dirección de Comunicación publicará el catalogo único en los portales con los que cuente Dirección Nacional de Registros Públicos. TERCERA.- En el plazo de tres (3) meses contados a partir de la suscripción de la presente resolución la Coordinación de Gestión Registro y Seguimiento deberá elaborar un informe respecto a las instituciones públicas y privadas que administren registros públicos que no estén incorporadas al Sistema Nacional de Registros Públicos recomendando su incorporación el cual será puesto en consideración de la máxima autoridad de la Dirección Nacional de Registros Públicos para su autorización. CUARTA: En el término de quince (15) días contados a partir de la suscripción de la presente resolución la Dirección de Planificación y a la Dirección de Gestión y Registro elaborará el instructivo y el flujo respectivo acorde a las actividades descritas en la presente resolución."}
{"input": "La disposición 0 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "DISPOSICION 0 Deróguese la Resolución No. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016. que contiene la norma que “Regula la clasificación de los datos que integran el Sistema Nacional de Registro de Datos Públicos”. "}
{"input": "La disposición 1 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "DISPOSICION 1 Deróguese la Resolución No. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 que contiene la norma que “Establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registro de Datos Públicos”. "}
{"input": "La disposición 2 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "DISPOSICION 2 Deróguese la Resolución No. 043-NG-DINARDAP-2016 de 22 de septiembre de 2016 que contiene el instructivo de “Clasificación de la Información de la Página 15 de 16 Dirección Nacional de Registro de Datos Públicos Registro de Datos Crediticios y Registros Mercantiles”. "}
{"input": "La disposición 3 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "DISPOSICION 3 Deróguese la Resolución No. 018-NG-DINARDAP-2013 de 25 de abril de 2013 que contiene la norma que: “Regula la asequibilidad a los datos personales de los registros públicos”. "}
{"input": "La disposición 4 del documento de resolución 004-NG-DINARP-2023 es: ", "output": "DISPOSICION 4 Deróguese la Resolución No. 026-NG-DINARDAP-2015 de 28 de agosto de 2015 que contiene la norma que “Reforma a la norma que regula la asequibilidad a los datos personales de los registros públicos.” La presente resolución entrará en vigencia a partir de la fecha de su suscripción sin perjuicio de su publicación en el Registro Oficial. Dado en la ciudad de Quito a los 02 del mes de junio de 2023. Daniel Augusto Arboleda Villacreces DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Aprobado: Revisado: Elaborado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Ab. Sofía Vázquez / Directora de Normativa Ab. / Jean Jairo Cifuentes / Analista Página 16 de 16"}
