{"input": "La consideración 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 18 de la Constitución de la República del Ecuador determina: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; el numeral 19 del artículo 66 de la Constitución de la República del Ecuador prescribe: “El derecho a la protección de datos de carácter personal que incluye el acceso y la decisión sobre información y datos de este carácter así como su correspondiente protección. La recolección archivo procesamiento distribución o difusión de estos datos o información requerirán la autorización del titular o el mandato de la ley.”; el artículo 226 de la Constitución de la República del Ecuador prevé: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; el artículo 227 de la Constitución de la República del Ecuador señala: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.”; el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos crea y regula el Sistema Nacional de Registros Públicos para lo cual determina: \"La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. El objeto de la ley es: garantizar la seguridad jurídica organizar regular sistematizar e Página 1 de 18 "}
{"input": "La consideración 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que interconectar la información así como: la eficacia y eficiencia de su manejo su publicidad transparencia acceso e implementación de nuevas tecnologías.\"; el artículo 13 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: \"Son registros públicos: el Registro Civil de la Propiedad Mercantil Societario Vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios y los que en la actualidad o en el futuro determine la Dirección Nacional de Registros Públicos en el marco de lo dispuesto por la Constitución de la República y las leyes vigentes. Los registros son dependencias públicas desconcentrados con autonomía registral y administrativa en los términos de la presente ley y sujetos al control auditoría y vigilancia de la Dirección Nacional de Registros Públicos (...)\"; el artículo 14 de la Ley Orgánica del Sistema Nacional de Registros Públicos señala: \"Los registros públicos y demás oficinas que manejen información relacionada con el objeto de esta Ley administrarán sus bases de datos en coordinación con la Dirección Nacional de Registros Públicos. Sus atribuciones responsabilidades y funciones serán determinadas por la ley pertinente a cada registro y por el Reglamento a la presente ley.\"; el artículo 22 de la Ley Orgánica del Sistema Nacional de Registros Públicos indica: \"La Dirección Nacional de Registros Públicos se encargará de organizar un sistema de interconexión cruzado entre los registros público y privado que en la actualidad o en el futuro administren bases de datos públicos de acuerdo a lo establecido en esta Ley y en su Reglamento.”; el artículo 26 de la Ley Orgánica del Sistema Nacional de Registros Públicos estipula: “Toda base informática de datos debe constar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impida la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; los numerales 2 4 y 14 del artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos señalan entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: \"2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; (...) 4. Promover dictar y ejecutar a través de los diferentes registros las políticas públicas a las que se refiere esta ley así como las normas generales para el seguimiento y control de las mismas; (…) 14. Controlar y supervisar que las entidades pertenecientes al Sistema Nacional de Registros Públicos incorporen mecanismos de protección de datos personales así como dar cumplimiento a las disposiciones establecidas en la Ley Orgánica de Protección de Datos Personales su reglamento de aplicación y demás normativa que la Autoridad de Protección de Datos Personales dicte para el efecto:\"; Página 2 de 18 "}
{"input": "La consideración 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 19 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos establece: \"La entidad rectora de la simplificación de trámites tendrá a su cargo la administración del registro único de trámites administrativos el cual deberá integrarse entre otros al Sistema Nacional de Registros Públicos. La información que conste en el registro será generada por las entidades reguladas por esta Ley y consolidada en una base de datos nacional que incorpore en forma ordenada y periódica la información sobre los diferentes trámites administrativos incluida la base normativa que sustenta el trámite los requisitos que se deben cumplir el tiempo aproximado que toma la gestión del trámite el lugar en el que se lo debe realizar y cualquier otra información que sea dispuesta por la entidad rectora de la simplificación de trámites. Esta información deberá ser la misma que conste en la página web institucional de las entidades reguladas por esta Ley. (…)”; "}
{"input": "La consideración 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el numeral 2 del artículo 21 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos preceptúa: \"Sin perjuicio de lo establecido en la Ley del Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoriamente la información que reposa en: (...) 2. El Sistema Nacional de Registros Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registros Públicos y la entidad que presida el Sistema Nacional de Registros Públicos.\"; "}
{"input": "La consideración 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 1 de la Ley Orgánica De Protección de Datos Personales establece: “El objeto y finalidad de la presente ley es garantizar el ejercicio del derecho a la protección de datos personales que incluye el acceso y decisión sobre información y datos de este carácter así como su correspondiente protección. Para dicho efecto regula prevé y desarrolla principios derechos obligaciones y mecanismos de tutela.”; el artículo 40 de la Ley Orgánica de Protección de Datos Personales prevé: “Para el análisis de riesgos amenazas y vulnerabilidades el responsable y el encargado del tratamiento de los datos personales deberán utilizar una metodología que considere entre otras: 1) Las particularidades del tratamiento; 2) Las particularidades de las partes involucradas; y 3) Las categorías y el volumen de datos personales objeto de tratamiento.”; "}
{"input": "La consideración 5 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 2 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos respecto al Sistema Nacional de Registros Públicos indica: \"Está conformado por las instituciones públicas y privadas determinadas en la Ley Orgánica del Sistema Nacional de Registros Públicos y las que en el futuro Página 3 de 18 determine mediante resolución el Director Nacional de Registros Públicos en ejercicio de sus competencias.\"; "}
{"input": "La consideración 6 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 9 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos en cuanto a la Regulación y Control establece: \"Sin perjuicio de las competencias que ejercen los entes de control definidos en la Constitución de la República la Dirección Nacional de Registros Públicos es el órgano de regulación control auditoría y vigilancia de todos los integrantes del Sistema Nacional de Registros Públicos en torno a la interoperabilidad de datos. La regulación control auditoría y vigilancia comprenden todas las acciones necesarias para garantizar la disponibilidad del servicio. Las decisiones administrativas internas de cada ente registral corresponden exclusivamente a sus autoridades pero la Dirección Nacional de Registro Públicos arbitrará las medidas que sean del caso cuando perjudiquen la disponibilidad de los servicios.\"; "}
{"input": "La consideración 7 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 13 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos prevé: \"La Dirección Nacional de Registros Públicos de conformidad con la ley expedirá las normas técnicas que contengan los estándares mecanismos y herramientas para precautelar la seguridad custodia y conservación de la información accesible y confidencial. La integridad y protección de los registros de datos públicos es responsabilidad de las instituciones del sector público y privado a través de sus representantes legales y las personas naturales que directamente los administren.\"; "}
{"input": "La consideración 8 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que mediante Resolución No. 009-NG-DINARDAP-2021 de 14 de mayo del 2021 emitida por la Dirección Nacional de Registros Públicos se expidió: “La Norma que Regula el Tratamiento de Datos Personales en el Sistema Nacional de Registro de Datos Públicos.”; "}
{"input": "La consideración 9 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 1 de la Resolución No. 009-NG-DINARDAP-2021 resuelve: “Establecer criterios al tratamiento de datos personales en el Sistema Nacional de Registro de Datos Públicos.”; el artículo 8 de la Resolución No. 009-NG-DINARDAP-2021 estipula: “El tratamiento de datos personales se considerara adecuado cuando se materialicen los principios y derechos previstos en la presente Resolución a lo largo del ciclo de vida del dato para ello al menos deberán concurrir las siguientes medidas: a) Gestión del riesgo y evaluación de impacto; b) Política (sic) de protección de datos personales. c) Acuerdo de confidencialidad.”; "}
{"input": "La consideración 10 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el artículo 15 de la Resolución No. 009-NG-DINARDAP-2021 establece: “Los responsables y encargados de tratamiento son responsables sobre la integridad disponibilidad y confidencialidad de la información así como del cumplimiento de los principios y derechos contenidos en la presente resolución que son parte Página 4 de 18 del contenido esencial del derecho a la protección datos personales y en consecuencia deben ser capaces de demostrar su efectiva aplicación. Adicionalmente los responsables y encargados de tratamiento podrán implementar medidas adicionales apropiadas de cualquier naturaleza orientadas a promover el ejercicio del derecho a la protección de datos personales que no limiten la aplicación de la presente resolución y la efectivización de derechos individuales y libertades fundamentales.”; "}
{"input": "La consideración 11 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que mediante memorando Nro. DINARP-CISI-2023-0033-M de 02 de marzo de 2023 suscrito por el Coordinador de Infraestructura y Seguridad Informática remite informe técnico respecto a la elaboración de informes de excepcionalidad para la entrega de datos e información a las entidades que integran el Sistema Nacional de Registros Públicos fuera de las plataformas de interoperabilidad. "}
{"input": "La consideración 12 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que mediante memorando Nro. DINARP-DGR-2023-00-M de 24 de febrero de 2023 la Dirección de Gestión y Registro envía informe respecto a la necesidad técnica de establecer un procedimiento de entrega directa y excepcional de datos o información entre las entidades que conforman el sistema nacional de registros públicos que requieran alta frecuencia de consumo y/o descarga de grandes volúmenes de información que no son posibles mediante la consulta de datos “uno a uno” actualmente disponible como único método de la plataforma de interoperabilidad de DINARP. "}
{"input": "La consideración 13 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que mediante memorando Nro. DINARP-CGRS-2023-0153-M de 08 de mayo de 2023 la Coordinación de Gestión Registro y Seguimiento realiza un alcance al informe remitido por la Dirección de Gestión y Registro en el que concluye: “La aplicación de la Resolución No.006-NG-DINARDAP-2019 permite que las instituciones consumidoras de información realicen procesos institucionales que requieran alta frecuencia de consumo y/o descarga de grandes volúmenes de información que no son posibles mediante la consulta de datos “uno a uno” actualmente disponible como único método de la plataforma de interoperabilidad de DINARP; y que las limitaciones de la plataforma de interoperabilidad y la falta de especialistas en analítica de datos impide el almacenamiento de grandes volúmenes de información o bases completas de datos y el desarrollo de productos de analítica de datos que son de competencia de la DINARP y que son de contínua justificación por parte de las consumidoras para solicitar la excepcionalidad de consumo”; por lo cual recomienda “"}
{"input": "La consideración 14 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que la Coordinación de Normativa y Protección de la Información reforme la resolución 006 conforme las recomendaciones indicadas en el informe de la Coordinación de Infraestructura y Seguridad Informática a fin de que se realice mejoras en el procedimiento y actualización de los criterios de excepcionalidad; y que se considere el tiempo de autorización sea de 1 año.”; Página 5 de 18 "}
{"input": "La consideración 15 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que mediante memorando No. DINARP-CISI-2023-0073-M de 10 de mayo de 2023 suscrito por el Coordinador de Infraestructura y Seguridad Informática remite alcance al memorando No. DINARP-CISI-2023-0033-M cuyo informe técnico actualizado recomienda: “Se recomienda autorizar entregas directas siempre que concurran dos o más de los siguientes criterios: 1. Alta frecuencia de actualización de datos por parte de la Entidad Fuente de la información: Es el proceso de actualización que realizan las entidades fuentes al generar recopilar o respaldar y poner en disponibilidad los datos para el respectivo consumo; y está determinada por la capacidad máxima de transaccionalidad que el bus de datos de la DINARP puede soportar; 2. Eficiencia tecnológica demostrable: se refiere a las tecnologías que usan emisor y receptor superiores a las tecnologías con las que cuenta la DINARP para el intercambio de datos; 3. Analítica de Datos: Es el proceso de descubrir interpretar y transmitir patrones importantes presentes en grandes volúmenes de datos. Provenientes de una entidad fuente para la generación de manera sencilla que nos permita ver estadísticas y datos importantes así como para establecer tendencias y tomar decisiones más informadas que ayuden a las instituciones o empresas a mejorar las ventas reducir los costos.; y 4. Obsolescencia de los recursos tecnológicos del sistema de interoperabilidad que impidan la implementación de servicios web en el Sistema Nacional de Registros Públicos. Se recomienda incorporar para la toma de decisiones de excepcionalidad la generación de un informe tecnológico en el cual se validen los siguientes puntos: 1. "}
{"input": "La consideración 16 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que las razones expuestas en las especificaciones técnicas estén acordes a los criterios de excepción; 2. El cumplimiento de los protocolos de seguridad; 3. La frecuencia de actualización; 4. El tiempo solicitado; 5. Tiempo de conservación; 6. Método de consumo; y 7. "}
{"input": "La consideración 17 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que el análisis de riesgo y evaluación de impacto cumplan con las especificaciones técnicas.”; y "}
{"input": "La consideración 18 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "Que con Acuerdo Ministerial Nro. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 el Ab. Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información Subrogante resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional a partir del 7 de abril de 2023 quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable(…)”. En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registro Públicos y su Reglamento de aplicación."}
{"input": "La resolución 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULOESTABLECER EL PROCEDIMIENTO DE ENTREGA DIRECTA Y EXCEPCIONAL DE DATOS O INFORMACIÓN ENTRE LAS ENTIDADES QUE CONFORMAN EL SISTEMA NACIONAL DE REGISTROS PÚBLICOS Página 6 de 18 CAPÍTULO I GENERALES "}
{"input": "La resolución 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO1. Objeto.- Establecer el procedimiento de entrega directa y excepcional de datos e información que por supuestos técnicos debidamente justificadas observarán las instituciones públicas o privadas cuando intercambien datos o información. "}
{"input": "La resolución 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO2. Ámbito de aplicación.- La presente resolución será de obligatorio cumplimiento y aplicación para las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos y que requieren de manera excepcional el intercambio directo de datos e información. "}
{"input": "La resolución 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO3. Glosario de términos.- Para efectos de aplicación de la presente norma los términos señalados a continuación tendrán los siguientes significados: ACID: Es el conjunto de propiedades que garantizan que las transacciones de una base de datos se procesan de manera fiable sus siglas respondan a los conceptos de atomicidad consistencia aislamiento y durabilidad. Alta frecuencia de actualización: Es el proceso de actualización que realizan las entidades fuentes al generar recopilar o respaldar y poner en disponibilidad los datos para el respectivo consumo; y está determinada por la capacidad máxima de transaccionalidad que el bus de datos de la DINARP puede soportar. Analítica de datos: Es el proceso de descubrir interpretar y transmitir patrones importantes presentes en grandes volúmenes de datos. Provenientes de una entidad fuente para la generación de manera sencilla que nos permita ver estadísticas y datos importantes así como para establecer tendencias y tomar decisiones más informadas que ayuden a las instituciones o empresas a mejorar las ventas reducir los costos Base(s) de dato(s): Conjunto estructurado de datos cualquiera que fuera la forma modalidad de creación almacenamiento organización tipo de soporte tratamiento procesamiento localización o acceso centralizado descentralizado o repartido de forma funcional o geográfica. Campo(s) de dato(s): Categoría o nomenclatura de la unidad que recopila datos o información sea esta de carácter accesible o confidencial que forma parte de un conjunto de datos o base de datos proveídos por las fuentes de información que integran el Sistema Nacional de Registros Públicos. Catálogo de campos de datos: Listado de campos de datos o información constante en bases de datos declarados como Registros Públicos de las entidades que forman parte del Sistema Nacional de Registros Públicos. Página 7 de 18 Cifrado de datos: El cifrado de datos como método para transformarlos y mantenerlos en secreto se deberá implementar únicamente para el intercambio de información a través de entregas directas y excepcionales de naturaleza de enlaces punto a punto protocolos SFTP el uso de dispositivos externos o extraíbles entre otros similares. Datos: Características variables atributos descripciones o representaciones simbólicas cuantitativas o cualitativas. Dato personal: Dato que identifica o hace identificable a una persona natural directa o indirectamente. Eficiencia tecnológica demostrable: Se refiere a las tecnologías que usan emisor y receptor superiores a las tecnologías con las que cuenta la Dirección Nacional de Registros Públicos para el intercambio de datos. Encargado del tratamiento de datos personales: Persona natural o jurídica pública o privada autoridad pública u otro organismo que solo o conjuntamente con otros trate datos personales a nombre y por cuenta de un responsable de tratamiento de datos personales. Entregas directas: Las entregas directas de datos e información obedecen a circunstancias excepcionales de orden técnico que dificultan el consumo de información a través de la plataforma de interoperabilidad de la Dirección Nacional de Registros Públicos. Se considera como tipos de entregas directas entre otras: los enlaces que permiten las conexiones punto a punto las vistas de bases de datos protocolos SFTP informática en la nube sitios que contienen reportes o acceso a réplica de bases de datos y servidores de frontera que almacenan bases de datos que permite la entrega o consumo de información y datos. ESB: “Bus de servicios empresariales” es un modelo arquitectónico de software mediante el cual un componente realiza integraciones entre aplicaciones. Fuentes de información: Son todas las entidades que provean acceso a vistas materializadas y/o servicios web a bases de datos que forman parte y se encuentran integradas al catálogo de interoperabilidad como Registros Públicos que en la actualidad o en el futuro formen parte del Sistema Nacional de Registros Públicos. Fuse ESB: Plataforma de integración de código abierto distribuida que proporciona una metodología infraestructura y herramientas estandarizadas para integrar servicios microservicios y componentes de aplicación. Página 8 de 18 Grandes volúmenes de datos: Determinado por la capacidad máxima del número de transacciones soportadas dentro de infraestructura del bus de datos de interoperabilidad. la Información: Conjunto de datos. Institución consumidora: Son las instituciones que acceden a los datos e información mediante mecanismos tecnológicos de consumo controlado y auditado. Legitimación de acceso: Constituye la justificación jurídica que evidencia el cumplimiento de las condiciones para que el tratamiento de datos personales sea lícito. Método de consumo: Mecanismos tecnológicos que se utilizan para el intercambio de información entre entidades. Obsolescencia de recursos tecnológicos: Caída en desuso de algunos productos motivada por la falta de funcionalidad en comparación con las nuevas tecnologías incluidas en el mercado. Punto a punto: Entrega y consumo directo de datos e información entre dos instituciones. Responsables del tratamiento de datos personales: Persona natural o jurídica pública o privada autoridad pública u otro organismo que solo o conjuntamente con otros decide sobre la finalidad y el tratamiento de datos personales. REST: La transferencia de Estado Representacional (Representational State Transfer) o REST es un estilo de arquitectura de software para sistemas hipermedia distribuidos como World Wide Web. SFTP (Secure File Transfer Protocol-Protocolo Seguro de Transferencia de Archivos): Es un mecanismo tecnológico que emplea un protocolo de trasferencia de archivos mediante el uso de credenciales de accesos como usuario y contraseña usando una encriptación generada por algoritmos para mover la información de forma segura a su servidor manteniendo los archivos ilegibles durante el proceso además la autenticación evita el acceso no autorizado a los archivos durante la operación. SOAP: Originalmente las siglas de Simple Object Access Protocol es un protocolo estándar que define cómo dos objetos en diferentes procesos pueden comunicarse por medio de intercambio de datos XML. "}
{"input": "La resolución 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO4. Temporalidad de la autorización.- La entrega directa de datos e información por supuestos de excepcionalidad se realizará por el plazo máximo de un (1) año el cual Página 9 de 18 estará condicionado a la mejora de los canales u otros componentes tecnológicos por parte del ente registral y la Dirección Nacional de Registros Públicos. La Dirección Nacional de Registros Públicos autorizará y fijará el tiempo de acuerdo a los resultados constantes en el análisis técnico y tecnológico. La autorización de consumo directo podrá ser renovada por una sola vez por igual tiempo cuando la entidad consumidora previa justificación técnica y tecnológica demuestre avances y mejoras ejecutadas en todos los procedimientos para interconectarse a través del Sistema Nacional de Registros Públicos; y cuando no sea posible o requiera de mayor tiempo para el desarrollo de los componentes tecnológicos hasta su culminación. Las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos que soliciten la entrega directa de datos e información por cualquiera de los supuestos de excepcionalidad señalados en la presente resolución deberán demostrar de manera indubitada la imposibilidad de acceder al Sistema Nacional de Registros Públicos a través del procedimiento general para “Acceso a los Datos o Información que Integra el Sistema Nacional de Registros Públicos” para lo cual deberán contar con el informe de la Coordinación de Infraestructura y Seguridad de la Información el que deberá establecer los criterios técnicos y tecnológicos que lo imposibilitan. "}
{"input": "La resolución 5 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO5. Responsabilidad.- Las entidades públicas o privadas que integran el Sistema Nacional de Registros Públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones fuente responderán por la veracidad autenticidad custodia y debida conservación de los registros. La responsabilidad sobre la veracidad y autenticidad de la información proporcionada por los administrados en la gestión de trámites administrativos es de su exclusiva responsabilidad. Es obligación del responsable o encargado del tratamiento de datos implementar en el ámbito de sus competencias todas las medidas tecnológicas organizacionales y jurídicas para la protección de las bases de datos que custodian acatando las disposiciones de la Ley Orgánica de Protección de Datos Personales el Esquema Gubernamental de Seguridad de la Información de ser el caso estándares internacionales ISO 27000 ISO 29000 o cualquier otra medida en aplicación al principio de responsabilidad proactiva. Artículo 6. De la obligación de incorporación.- Los consumos autorizados y regulados de acuerdo a la presente resolución conllevan la obligatoriedad a la entidad fuente de cumplir el procedimiento de incorporación de los datos o información en el Sistema Nacional de Registros Públicos para que todas las bases de datos interoperen entre sí. Página 10 de 18 "}
{"input": "La resolución 6 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO7. De la finalidad del uso del dato.- Las finalidades de uso del tratamiento del dato deberán ser determinadas explícitas y legítimas en consecuencia no podrán tratarse los datos con fines distintos para los cuales fueron recopilados. "}
{"input": "La resolución 7 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO8. De la evaluación del impacto.- El responsable del tratamiento de datos realizará la valoración referente al impacto que involucra un tratamiento relevante de datos personales para gestionar los posibles riesgos a los derechos y libertades de su titular; y de manera obligatoria en los casos determinados en la Ley Orgánica de Protección de Datos Personales así como en aquellos datos en los que la Autoridad de Protección de Datos Personales lo requiera. "}
{"input": "La resolución 8 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO9. Protocolos de intercambio directo de datos.- La entidad fuente y la entidad consumidora deberán cumplir de forma concurrente con los siguientes protocolos: a) Seguridad de la información.- Las instituciones de la Administración Pública Central justificarán la implementación o actualización del Esquema Gubernamental de Seguridad de la Información (EGSI). En la solicitud se adjuntará la declaración y documentación de respaldo de la implementación de las medidas de seguridad tecnológicas a adoptarse y la documentación de respaldo así como para mitigar los riesgos identificados o aquellos que podrían afectar los activos de datos e información en los ámbitos técnico y organizacional durante el procedimiento de intercambio y tratamiento de datos. Las demás entidades públicas y privadas obligatoriamente tendrán que generar o contar con políticas de seguridad de la información institucional mantener evidenciables de la trazabilidad de la información que se consume y la suscripción de acuerdos de confidencialidad. b) Protección de datos personales.- La entidad consumidora tendrá implementadas todas las medidas técnicas y organizativas que establece la Ley Orgánica de Protección de Datos Personales su Reglamento de aplicación y demás normativa que para el efecto emita la Autoridad de Protección de Datos Personales. En la solicitud se detallará y describirá: las finalidades del tratamiento de datos la legitimación de acceso el tiempo que requiere el acceso y el tiempo de conservación de los datos los efectos funcionales y jurídicos del tratamiento de la información y las medidas de seguridad de datos personales implementadas en la institución de conformidad con la Ley Orgánica de Protección de Datos Personales y las que establezca por resolución la Dirección Nacional de Registros Públicos. La política de protección de datos personales que se relacione con el tratamiento estará a disposición de forma accesible y permanente para que el titular del dato lo conozca. Los responsables y encargados del tratamiento de datos personales deberán implementar todos los mecanismos de protección que permitan evidenciar el cumplimiento de los Página 11 de 18 principios derechos y obligaciones que contempla la Ley Orgánica de Protección de Datos Personales así como acogerse a estándares de mejores prácticas esquemas de autorregulación códigos de certificación sellos de certificación y cualquier otro mecanismo que sea necesario para los fines del tratamiento de datos personales la naturaleza de los datos a tratar y la mitigación de cualquier riesgo. c) Seguridad informática.- En cuanto al alcance y definición de la misma se deberá cumplir con los preceptos tecnológicos que garanticen la disponibilidad confidencialidad e integridad de la información digital. Además aparejar una carta compromiso respecto al cumplimiento de las medidas de seguridad tecnológica a adoptarse conforme al o los mecanismos que se empleará para el intercambio de datos e información considerando los siguientes aspectos: 1. Aseguramiento del canal de trasmisión mediante el empleo de redes privadas virtuales o en su efecto hacer uso del enlace de datos de la red nacional gubernamental; 2. Autenticación mediante el empleo de usuarios y contraseñas para acceder a la información; 3. Compresión de datos como método para transformarlos y reducir su tamaño; 4. Cifrado de datos como método para transformarlos y mantenerlos en secreto; y; 5. Anonimización. La verificación y cumplimiento de los protocolos estará a cargo de la Dirección de Seguridad Informática o quién haga sus veces. La verificación y cumplimiento de los protocolos constantes en el literal a) y c) estarán a cargo de la Coordinación de Infraestructura y Seguridad Informática a través de la Dirección de Seguridad Informática o quién haga sus veces. La Dirección de Protección de la Información en los controles verificará el cumplimiento de lo dispuesto en el literal b). "}
{"input": "La resolución 9 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO10. Análisis de riesgo y evaluación de impacto.- Los responsables y encargados del tratamiento de datos personales de la entidad fuente y entidad consumidora analizarán y evaluarán el riesgo y evaluación de impacto cuando se trate de datos personales y describirán las medidas herramientas mecanismos y configuraciones técnicos tecnológicos y jurídicos que se deberán implementar a lo largo del ciclo de vida de los datos. Para la elaboración del informe de riesgo y evaluación de impacto se estará a lo prescrito en la Ley Orgánica de Protección de Datos Personales su Reglamento de aplicación y demás normativa que para el efecto: emita la Autoridad de Protección de Datos Personales y la Dirección Nacional de Registros Públicos. CAPÍTULO II DE LAS ENTREGAS DIRECTAS POR EXCEPCIÓN Página 12 de 18 "}
{"input": "La resolución 10 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO11. Supuestos de excepción.- Se podrá autorizar entrega directa siempre que concurran dos o más de los siguientes supuestos: 1. Alta frecuencia de actualización; 2. Eficiencia tecnológica demostrable; 3. Analítica de datos como finalidad o generación de información estadística; 4. Obsolescencia de recursos tecnológicos demostrada en las entidades fuente consumidora o de la Dirección Nacional de Registros Públicos; y 5. En caso de presentarse una declaratoria de estado excepción decretado por el Presidente o Presidenta de la República las instituciones señaladas en dicho documento podrán presentar la necesidad de acreditar otro supuesto de excepcionalidad; sin embargo se concederá la entrega directa únicamente por el tiempo que dure la declaratoria de estado de excepción. la solicitud sin CAPÍTULO III PROCEDIMIENTO PARA ENTREGAS DIRECTAS "}
{"input": "La resolución 11 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO12. Solicitud de consumo.- La máxima autoridad de la entidad consumidora o su delegado por encontrarse inmerso en alguno de los supuestos de excepción previstos en el artículo 11 de la presente resolución solicitará a la máxima autoridad de la Dirección Nacional de Registros Públicos que le confiera la autorización para realizar el consumo directo de datos e información para lo cual acompañará y justificará lo siguiente: 1. Identificación de la entidad fuente; 2. La finalidad del tratamiento del dato; 3. Datos a los que desea acceder con la descripción y la categoría del dato; 4. Legitimación de acceso que contiene la motivación jurídica para el tratamiento de datos; conforme lo previsto en la Ley Orgánica de Protección de Datos Personales; 5. Justificación técnica y tecnológica que dificulte consumir datos a través de la plataforma de interoperabilidad de la Dirección Nacional de Registros Públicos; 6. Informe de cumplimiento de los protocolos de seguridad acorde a la presente resolución; 7. Temporalidad solicitada; 8. Tiempo de conservación de los datos y mecanismo para destrucción anonimización etc; 9. Estructura de la base de consulta; 10. Acta de trabajo entre entidad consumidora y entidad fuente para determinar los supuestos de excepcionalidad que justifican la entrega directa la que contendrá los acuerdos para llevar a cabo el consumo de información así como el tiempo acordado el cual no podrá superar el plazo de un año; y Página 13 de 18 11. El acuerdo de uso y confidencialidad por parte de aquellos servidores públicos involucrados en la entrega y tratamiento de información. "}
{"input": "La resolución 12 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO13. Calificación de la solicitud.- La Coordinación de Gestión Registro y Seguimiento dentro del término de tres (3) días verificará el cumplimiento de los requisitos establecidos en los artículos 11 y 12 de la presente resolución. En caso de verificarse el incumplimiento de alguno de los requisitos la Coordinación de Gestión Registro y Seguimiento notificará a la entidad consumidora las razones por las cuales no se admite a trámite y concederá el término de cinco (5) días para que lo complete aclare o adjunte la información requerida de no hacerlo o persistir la inexactitud en el cumplimiento de lo solicitado se considerará como no presentada se ordenará el archivo de la solicitud y la devolución de los documentos adjuntos a ella sin necesidad de dejar copias. De permanecer la necesidad de acceder a los datos e información a través de la modalidad de entrega directa por la persistencia de los supuestos de excepción la entidad solicitante podrá presentar nuevamente la solicitud conforme a los requisitos señalados en el artículo 12 de la presente resolución. Admitida la solicitud por la Coordinación de Gestión Registro y Seguimiento remitirá el trámite inicialmente a la Coordinación de Infraestructura y Seguridad Informática para que emita el informe correspondiente con su pronunciamiento favorable se enviará el trámite a la Coordinación de Normativa y Protección de la Información para que elabore su informe. Las mentadas unidades administrativas de acuerdo a sus atribuciones y competencias dentro de los términos que establece la presente resolución analizarán evaluarán y verificarán el cumplimiento técnico tecnológico seguridades y viabilidad jurídica respectivamente. Informes que serán vinculantes en la aprobación o en el rechazo de la solicitud de autorización de entrega directa de datos e información. "}
{"input": "La resolución 13 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO14. Informe tecnológico.- La Coordinación de Infraestructura y Seguridad Informática dentro del término de cuatro (4) días analizará verificará y contrastará lo siguiente: 1. Que las razones expuestas en la especificación técnica y tecnológica estén acordes a los supuestos de excepcionalidad; 2. El cumplimiento de los protocolos de seguridad; 3. La frecuencia de actualización; 4. El tiempo solicitado; 5. Tiempo de conservación; 6. Método de consumo; y 7. Que el análisis de riesgo y evaluación de impacto cumplan con las especificaciones técnicas. Página 14 de 18 "}
{"input": "La resolución 14 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO15. Informe de Protección de la información.- La Coordinación de Normativa y Protección de la Información a través de la Dirección de Protección de la Información en un término no mayor a cuatro (4) días revisará analizará e informará que los datos e información solicitada a través de la modalidad de entrega directa y excepcional es procedente de acuerdo a lo dispuesto por la Ley Orgánica de Protección de Datos Personales y normas conexas. "}
{"input": "La resolución 15 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO16. Gestión de objeto de la solicitud.- La Coordinación de Gestión Registro y Seguimiento acogerá las conclusiones y recomendaciones de las unidades administrativas a quiénes solicitó su pronunciamiento; y en el término máximo de tres (3) días elaborará el informe final en el que además recomendará el tiempo que se podrá autorizar al solicitante respecto de la entrega directa de datos e información entre la entidad consumidora y entidad fuente. Éste informe será puesto en conocimiento de la máxima autoridad de la Dirección Nacional de Registros Públicos para su aprobación y suscripción y su posterior notificación a la entidad solicitante. La máxima autoridad de la Dirección Nacional de Registros Públicos resolverá y autorizará a la entidad fuente y entidad consumidora iniciar el intercambio de información de forma directa una vez que se haya verificado el cumplimiento de los supuestos de excepcionalidad aspectos la información acorde a lo estipulado en la presente resolución y normativa conexa. técnicos seguridades protección de "}
{"input": "La resolución 16 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO17. Renovación de la autorización.- La entidad pública o privada que cuente con una autorización de entrega directa y excepcional de datos o información podrá solicitar la renovación de la autorización por una sola vez para lo cual deberá presentar una solicitud que deberá contener el avance por etapas en los procedimientos tecnológicos a incorporarse para interoperar de acuerdo con los plazos fijados y las variables o condiciones propias para cada institución. "}
{"input": "La resolución 17 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "ARTICULO18. Control.- La Dirección de Control y Evaluación en articulación con el equipo de trabajo señalado en las resoluciones que emite la Dirección Nacional de Registros Públicos efectuarán el control auditoría y vigilancia del cumplimiento de la presente resolución. El intercambio de información a través de la modalidad de entrega directa por excepción estará sujeta a los procesos de control por parte de la Dirección Nacional de Registros Públicos quién verificará las condiciones el tiempo autorizado y el cumplimiento de lo establecido en la presente resolución. En los controles además verificará el cumplimiento de los lineamientos para el tratamiento y protección de datos personales que establece la Ley Orgánica de Protección de Datos Personales y normativa conexa. Sí el informe de control determina alguno de los siguientes hallazgos: mal uso del dato la falta de protección a los datos incumplimiento de alguna de las disposiciones de la Página 15 de 18 presente resolución desaparezcan los supuestos de excepcionalidad que motivaron la autorización o no se evidenciaren los avances o mejoras técnicas o tecnológicas en el tiempo concedido en la autorización será causal suficiente para ordenar motivadamente la suspensión de la autorización de entrega directa de datos. Será responsabilidad de la entidad consumidora la afectación en la prestación de los servicios públicos que son de su competencia. La Dirección Nacional de Registros Públicos notificará de la suspensión de entrega directa a la entidad que provee la información quién tendrá la obligación de suspender desde la fecha de recepción de la notificación caso contrario serán responsables y se sujetarán a las sanciones previstas en la ley así como serán solidariamente responsables en el tratamiento y protección de datos. DISPOSICIONES GENERALES PRIMERA.- Disponer a la Coordinación de Infraestructura y Seguridad Informática Coordinación de Gestión Registro y Seguimiento; y Coordinación de Normativa y Protección de la Información la ejecución y cumplimiento de la presente resolución. SEGUNDA. - La presente resolución no es aplicable para transferencias internacionales de datos personales. TERCERA.- El análisis del riesgo y la evaluación de impacto estará sujeto a los lineamientos y parámetros que para el efecto emita la Autoridad de Protección de Datos Personales una vez que dicho organismo entre en funcionamiento sin embargo hasta su posesión se ejecutarán considerando las definiciones establecidas en las normas ISO 27000 y 29000; así como las estipuladas en el EGSI y demás normas que establezca la Dirección Nacional de Registros Públicos. CUARTA.- Disponer a la Dirección de Comunicación Social la difusión publicación de la presente Resolución en la página web institucional y notificación a la Dirección de Asesoría Jurídica para el registro correspondiente. QUINTA.- La institución consumidora tiene la obligación de suscribir el acuerdo de uso y confidencialidad por parte de aquellas personas que estarán involucradas en el acceso al tratamiento de datos e información."}
{"input": "La disposición 0 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "DISPOSICION 0- En el plazo máximo de seis (6) meses contados desde la entrada en vigencia de esta resolución la Coordinación de Gestión Registro y Seguimiento; y la Dirección de Protección de la Información realizarán el control y evaluación a las entidades consumidoras de datos de forma directa por excepción autorizadas con anterioridad a la Página 16 de 18 vigencia de la presente resolución; y emitirán un informe respecto de los hallazgos encontrados así como las recomendaciones que serán puestas en conocimiento de la máxima autoridad. Para el efecto en el término máximo de treinta (30) días contados desde la suscripción de la presente resolución deberá presentar un cronograma a la máxima autoridad para su aprobación. "}
{"input": "La disposición 1 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "DISPOSICION 1- En el término de quince (15) días contados desde la entrada en vigencia de esta resolución la Dirección de Planificación elaborará el procedimiento y su flujo respectivo acorde a las actividades descritas en la presente resolución para la autorización de entrega directa de datos e información por excepción. "}
{"input": "La disposición 2 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "DISPOSICION 2- En el término de tres (3) días contados desde la entrada en vigencia de esta resolución la Coordinación de Gestión Registro y Seguimiento elaborará un formato único de autorización de entrega directa de datos o información. Una vez culminado el término la Dirección de Comunicación lo incorporará en el apartado que contiene la página web institucional para libre acceso de los usuarios. DISPOSICIÓN DEROGATORIA Ú"}
{"input": "La disposición 3 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "DISPOSICION 3- Deróguese la Resolución Nro. 006-NG-DINARDAP-2019 de 28 de octubre de 2019 contentiva de la Norma que Regula el Consumo Masivo y Entregas Directas Excepcionales de Datos e Información de las Entidades que Conforman el "}
{"input": "La disposición 4 del documento de resolución 003-NG-DINARP-2023 es: ", "output": "DISPOSICION 4 La presente resolución entrará en vigencia a partir de la fecha de su suscripción sin perjuicio de su publicación en el Registro Oficial. Dado en la ciudad de Quito a los 12 días del mes de mayo de 2023. Abg. Daniel Augusto Arboleda Villacreses DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Página 17 de 18 Aprobado: Revisado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Ab. Sofía Vázquez Izurieta / Directora de Normativa Elaborado: Ab. / Jean Jairo Cifuentes / Analista Página 18 de 18"}
