{"input": "La consideración 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; el artículo 227 de la Constitución de la República del Ecuador al referirse a los principios que rigen a la administración pública dispone: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia eficiencia calidad jerarquía desconcentración descentralización coordinación participación planificación transparencia y evaluación.\"; el artículo 2 de la Ley Orgánica de Transparencia y Acceso a la Información Pública determina que” La presente Ley tiene por finalidad proteger respetar promover y garantizar que la información pública sea accesible oportuna completa y fidedigna para el ejercicio de los derechos ciudadanos contemplados en la Constitución de la República del Ecuador y la ley.”; en el Tercer Suplemento del Registro Oficial No. 245 de 7 de febrero de 2023 se promulgó la Ley Orgánica para la Transformación Digital y Audiovisual la que en su parte pertinente en los artículos 83 84 85 y 86 reforma la Ley de Registro; el artículo 83 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro manifiesta: “Agréguese a continuación del literal g) del artículo 11 el siguiente: h) Desarrollar e implementar los sistemas informáticos que permitan la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el Registro para lo cual deberá tomar en cuenta las características y condiciones que para dicha finalidad Página 1 de 16 emita la Dirección Nacional de Registros Públicos (DINARP) como ente rector de la actividad registral. El sistema informático permitirá y promoverá la interconexión progresiva entre los distintos registros de la propiedad del país que permita el acceso y consulta de los ciudadanos desde distintas jurisdicciones a una base de datos integrada y se acompañará con un plan progresivo de digitalización para los cantones que no cuenten con los registros certificados inventarios negocios jurídicos y demás actos o constancias digitalizadas. Serán los Gobiernos Autónomos Descentralizados Municipales quienes deberán asignar los fondos necesarios para llevar a cabo este proceso en aquellos registros que no tengan autonomía financiera y administrativa.”; "}
{"input": "La consideración 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 84 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro prevé “Sustitúyase el literal c) del artículo 11 el siguiente artículo: (…) Los libros a cargo del Registrador podrán llevarse de forma electrónica y automatizada siempre que garanticen la seguridad jurídica publicidad y la legalidad de los derechos constituidos en los actos contratos y negocios jurídicos de las personas. Las bases de datos y los sistemas informáticos implementados estarán sujetos al control y auditoría del ente rector de la actividad registral. Los registros digitales que se generen como consecuencia de la transformación a la que se refiere este literal así como todos los registros digitales que existan al momento o que se generen en el futuro deberán contar con todas las medidas de ciberseguridad necesarias para garantizar la seguridad de la información que reposa en ellos así como su confidencialidad integridad y disponibilidad incluyendo las garantías de protección de datos personales (…).”; "}
{"input": "La consideración 2 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 85 de la Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro dispone: “Agréguese en el artículo 18 el siguiente texto: “El Libro Repertorio podrá llevarse de forma electrónica en aquellos Registros que implemente un proceso de digitalización y automatización de los trámites registrales a su cargo. Para lo cual el proceso electrónico de registro en este Libro debe llevarse con sujeción al presente artículo.””; "}
{"input": "La consideración 3 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 86 de Ley de Transformación Digital y Audiovisual que reforma la Ley de Registro señala “Agréguese a continuación del artículo 24 en el TÍTULO V el siguiente artículo innumerado: “Art. (…).- Los registros de las inscripciones y el libro de índice general podrán llevarse de forma electrónica para lo cual se tomarán en consideración y serán adaptados todos los procedimientos contemplados en la presente Ley para los registros físicos de los documentos.””; "}
{"input": "La consideración 4 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos prescribe: “La presente Ley rige para las instituciones del sector público y privado Página 2 de 16 "}
{"input": "La consideración 5 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que que actualmente o en el futuro administren bases o registros de datos públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; el artículo 22 de la Ley Orgánica del Sistema Nacional de Registros Públicos indica: \"La Dirección Nacional de Registros Públicos se encargará de organizar un sistema de interconexión cruzado entre los registros público y privado que en la actualidad o en el futuro administren bases de datos públicos de acuerdo con lo establecido en esta Ley y en su Reglamento.”; el artículo 23 de la Ley Orgánica del Sistema Nacional de Registros Públicos expone: “El sistema informático tiene como objetivo la tecnificación y modernización de los registros empleando tecnologías de información bases de datos y lenguajes informáticos estandarizados protocolos de intercambio de datos seguros que permitan un manejo de la información adecuado que reciba capture archive codifique proteja intercambie reproduzca verifique certifique o procese de manera tecnológica la información de los datos registrados (…)”; el artículo 25 de la Ley ibídem determina: “Para efectos de la sistematización e interconexión del registro de datos y sin perjuicio de la obligación de mantener la información en soporte físico como determinan las diferentes normas de registro los distintos registros deberán transferir la información a formato digitalizado. La Dirección Nacional de Registros Públicos definirá el sistema informático para el manejo y administración de registros y bases de datos el cual regirá en todos los registros del país.”; el artículo 26 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Toda base informática de datos debe contar con su respectivo archivo de respaldo cumplir con los estándares técnicos y plan de contingencia que impidan la caída del sistema robo de datos modificación o cualquier otra circunstancia que pueda afectar la información pública.”; el artículo 28 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: \"Créase el Sistema Nacional de Registros Públicos con la finalidad de proteger los derechos constituidos los que se constituyan modifiquen extingan y publiciten por efectos de la inscripción de los hechos actos y/o contratos determinados por la presente Ley y las leyes y normas de registros; y con el objeto de coordinar el intercambio de información de los registros de datos públicos. En caso de que entidades privadas posean información que por su naturaleza sea pública serán incorporadas a este sistema […].\"; "}
{"input": "La consideración 6 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 29 de Ley Orgánica del Sistema Nacional de Registros Públicos señala “El Sistema Nacional de Registros Públicos estará conformado por los registros: Página 3 de 16 civil de la propiedad mercantil societario datos de conectividad electrónica vehicular de naves y aeronaves patentes de propiedad intelectual registros de datos crediticios y todos los registros de datos de las instituciones públicas y privadas que mantuvieren y administren por disposición legal información registral de carácter público. Será presidido por la Directora o Director Nacional de Registros Públicos con las facultades que se determinan en la presente Ley y su respectivo reglamento.”; "}
{"input": "La consideración 7 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 31 de Ley Orgánica del Sistema Nacional de Registros Públicos puntualiza entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: \"[…] 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; […]5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca”; la Disposición Transitoria Sexta de la norma ut supra señala “En el plazo máximo de 3 años contados a partir de la fecha de entrada en vigencia de la presente ley todo registro de la propiedad societario mercantil o civil que hasta la fecha mantenga su información y registros de manera física deberá ser transformado a formato digital con las características y condiciones definidas por el Director Nacional para lo cual se asignarán los fondos pertinentes y se proveerán los programas informáticos necesarios. Esta omisión será sancionada con la destitución del correspondiente funcionario por la Directora o Director Nacional de Registros Públicos.”; "}
{"input": "La consideración 8 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que el artículo 15 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La Dirección Nacional de Registro de Datos Públicos estandarizará y administrará la información de las fuentes propias y externas para lo cual todos los integrantes del sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea para proyectos y servicios de información”; "}
{"input": "La consideración 9 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que mediante Resolución No. 020-NG-DINARDAP-2013 de 04 de junio de 2013 la Dirección Nacional de Registros Públicos expidió la “Norma de Digitalización de Documentos”. "}
{"input": "La consideración 10 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que a través de Memorando Nro. DINARP-CNPI-2023-0081-M de 1 de junio de 2023 la Coordinación de Normativa y Protección de la Información envió el proyecto de resolución a la Coordinación de Infraestructura y Seguridad Informática a fin de que remitan sus observaciones en el ámbito técnico y tecnológico; Página 4 de 16 "}
{"input": "La consideración 11 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que mediante Memorando Nro. DINARP-CISI-2023-0097-M de 20 junio de 2023 la Coordinación de Infraestructura y Seguridad Informática remite informe técnico en el que concluye y recomienda: “Se concluye que las condiciones técnicas descritas sean los requisitos mínimos que deberán ser contemplados por los Registros para que puedan contar con un proceso de digitalización eficiente y eficaz. ·En cuanto a seguridad de la información se deberá contemplar los requisitos mínimos contemplados en el apartado «Condiciones Adicionales» para que no exista inconvenientes. ·Se recomienda a los Registros evaluar mediante un check list las condiciones que se proponen para el efecto ver Anexo I. ·A la máxima autoridad acoger estos lineamientos de manera que sean aplicados a los Registros a través del instrumento que corresponda. ·Como punto de partida para el acceso a la información desde diferentes jurisdicciones se deberá analizar la implementación de un sistema visualizador el mismo que debe manejar parámetros de búsqueda homologados entre las diferentes instituciones registrales que a su vez permitan obtener tanto la metadata como posteriormente el documento digitalizado.”; "}
{"input": "La consideración 12 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "Que a través de Memorando Nro. DINARP-CNPI-2023-0100-M de 20 de junio de 2023 la Coordinación de Normativa y Protección concluye y recomienda: “Finalmente pongo en su conocimiento el proyecto de resolución de la mentada resolución para su revisión y posterior suscripción en virtud de las recomendaciones de los informes adjuntos y del análisis de esta unidad por lo que recomiendo su aprobación”; a través de los resultados obtenidos por medio del formulario remitido durante la plenaria dos del evento “Foro Nacional de Registros - Primera edición” realizado los días 20 y 21 de julio de 2023 se determinó el tiempo prudente para la transformación digital de los registros y la priorización al momento de digitalizar. en ejercicio de las facultades dispuestas en la Ley de Transformación Digital y Audiovisual es necesario establecer las características y condiciones que deben cumplir los sistemas informáticos que permitan la transformación a formato digital de todos los registros; y con Acuerdo Ministerial Nro. MINTEL-MINTEL-2023-0004 de 06 de abril del 2023 el doctor Diego Ocampo Lascano Ministro de Telecomunicaciones y de la Sociedad de la Información resuelve: “(…) Encargar al abogado Daniel Augusto Arboleda Villacreces Director de Asesoría Jurídica de la Dirección Nacional de Registros Públicos el cargo de Director Nacional quién ejercerá las competencias y atribuciones previstas en la Ley Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable (…).”. Página 5 de 16 En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación."}
{"input": "La resolución 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULOEMITIR LOS LINEAMIENTOS PARA LA IMPLEMENTACIÓN DE LOS SISTEMAS INFORMÁTICOS PARA LA TRANSFORMACIÓN DIGITAL DE LOS REGISTROS CAPÍTULO I GENERALIDADES "}
{"input": "La resolución 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO1. Objeto. – La presente norma tiene por objeto dar a conocer las condiciones técnicas y tecnológicas que deben cumplir los sistemas que permitan la digitalización de los archivos físicos y todos los registros certificados inventarios y demás actos o constancias físicas que se generen en los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles. "}
{"input": "La resolución 2 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO2.- Ámbito de aplicación. - La presente norma será de cumplimiento obligatorio para los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles. "}
{"input": "La resolución 3 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO3.- Glosario de Términos. – Para efectos de aplicación de la presente resolución se establecen las siguientes definiciones: Acervo registral: Se considera a los libros índices sus imágenes documentos físicos o electrónicos extractos o contenidos capturados o digitalizados sus respaldos folios y base de datos. Automatización: Es el proceso de uso de tecnología para realizar tareas con muy poca intervención humana. Análisis de Riesgos: Es una herramienta de prevención con la que puedes pronosticar las amenazas con potencial de afectar el desempeño de algún proceso (cambio escalada proyecto o incursión). Anonimización: Es una técnica de tratamiento de datos que elimina o modifica los datos personales identificables para obtener datos anónimos que no se pueden asociar con ninguna persona. Ciberseguridad: Preservación de la confidencialidad integridad y disponibilidad de la información en el ciberespacio. Página 6 de 16 Ciberespacio: Entorno complejo que resulta de la interacción de las personas software y servicios a través de internet por medio de dispositivos tecnológicos y redes conectados al mismo que no existe en forma física alguna. Cifrado: Es la base principal de la seguridad de datos es la forma más sencilla e importante para garantizar que la información de un sistema de computadora no pueda robarla ni leerla alguien que desee utilizarla con fines maliciosos. Digitalización: Proceso para transformar objetos analógicos y físicos en digitales Documento electrónico: Es aquel cuyo contenido ha sido producido en soporte electrónico Escanear: Acción que implica la trasformación de un escrito o formato digital Hardware: Conjunto de los componentes que integran la parte material tecnológica para la gestión de los procesos de digitalización e indexación. Inventario: Lista ordenada de bienes y demás cosas valorables que pertenecen a una persona empresa o institución. Indexación: Es el proceso de incorporar información estructurada al documento digitalizado proveyendo a la base de datos la información adicional que permite clasificar y encontrar la documentación de manera precisa. Integridad: Propiedad de proteger la precisión y completitud de la información. OCR: Es el proceso por el cual se convierte una imagen de texto en un formato que puedan leer las máquinas. Plataforma Tecnológica: Son los diferentes programas y componentes de Hardware y de Software que serán parte del sistema informático de digitalización. Repositorio: Espacio centralizado donde se almacena analiza mantiene y difunde información digital. Sistema informático: Conjunto de elementos físicos y lógicos capaz de almacenar y procesar información. Servidor de Archivo (NAS): Consiste en un dispositivo de almacenamiento de alta capacidad conectado a una red que permite a los usuarios y clientes autorizados almacenar y recuperar datos en una ubicación centralizada. Software: Conjunto de programas instrucciones y reglas informáticas para ejecutar ciertas tareas en una computadora. Página 7 de 16 CAPÍTULO II PROCEDIMIENTO Y APLICACIÓN "}
{"input": "La resolución 4 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO4.- Aplicación de los lineamientos. – Para la aplicación de los lineamientos que orientan la eficiente y eficaz implementación de un sistema de digitalización la Dirección Nacional de Registros Públicos a través de la Coordinación de Infraestructura y Seguridad Informática establecerá las condiciones técnicas y tecnológicas así como los aspectos mínimos a implementar en dicho sistema. "}
{"input": "La resolución 5 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO5.- Del inventario. – Cada Registro de la Propiedad Registro Mercantil y Registro de la Propiedad con funciones y facultades de Registros Mercantiles previo al proceso de digitalización deberá organizar clasificar expurgar foliar e inventariar la documentación física que consta en el registro; e identificará que documentos se van a digitalizar a través de un inventario de información registral compuesta por libros partidas de inscripción o documentos encuadernados y archivos digitales el mismo que contendrá lo siguiente: 1. Identificar el volumen de los documentos a digitalizar clasificados por tipo de documento. 2. Identificar el tipo de archivo de cada documento (empastados anillados grapados etc.). 3. Identificar el tipo de formato de escritura del documento (manual máquina de escribir computador etc.) 4. Identificar las marginaciones en los documentos. 5. Identificar el estado de los documentos en el caso de que estos se encuentren en malas condiciones se determinará si se puede proceder con la restauración previa al proceso de digitalización. "}
{"input": "La resolución 6 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO6.- Del sistema informático. – En el marco del proceso de digitalización e indexación de las imágenes del acervo registral los términos y metodología específica deberá contener las medidas de seguridad necesarias para poner en marcha este procedimiento bajo el sistema de escaneo masivo de acuerdo a los siguientes aspectos mínimos: 1. Deberá contener un gestor documental o repositorio de archivos servidores de bases de datos con sus respectivas políticas de respaldos. Página 8 de 16 2. Deberá contener mínimo los siguientes módulos: escaneo indexación trazabilidad (del documento durante su vida en la línea de producción para indexación) visualización archivo pasivo roles parametrizaciones) auditoría (verificación de la calidad). (permisos de usuarios administración del sistema 3. La plataforma tecnológica del sistema de digitalización deberá contener un servidor de archivos (NAS) base de datos del proceso de indexación y de visualización y archivo pasivo con altas capacidades de almacenamiento. Se deberá considerar la disponibilidad de procesamiento y memoria para la creación de servidores virtuales o físicos donde se desplieguen los sistemas que forman parte de la plataforma tecnológica de digitalización. 4. Contará con escáneres de alta velocidad para diferentes tipos de tamaño de documento para digitalizar documentos con tamaño mayor a A3 o para libros que no puedan ser separados deberá incorporar escáneres especiales. 5. El sistema deberá ser capaz reconocer los diferentes tipos de escritura para acelerar el proceso de indexación de los documentos mediante métodos actuales de OCR (Reconocimiento Óptico de Caracteres) o inteligencia artificial. 6. El sistema deberá permitir procesos manuales de indexación en el caso de que el reconocimiento de caracteres y símbolos se vuelva complejo. El sistema informático deberá tener un ciclo de vida sostenible desde el punto de vista medioambiental y social. CAPÍTULO III PROGRAMAS Y COMPONENTES DEL SISTEMA INFORMÁTICO "}
{"input": "La resolución 7 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO7.-Características de software hardware y comunicaciones. – Para llevar a cabo el proceso de digitalización es necesario que la plataforma tecnológica tenga en cuenta los siguientes programas y componentes: 1. Software: herramienta tecnológica que permita la captura de documentos para convertir archivos físicos en expedientes digitales y que contenga instrumentos adecuados para la búsqueda localización y recuperación de los documentos electrónicos de archivo. 2. Hardware: servidores informáticos para el almacenamiento y administración de imágenes y su información con fines de custodia y preservación los registros a cargo de la gestión del sistema establecerán la capacidad que se requiere considerando el volumen documental anual de escaneo estructura de redundancia para garantizar la continuidad Página 9 de 16 de las operaciones y la replicación de la información en casos de incidentes o catástrofes en el servicio primario. 2.1 Escáneres: se tendrá que considerar los prototipos de escáner con diferentes características y formatos que se adapten a cada necesidad de bajo mediano y alto volumen documental cuya aplicación dependerá de la cantidad de imágenes que se digitalicen así como la velocidad u operatividad de digitalización e indexación. 2.2 Hardware de administración digital: para los fines de digitalización e indexación de la información los registros deberán tomar en cuenta que en el caso de los documentos en papel se precisa de escáneres que permiten la captura de los documentos y transformación a formato digital enviando la información en estructura de imágenes a un ordenador o sistema para su procesamiento y administración. 3. Comunicación: es el conjunto de tecnologías que permiten el acceso la producción procesamiento el tratamiento almacenamiento la transmisión y comunicación de información presentada en diferentes códigos (ya sea texto sonido imagen entre otros). 3.1. Conexiones de red: garantizará la capacidad de establecer una comunicación o crear un vínculo entre diferentes dispositivos. 3.2. Conexiones de internet: es necesario proveer y contar con la adecuada conexión de internet de alta velocidad para facilitar el acceso remoto a los documentos digitalizados. "}
{"input": "La resolución 8 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO8.- Calidad de la imagen. – Para la adecuada consecución de la calidad de imagen se recomienda configurar los escáneres a fin de que por defecto la digitalización e indexación de documentos se realice con las siguientes especificaciones básicas: 1. Color: La digitalización deberá realizarse preferentemente en blanco y negro en el caso que la imagen del documento original a color no fuera legible. 2. Resolución: La resolución deberá estar configurada en 300 ppp/dpi (puntos por pulgada/dot per inch). Si la calidad de visualización del documento resultante lo permite podrá utilizarse una resolución menor 200 o 150 ppp permitiendo un menor tamaño del mismo. 3. Formatos: JPG PNG TIFF y PDF. 4. Tamaño de página: se considerará automático para casos de documentación variada así como para casos específicos el uso de formato A4 opción 210 x 297 mm. Página 10 de 16 5. Reconocimiento de orientación texto: automática a fin de que el driver detecte dicha orientación. 6. Eliminación de desviación: a fin de que el software de digitalización enderece de manera automática las imágenes que se mueven en el proceso de escaneo. 7. Nitidez: con la activación de eliminación de bordes puntos agujeros perforados o rayas "}
{"input": "La resolución 9 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO9.- Comprensión de documentos. - Se deberá utilizar el formato JPG PNG TIFF y PDF al ser los más expedidos en el intercambio de información el mismo que permitirá la preservación y fácil recuperación del archivo digitalizado como resultado final del documento deberá garantizarse que sea legible y se almacenará firmado electrónicamente para que no se pueda alterar en el futuro. CAPÍTULO IV SEGURIDAD INFORMÁTICA "}
{"input": "La resolución 10 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO10.- Seguridad informática. - Los registros digitales que se generen como consecuencia de la transformación así como todos los registros digitales que existan al momento o que se generen en el futuro deberán contar con todas las medidas de ciberseguridad que permitan la preservación de la confidencialidad integridad y disponibilidad de la información que para el efecto emita el ente rector de la transformación digital. "}
{"input": "La resolución 11 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "ARTICULO11.- Plan de respaldo y recuperación de datos. – Cada registro deberá establecer un plan de respaldo el mismo que permitirá mantener la integridad de los documentos digitalizados en caso de pérdida daño o eliminación. Además implementará medidas de recuperación de datos para poder restaurar los archivos digitales en caso de fallas o desastres. DISPOSICIONES GENERALES PRIMERA. - Disponer a la Coordinación de Infraestructura y Seguridad Informática y la Coordinación de Gestión Registro y Seguimiento a través de sus direcciones la ejecución y cumplimiento de la presente resolución. SEGUNDA. - Los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán implementar los sistemas informáticos que permitan la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el registro tomando en cuenta los lineamientos establecidos en la presente resolución. Página 11 de 16 TERCERA. - Disponer a la Dirección de Comunicación la difusión publicación de la presente resolución en la página institucional. DISPOSICIONES TRANSITORIAS PRIMERA. - En el término de cuarenta y cinco (45) días contados a partir de la publicación de la presente resolución en el Registro Oficial la Coordinación de Gestión Registro y Seguimiento deberá remitir un informe respecto del proceso de digitalización en los distintos registros a nivel nacional llevado a cabo desde el año 2013 en el cual entró en vigencia la Resolución Nro. 020-NG-DINARDAP-2013. SEGUNDA. - En el término de treinta (30) días contados a partir de la publicación de la presente resolución en el Registro Oficial los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán notificar a la Coordinación de Gestión Registro y Seguimiento el sistema informático de digitalización que tienen implementado y si cumple con los lineamientos establecidos en la presente resolución. Si cumple deberá en el mismo oficio remitir el plan progresivo de digitalización que no podrán exceder los dieciocho (18) meses contados a partir de la publicación de la presente resolución en el Registro Oficial. Para el efecto los registros priorizarán los últimos veinticinco años de su archivo. Si no cumple los registros deberán reacondicionar o reciclar su sistema informático. Si no es posible reutilizar o reciclar deberá darle un uso responsable coadyuvando a la economía circular. TERCERA. - En el plazo de dieciocho (18) meses contados a partir de la publicación de la presente resolución en el Registro Oficial los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles que no cuenten con un sistema informático de digitalización deberán implementar el sistema informático que permita la transformación a formato digital de todos los registros certificados inventarios y demás actos o constancias físicas que genere el registro que cumpla con los lineamientos de la presente norma. CUARTA. - En el término de treinta (30) días contados a partir de la implementación del sistema informático los Registros de la Propiedad Registros Mercantiles y Registros de la Propiedad con funciones y facultades de Registros Mercantiles deberán remitir a la Coordinación de Gestión Registro y Seguimiento el plan progresivo de digitalización el mismo que no podrá exceder los dieciocho (18) meses contados a partir de su Página 12 de 16 implementación. Para el efecto los registros priorizarán los últimos veinticinco años de su archivo."}
{"input": "La disposición 0 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "DISPOSICION 0 Deróguese la Resolución Nro. 019-NG-DINARDAP-2013 de 9 de mayo de 2013 que contiene la norma que “Crea el Sistema Nacional de Registro de la Propiedad”. "}
{"input": "La disposición 1 del documento de resolución 008-NG-DINARP-2023 es: ", "output": "DISPOSICION 1 Deróguese toda norma que se encuentre en contraposición a la presente resolución. Dado en la ciudad de Quito a los 31 días del mes de julio de 2023. Abg. Daniel Augusto Arboleda Villacreses DIRECTOR NACIONAL (E) DIRECCIÓN NACIONAL DE REGISTROS PÚBLICOS Aprobado: Ab. Geanella Pincay Palacios / Coordinadora de Normativa y de Protección de la Información Revisado: Ab. Sofía Vázquez / Directora de Normativa Elaborado: Ab. / Carolina Morales / Asistente Página 13 de 16 ANEXO I ITEM CUMPLE NO CUMPLE INVENTARIO OBSERVACIONES Identifica el volumen de los documentos a digitalizar clasificados por tipo de documento. Identifica los tipos de encuadernación para cada tipo de documento (empastados anillados grapados etc.) Identifica el tipo de formato de escritura del documento Identifica las marginaciones que se pueden incluir en cada uno de los tipos de documentos Identifica el estado de los documentos SISTEMA La institución cuenta con un sistema de digitalización El sistema de digitalización tiene al menos los siguientes módulos: \\uf0b7 Escaneo \\uf0b7 Indexación \\uf0b7 Trazabilidad (del su línea de para la documento durante vida en producción indexación) \\uf0b7 Visualización \\uf0b7 Ubicación de los documentos en el archivo pasivo \\uf0b7 Administración sistema (permisos del de Página 14 de 16 usuarios parametrización sistema) roles del \\uf0b7 Auditoría (verificación de la calidad) La solución de digitalización dentro de su arquitectura cuenta con: \\uf0b7 Un servidor dedicado a archivos los almacenar digitalizados \\uf0b7 Una base de datos para el proceso de indexación \\uf0b7 Una base de datos para el sistema de visualización y archivo pasivo \\uf0b7 A nivel de infraestructura tecnológica se cuenta con la suficiente capacidad de almacenamiento disponibilidad de procesamiento y memoria para de servidores virtuales para el los desplieguen sistemas que componen la solución de digitalización creación de la Cuenta con escáneres de alta velocidad para los diferentes tamaños de documentos; y de ser el caso escáneres especiales para digitalizar documentos con tamaño mayor a A3 o para libros que no puedan ser separados de su encuadernado Cuenta con métodos automáticos o inteligencia artificial de reconocer los diferentes tipos de escritura que aceleren el proceso de indexación de los documentos Página 15 de 16 Permite procesos manuales de indexación en el caso de que el reconocimiento de caracteres y símbolos sea complejo Utiliza estándares que garanticen que el documento sea legible y que ocupe el menor espacio posible en disco Página 16 de 16"}
