{"input": "La consideración 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 18 de la Constitución de la República del Ecuador determina que: “Todas las personas en forma individual o colectiva tienen derecho a: 1. Buscar recibir intercambiar producir y difundir información veraz verificada oportuna contextualizada plural sin censura previa acerca de los hechos acontecimientos y procesos de interés general y con responsabilidad ulterior. 2. Acceder libremente a la información generada en entidades públicas o en las privadas que manejen fondos del Estado o realicen funciones públicas. No existirá reserva de información excepto en los casos expresamente establecidos en la ley. En caso de violación a los derechos humanos ninguna entidad pública negará la información.\"; "}
{"input": "La consideración 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 226 de la Constitución de la República del Ecuador prescribe: \"Las instituciones del Estado sus organismos dependencias las servidoras o servidores públicos y las personas que actúen en virtud de una potestad estatal ejercerán solamente las competencias y facultades que les sean atribuidas en la Constitución y la ley. (…)\"; "}
{"input": "La consideración 2 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 227 de la Constitución de la República del Ecuador prescribe: “La administración pública constituye un servicio a la colectividad que se rige por los principios de eficacia coordinación participación planificación transparencia y evaluación.”; jerarquía desconcentración descentralización eficiencia calidad "}
{"input": "La consideración 3 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 1 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina: “La presente ley crea y regula el sistema de Registros Públicos y su acceso en entidades públicas o privadas que administren dichas bases o registros. […]”; "}
{"input": "La consideración 4 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 2 de la Ley Orgánica del Sistema Nacional de Registros Públicos manda: “La presente Ley rige para las instituciones del sector público y privado que actualmente o en el futuro administren bases o registros públicos sobre las personas naturales o jurídicas sus bienes o patrimonio y para las usuarias o usuarios de los registros públicos.”; "}
{"input": "La consideración 5 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el inciso primero del artículo 4 de la Ley Orgánica del Sistema Nacional de Registros Públicos dispone: “Las instituciones del sector público y privado y las personas naturales que actualmente o en el futuro administren bases o registros de datos públicos son responsables de la integridad protección y control de los registros y bases de datos a su cargo. Dichas instituciones responderán por la veracidad autenticidad custodia y debida conservación de los registros. […]”; "}
{"input": "La consideración 6 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 6 de la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “Son confidenciales los datos de carácter personal. El acceso a estos datos solo será posible cuando quien los requiera se encuentre debidamente legitimado conforme a los parámetros previstos en la Ley Orgánica de Protección de Datos Personales su respectivo reglamento y demás normativa emitida por la Autoridad de Protección de Datos Personales. Al amparo de esta Ley Página 1 de 6 para acceder a la información sobre el patrimonio de las personas cualquier solicitante deberá justificar y motivar su requerimiento declarar el uso que hará del mismo y consignar sus datos básicos de identidad tales como nombres y apellidos completos número del documento de identidad o ciudadanía dirección domiciliaria y los demás datos que mediante el respectivo reglamento se determinen. Un uso distinto al declarado dará lugar a la determinación de responsabilidades sin perjuicio de las acciones legales que el titular de la información pueda ejercer. La Directora o Director Nacional de Registros Públicos definirá los demás datos que integran el sistema nacional y el tipo de reserva y accesibilidad.”; "}
{"input": "La consideración 7 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 31 de la Ley Orgánica del Sistema Nacional de Registros Públicos determina entre otras las siguientes atribuciones y facultades de la Dirección Nacional de Registros Públicos: “1. Presidir el Sistema Nacional de Registros Públicos cumpliendo y haciendo cumplir sus finalidades y objetivos; 2. Dictar las resoluciones y normas necesarias para la organización y funcionamiento del sistema; [...] 5. Consolidar estandarizar y administrar la base única de datos de todos los Registros Públicos para lo cual todos los integrantes del Sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea conforme ésta se produzca. […]”; "}
{"input": "La consideración 8 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el numeral 2 del artículo 21 de la Ley Orgánica para la Optimización y Eficiencia de Trámites Administrativos establece: “Sin perjuicio de lo establecido en la Ley del Sistema Nacional de Registros Públicos todas las entidades reguladas por esta Ley deberán utilizar obligatoria la información que reposa en: […] 2. El Sistema Nacional de Registros Públicos para lo cual deberán cumplir con el trámite establecido en la ley que lo regula y demás normativa pertinente. Para el efecto dichas entidades tienen la obligación de integrar los registros y bases de datos que estén a su cargo al Sistema Nacional de Registros Públicos en el plazo y con las formalidades requeridas por la Ley del Sistema Nacional de Registros Públicos y la entidad que presida el Sistema Nacional de Registros Públicos.”; "}
{"input": "La consideración 9 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 4 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “El Director Nacional de Registros Públicos previa resolución motivada podrá disponer que se incorporen al Sistema aquellos registros públicos no previstos expresamente en la Ley. La resolución de incorporación podrá expedirse una vez que se verifique lo siguiente: 1. "}
{"input": "La consideración 10 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que se trate de base de datos que contengan un registro relativo a las personas naturales o jurídicas sus bienes o patrimonio o la celebración de actos y contratos sobre los mismos o al cumplimiento de sus obligaciones para con el Estado o sus instituciones; y 2. "}
{"input": "La consideración 11 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que se trate de registros administrados por instituciones del sector público o privado que brinden servicios a la ciudadanía. En su resolución el Director indicará si los datos que constan en los registros que se incorporan al Sistema son accesibles o confidenciales y les dará la protección que corresponda según dicha clasificación. Este estatus podrá ser modificado previa resolución motivada en cualquier tiempo de acuerdo a las circunstancias del momento pero siempre dentro del marco jurídico vigente.”; "}
{"input": "La consideración 12 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 10 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos ordena: “Son funciones del Director Nacional de Registros Públicos a más de las señaladas en la Ley y este Reglamento las siguientes: […] 4. Emitir las resoluciones técnicas operativas y administrativas necesarias para el adecuado funcionamiento del Sistema; […] 8. Ordenar la publicación de la lista de registros públicos de datos para conocimiento de los usuarios; 9. Impulsar promover proteger y difundir el ejercicio de los derechos ciudadanos especialmente en Página 2 de 6 lo referente al acceso a la información y a la protección de datos públicos de carácter personal; […] 11. Determinar mediante resolución las condiciones técnicas necesarias para la ejecución de la interoperabilidad.”; "}
{"input": "La consideración 13 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 15 del Reglamento a la Ley Orgánica del Sistema Nacional de Registros Públicos establece: “La Dirección Nacional de Registros Públicos estandarizará y administrará la información de las fuentes propias y externas para lo cual todos los integrantes del sistema están obligados a proporcionar información digitalizada de sus archivos actualizada y de forma simultánea para proyectos y servicios de información.”; "}
{"input": "La consideración 14 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 1 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 con el cual se decretó la Implementación del Gobierno Electrónico en la Función Ejecutiva expresa: “La implementación del gobierno electrónico en la Función Ejecutiva consiste en el uso de las tecnologías de la información y comunicación por parte de las entidades para transformar las relaciones con los ciudadanos entre entidades de gobierno y empresas privadas a fin de mejorar la calidad de los servicios gubernamentales a los ciudadanos promover la interacción con las empresas privadas fortalecer la participación ciudadana a través del acceso a la información y servicios gubernamentales eficientes y eficaces y coadyuvar con la transparencia participación y colaboración ciudadana.”; "}
{"input": "La consideración 15 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 4 del Decreto Ejecutivo Nro. 981 publicado en el Registro Oficial Suplemento Nro. 143 de 14 de febrero de 2020 señala: “Obligaciones de las entidades de la Función Ejecutiva.- A las instituciones de la Función Ejecutiva dentro del ámbito de este Decreto Ejecutivo les corresponderá: a. Colaborar en la generación de los instrumentos que sean necesarios para la aplicación de presente Decreto así como para su cabal cumplimiento; y b. Utilizar los medios electrónicos que determine el Ministerio de Telecomunicaciones y de la Sociedad de la Información para la aplicación efectiva de las políticas de gobierno electrónico en la gestión pública.”; "}
{"input": "La consideración 16 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que mediante Resolución Nro. 035-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que regula la clasificación de los datos que integren el Sistema Nacional de Registros Públicos”.; "}
{"input": "La consideración 17 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que el artículo 3 de la Resolución Nro. 035-NG-DINARDAP-2016 determina que: “Para efectos de la presente Norma la información que integra el SINARDAP y la que integra las bases de datos públicos se deberá clasificar en: a) Información accesible; b) Información confidencial.”; "}
{"input": "La consideración 18 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que a través de Resolución Nro. 039-NG-DINARDAP-2016 de 22 de septiembre de 2016 la Dirección Nacional de Registros Públicos emitió la “Norma que establece el procedimiento para la integración de entes registrales fuentes externas y fuentes internas en el Sistema Nacional de Registros Públicos” cuyo artículo 7 dispone: “(…) Una vez que el ente registral poseedor de la fuente fuente externa o fuente propia remita el Formulario de Registro del Ente Registral y la Matriz de Datos Públicos la Dirección de Gestión y Registro solicitará a la Dirección de Protección de la Información la elaboración de la clasificación de la información en base (sic) a la “Norma que regula la clasificación de los datos e información que integra el Sistema Nacional de Registros Públicos.” […]”; Página 3 de 6 "}
{"input": "La consideración 19 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que a través de Resolución Nro. 044-NG-DINARDAP-2016 de 22 de septiembre de 2016 contentivo de la “Norma Técnica de Interoperabilidad del Sistema Nacional de Registro de Datos Públicos” en el artículo 5 se establece para la integración: “[…] de los entes registrales fuentes propias y fuentes externas considerados proveedores de información de registro de datos públicos se deben considerar los siguientes componentes: Conectividad Mecanismo de Integración Seguridad.”; mediante informe Nro. DPI-CLASIFICACION-2022-020 de 08 de diciembre de 2022 suscrito por la Dirección de Protección de la Información contentivo del “Informe de Clasificación de Datos” que en su parte pertinente concluye: “(…) Por las características de los datos detallados en el numeral 4.1 del presente informe se los cataloga como confidenciales por lo que para su acceso se requerirá la debida legitimación puesto que en caso de ser utilizados inadecuadamente sin que cumplan con la finalidad específica se atenta contra la dignidad e integridad de las personas naturales así como a los derechos y libertades fundamentales consagrados en la Constitución e instrumentos internacionales. En virtud de ello para solicitar el acceso a estos campos se requiere reunir las condiciones de legitimación señalar la correspondiente justificación jurídica y determinar una finalidad clara de su uso bajo el amparo de las disposiciones de la Ley Orgánica de Protección de Datos Personales. (…)”; "}
{"input": "La consideración 20 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que mediante memorandos Nros. DINARP-DGR-2023-0017-M de 23 de enero de 2023 y DINARP-DGR-2023-0020-M de 30 de enero de 2023 suscritos por la Dirección de Gestión y Registro parafraseando el contenido de los mismos informa: Conforme a lo establecido en el Art. 4 del Reglamento de la Ley del Sistema Nacional de Registros de Datos Públicos el Ministerio de Defensa Nacional mantiene una base relacionada a personas naturales y es administrada por una entidad del sector público; por lo cual me permito señalar el cumplimiento de la normativa referente a la incorporación de los entes registrales al Sistema Nacional de Registros Públicos. "}
{"input": "La consideración 21 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "Que mediante Acuerdo Ministerial Nro. MINTEL-MINTEL-2021-0003 de 22 de junio del 2021 la doctora Vianna Maino Isaías Ministra de Telecomunicaciones y de la Sociedad de la Información resuelve: “(...) Designar a la abogada Angie Karina Jijón Mancheno como Directora Nacional de Registros Públicos quién ejercerá las competencias y atribuciones previstas en la Le y Orgánica del Sistema Nacional de Registros Públicos y demás normativa aplicable (...)”; En ejercicio de las facultades que le otorga la Ley Orgánica del Sistema Nacional de Registros Públicos y su Reglamento de aplicación"}
{"input": "La resolución 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "ARTICULO1.- Incorporar al “Ministerio de Defensa Nacional” como parte del Sistema Nacional de Registros Públicos por ser una institución que posee y administra información pública perteneciente a personas naturales. "}
{"input": "La resolución 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "ARTICULO2.- Integrar los datos otorgados por el “Ministerio de Defensa Nacional” al Sistema Nacional de Registros Públicos conforme al siguiente detalle: Página 4 de 6 Nro. NOMBRE IDENTIFICADOR DEL CAMPO DESCRIPCIÓN DEL CAMPO 1. id_personal identificador: se refiere a la clave primaria de la base de datos que sería como campo único. cédula_personal cédula de identidad nombres_personal nombres y apellidos 2. 3. CLASIFICACIÓN Accesible sin justificación jurídica Accesible con justificación jurídica x x x Nota: La información contenida en el cuadro precedente ha sido obtenida de manera textual de la “Matriz de Datos Públicos” remitida por la entidad requirente. "}
{"input": "La resolución 2 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "ARTICULO3.- El Ministerio de Defensa otorgará la información que versa en el artículo 2 en la forma periodicidad medio soporte y bajo las seguridades prescritas por la Dirección Nacional de Registros Públicos. "}
{"input": "La resolución 3 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "ARTICULO4.- El Ministerio de Defensa es responsable sobre la veracidad autenticidad actualización administración conservación integridad protección y control de sus registros y bases de datos a su cargo."}
{"input": "La disposición 0 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "DISPOSICION 0- Encárguese de la ejecución cumplimiento y seguimiento de la presente resolución a la Coordinación de Gestión Registro y Seguimiento y la Coordinación de Infraestructura y Seguridad Informática de la Dirección Nacional de Registros Públicos. "}
{"input": "La disposición 1 del documento de resolución 002-NG-DINARP-2023 es: ", "output": "DISPOSICION 1 - Encárguese a la Dirección de Comunicación Social la difusión y publicación de la presente resolución en la página web institucional así como la publicación del presente listado de registros públicos constante en la página web institucional. Dado en la ciudad de Quito esta resolución entra en vigencia en la fecha que consta registrada en la firma electrónica. Quito a los 03 del mes de febrero de 2023. Abg. Angie Karina Jijón Mancheno DIRECTORA NACIONAL DE REGISTROS PÚBLICOS Página 5 de 6 Página 6 de 6"}
